MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYDEV_ANAIF_CFG_SAR1_BASE 0x40005908u
#define CYDEV_ANAIF_CFG_SAR1_SIZE 0x00000008u
#define CYREG_SAR1_CSR0 0x40005908u
#define CYREG_SAR1_CSR1 0x40005909u
#define CYREG_SAR1_CSR2 0x4000590au
#define CYREG_SAR1_CSR3 0x4000590bu
#define CYREG_SAR1_CSR4 0x4000590cu
#define CYREG_SAR1_CSR5 0x4000590du
#define CYREG_SAR1_CSR6 0x4000590eu
#define CYREG_SAR1_CSR7 0x4000590fu
#define CYDEV_ANAIF_RT_BASE 0x40005a00u
#define CYDEV_ANAIF_RT_SIZE 0x00000160u
#define CYDEV_ANAIF_RT_SC0_BASE 0x40005a00u
#define CYDEV_ANAIF_RT_SC0_SIZE 0x0000000du
#define CYREG_SC0_SW0 0x40005a00u
#define CYREG_SC0_SW2 0x40005a02u
#define CYREG_SC0_SW3 0x40005a03u
#define CYREG_SC0_SW4 0x40005a04u
#define CYREG_SC0_SW6 0x40005a06u
#define CYREG_SC0_SW7 0x40005a07u
#define CYREG_SC0_SW8 0x40005a08u
#define CYREG_SC0_SW10 0x40005a0au
#define CYREG_SC0_CLK 0x40005a0bu
#define CYREG_SC0_BST 0x40005a0cu
#define CYDEV_ANAIF_RT_SC1_BASE 0x40005a10u
#define CYDEV_ANAIF_RT_SC1_SIZE 0x0000000du
#define CYREG_SC1_SW0 0x40005a10u
#define CYREG_SC1_SW2 0x40005a12u
#define CYREG_SC1_SW3 0x40005a13u
#define CYREG_SC1_SW4 0x40005a14u
#define CYREG_SC1_SW6 0x40005a16u
#define CYREG_SC1_SW7 0x40005a17u
#define CYREG_SC1_SW8 0x40005a18u
#define CYREG_SC1_SW10 0x40005a1au
#define CYREG_SC1_CLK 0x40005a1bu
#define CYREG_SC1_BST 0x40005a1cu
#define CYDEV_ANAIF_RT_SC2_BASE 0x40005a20u
#define CYDEV_ANAIF_RT_SC2_SIZE 0x0000000du
#define CYREG_SC2_SW0 0x40005a20u
#define CYREG_SC2_SW2 0x40005a22u
#define CYREG_SC2_SW3 0x40005a23u
#define CYREG_SC2_SW4 0x40005a24u
#define CYREG_SC2_SW6 0x40005a26u
#define CYREG_SC2_SW7 0x40005a27u
#define CYREG_SC2_SW8 0x40005a28u
#define CYREG_SC2_SW10 0x40005a2au
#define CYREG_SC2_CLK 0x40005a2bu
#define CYREG_SC2_BST 0x40005a2cu
#define CYDEV_ANAIF_RT_SC3_BASE 0x40005a30u
#define CYDEV_ANAIF_RT_SC3_SIZE 0x0000000du
#define CYREG_SC3_SW0 0x40005a30u
#define CYREG_SC3_SW2 0x40005a32u
#define CYREG_SC3_SW3 0x40005a33u
#define CYREG_SC3_SW4 0x40005a34u
#define CYREG_SC3_SW6 0x40005a36u
#define CYREG_SC3_SW7 0x40005a37u
#define CYREG_SC3_SW8 0x40005a38u
#define CYREG_SC3_SW10 0x40005a3au
#define CYREG_SC3_CLK 0x40005a3bu
#define CYREG_SC3_BST 0x40005a3cu
#define CYDEV_ANAIF_RT_DAC0_BASE 0x40005a80u
#define CYDEV_ANAIF_RT_DAC0_SIZE 0x00000008u
#define CYREG_DAC0_SW0 0x40005a80u
#define CYREG_DAC0_SW2 0x40005a82u
#define CYREG_DAC0_SW3 0x40005a83u
#define CYREG_DAC0_SW4 0x40005a84u
#define CYREG_DAC0_STROBE 0x40005a87u
#define CYDEV_ANAIF_RT_DAC1_BASE 0x40005a88u
#define CYDEV_ANAIF_RT_DAC1_SIZE 0x00000008u
#define CYREG_DAC1_SW0 0x40005a88u
#define CYREG_DAC1_SW2 0x40005a8au
#define CYREG_DAC1_SW3 0x40005a8bu
#define CYREG_DAC1_SW4 0x40005a8cu
#define CYREG_DAC1_STROBE 0x40005a8fu
#define CYDEV_ANAIF_RT_DAC2_BASE 0x40005a90u
#define CYDEV_ANAIF_RT_DAC2_SIZE 0x00000008u
#define CYREG_DAC2_SW0 0x40005a90u
#define CYREG_DAC2_SW2 0x40005a92u
#define CYREG_DAC2_SW3 0x40005a93u
#define CYREG_DAC2_SW4 0x40005a94u
#define CYREG_DAC2_STROBE 0x40005a97u
#define CYDEV_ANAIF_RT_DAC3_BASE 0x40005a98u
#define CYDEV_ANAIF_RT_DAC3_SIZE 0x00000008u
#define CYREG_DAC3_SW0 0x40005a98u
#define CYREG_DAC3_SW2 0x40005a9au
#define CYREG_DAC3_SW3 0x40005a9bu
#define CYREG_DAC3_SW4 0x40005a9cu
#define CYREG_DAC3_STROBE 0x40005a9fu
#define CYDEV_ANAIF_RT_CMP0_BASE 0x40005ac0u
#define CYDEV_ANAIF_RT_CMP0_SIZE 0x00000008u
#define CYREG_CMP0_SW0 0x40005ac0u
#define CYREG_CMP0_SW2 0x40005ac2u
#define CYREG_CMP0_SW3 0x40005ac3u
#define CYREG_CMP0_SW4 0x40005ac4u
#define CYREG_CMP0_SW6 0x40005ac6u
#define CYREG_CMP0_CLK 0x40005ac7u
#define CYDEV_ANAIF_RT_CMP1_BASE 0x40005ac8u
#define CYDEV_ANAIF_RT_CMP1_SIZE 0x00000008u
#define CYREG_CMP1_SW0 0x40005ac8u
#define CYREG_CMP1_SW2 0x40005acau
#define CYREG_CMP1_SW3 0x40005acbu
#define CYREG_CMP1_SW4 0x40005accu
#define CYREG_CMP1_SW6 0x40005aceu
#define CYREG_CMP1_CLK 0x40005acfu
#define CYDEV_ANAIF_RT_CMP2_BASE 0x40005ad0u
#define CYDEV_ANAIF_RT_CMP2_SIZE 0x00000008u
#define CYREG_CMP2_SW0 0x40005ad0u
#define CYREG_CMP2_SW2 0x40005ad2u
#define CYREG_CMP2_SW3 0x40005ad3u
#define CYREG_CMP2_SW4 0x40005ad4u
#define CYREG_CMP2_SW6 0x40005ad6u
#define CYREG_CMP2_CLK 0x40005ad7u
#define CYDEV_ANAIF_RT_CMP3_BASE 0x40005ad8u
#define CYDEV_ANAIF_RT_CMP3_SIZE 0x00000008u
#define CYREG_CMP3_SW0 0x40005ad8u
#define CYREG_CMP3_SW2 0x40005adau
#define CYREG_CMP3_SW3 0x40005adbu
#define CYREG_CMP3_SW4 0x40005adcu
#define CYREG_CMP3_SW6 0x40005adeu
#define CYREG_CMP3_CLK 0x40005adfu
#define CYDEV_ANAIF_RT_DSM0_BASE 0x40005b00u
#define CYDEV_ANAIF_RT_DSM0_SIZE 0x00000008u
#define CYREG_DSM0_SW0 0x40005b00u
#define CYREG_DSM0_SW2 0x40005b02u
#define CYREG_DSM0_SW3 0x40005b03u
#define CYREG_DSM0_SW4 0x40005b04u
#define CYREG_DSM0_SW6 0x40005b06u
#define CYREG_DSM0_CLK 0x40005b07u
#define CYDEV_ANAIF_RT_SAR0_BASE 0x40005b20u
#define CYDEV_ANAIF_RT_SAR0_SIZE 0x00000008u
#define CYREG_SAR0_SW0 0x40005b20u
#define CYREG_SAR0_SW2 0x40005b22u
#define CYREG_SAR0_SW3 0x40005b23u
#define CYREG_SAR0_SW4 0x40005b24u
#define CYREG_SAR0_SW6 0x40005b26u
#define CYREG_SAR0_CLK 0x40005b27u
#define CYDEV_ANAIF_RT_SAR1_BASE 0x40005b28u
#define CYDEV_ANAIF_RT_SAR1_SIZE 0x00000008u
#define CYREG_SAR1_SW0 0x40005b28u
#define CYREG_SAR1_SW2 0x40005b2au
#define CYREG_SAR1_SW3 0x40005b2bu
#define CYREG_SAR1_SW4 0x40005b2cu
#define CYREG_SAR1_SW6 0x40005b2eu
#define CYREG_SAR1_CLK 0x40005b2fu
#define CYDEV_ANAIF_RT_ABUF0_BASE 0x40005b40u
#define CYDEV_ANAIF_RT_ABUF0_SIZE 0x00000002u
#define CYREG_ABUF0_MX 0x40005b40u
#define CYREG_ABUF0_SW 0x40005b41u
#define CYDEV_ANAIF_RT_ABUF1_BASE 0x40005b42u
#define CYDEV_ANAIF_RT_ABUF1_SIZE 0x00000002u
#define CYREG_ABUF1_MX 0x40005b42u
#define CYREG_ABUF1_SW 0x40005b43u
#define CYDEV_ANAIF_RT_ABUF2_BASE 0x40005b44u
#define CYDEV_ANAIF_RT_ABUF2_SIZE 0x00000002u
#define CYREG_ABUF2_MX 0x40005b44u
#define CYREG_ABUF2_SW 0x40005b45u
#define CYDEV_ANAIF_RT_ABUF3_BASE 0x40005b46u
#define CYDEV_ANAIF_RT_ABUF3_SIZE 0x00000002u
#define CYREG_ABUF3_MX 0x40005b46u
#define CYREG_ABUF3_SW 0x40005b47u
#define CYDEV_ANAIF_RT_LCDDAC_BASE 0x40005b50u
#define CYDEV_ANAIF_RT_LCDDAC_SIZE 0x00000005u
#define CYREG_LCDDAC_SW0 0x40005b50u
#define CYREG_LCDDAC_SW1 0x40005b51u
#define CYREG_LCDDAC_SW2 0x40005b52u
#define CYREG_LCDDAC_SW3 0x40005b53u
#define CYREG_LCDDAC_SW4 0x40005b54u
#define CYDEV_ANAIF_RT_SC_BASE 0x40005b56u
#define CYDEV_ANAIF_RT_SC_SIZE 0x00000001u
#define CYREG_SC_MISC 0x40005b56u
#define CYDEV_ANAIF_RT_BUS_BASE 0x40005b58u
#define CYDEV_ANAIF_RT_BUS_SIZE 0x00000004u
#define CYREG_BUS_SW0 0x40005b58u
#define CYREG_BUS_SW2 0x40005b5au
#define CYREG_BUS_SW3 0x40005b5bu
#define CYDEV_ANAIF_RT_DFT_BASE 0x40005b5cu
#define CYDEV_ANAIF_RT_DFT_SIZE 0x00000004u
#define CYREG_DFT_CR0 0x40005b5cu
#define CYREG_DFT_CR1 0x40005b5du
#define CYREG_DFT_CR2 0x40005b5eu
#define CYREG_DFT_CR3 0x40005b5fu
#define CYDEV_ANAIF_WRK_BASE 0x40005b80u
#define CYDEV_ANAIF_WRK_SIZE 0x00000029u
#define CYDEV_ANAIF_WRK_DAC0_BASE 0x40005b80u
#define CYDEV_ANAIF_WRK_DAC0_SIZE 0x00000001u
#define CYREG_DAC0_D 0x40005b80u
#define CYDEV_ANAIF_WRK_DAC1_BASE 0x40005b81u
#define CYDEV_ANAIF_WRK_DAC1_SIZE 0x00000001u
#define CYREG_DAC1_D 0x40005b81u
#define CYDEV_ANAIF_WRK_DAC2_BASE 0x40005b82u
#define CYDEV_ANAIF_WRK_DAC2_SIZE 0x00000001u
#define CYREG_DAC2_D 0x40005b82u
#define CYDEV_ANAIF_WRK_DAC3_BASE 0x40005b83u
#define CYDEV_ANAIF_WRK_DAC3_SIZE 0x00000001u
#define CYREG_DAC3_D 0x40005b83u
#define CYDEV_ANAIF_WRK_DSM0_BASE 0x40005b88u
#define CYDEV_ANAIF_WRK_DSM0_SIZE 0x00000002u
#define CYREG_DSM0_OUT0 0x40005b88u
#define CYREG_DSM0_OUT1 0x40005b89u
#define CYDEV_ANAIF_WRK_SC_BASE 0x40005b8cu
#define CYDEV_ANAIF_WRK_SC_SIZE 0x00000002u
#define CYREG_SC_SR 0x40005b8cu
#define CYREG_SC_MSK 0x40005b8du
#define CYDEV_ANAIF_WRK_LUT_BASE 0x40005b8eu
#define CYDEV_ANAIF_WRK_LUT_SIZE 0x00000002u
#define CYREG_LUT_SR 0x40005b8eu
#define CYREG_LUT_MSK 0x40005b8fu
#define CYDEV_ANAIF_WRK_CMP_BASE 0x40005b90u
#define CYDEV_ANAIF_WRK_CMP_SIZE 0x00000002u
#define CYREG_CMP_WRK 0x40005b90u
#define CYREG_CMP_LTRI 0x40005b91u
#define CYDEV_ANAIF_WRK_TFAULT_BASE 0x40005b92u
#define CYDEV_ANAIF_WRK_TFAULT_SIZE 0x00000004u
#define CYREG_TFAULT_WRK0 0x40005b92u
#define CYREG_TFAULT_WRK1 0x40005b93u
#define CYREG_TFAULT_WRK2 0x40005b94u
#define CYREG_TFAULT_WRK3 0x40005b95u
#define CYDEV_ANAIF_WRK_SAR0_BASE 0x40005ba0u
#define CYDEV_ANAIF_WRK_SAR0_SIZE 0x00000002u
#define CYREG_SAR0_WRK0 0x40005ba0u
#define CYREG_SAR0_WRK1 0x40005ba1u
#define CYDEV_ANAIF_WRK_SAR1_BASE 0x40005ba2u
#define CYDEV_ANAIF_WRK_SAR1_SIZE 0x00000002u
#define CYREG_SAR1_WRK0 0x40005ba2u
#define CYREG_SAR1_WRK1 0x40005ba3u
#define CYDEV_ANAIF_WRK_SARS_BASE 0x40005ba8u
#define CYDEV_ANAIF_WRK_SARS_SIZE 0x00000001u
#define CYREG_ANAIF_WRK_SARS_SOF 0x40005ba8u
#define CYDEV_USB_BASE 0x40006000u
#define CYDEV_USB_SIZE 0x00000300u
#define CYREG_USB_EP0_DR0 0x40006000u
#define CYREG_USB_EP0_DR1 0x40006001u
#define CYREG_USB_EP0_DR2 0x40006002u
#define CYREG_USB_EP0_DR3 0x40006003u
#define CYREG_USB_EP0_DR4 0x40006004u
#define CYREG_USB_EP0_DR5 0x40006005u
#define CYREG_USB_EP0_DR6 0x40006006u
#define CYREG_USB_EP0_DR7 0x40006007u
#define CYREG_USB_CR0 0x40006008u
#define CYREG_USB_CR1 0x40006009u
#define CYREG_USB_SIE_EP_INT_EN 0x4000600au
#define CYREG_USB_SIE_EP_INT_SR 0x4000600bu
#define CYDEV_USB_SIE_EP1_BASE 0x4000600cu
#define CYDEV_USB_SIE_EP1_SIZE 0x00000003u
#define CYREG_USB_SIE_EP1_CNT0 0x4000600cu
#define CYREG_USB_SIE_EP1_CNT1 0x4000600du
#define CYREG_USB_SIE_EP1_CR0 0x4000600eu
#define CYREG_USB_USBIO_CR0 0x40006010u
#define CYREG_USB_USBIO_CR2 0x40006011u
#define CYREG_USB_USBIO_CR1 0x40006012u
#define CYREG_USB_SOF0 0x40006018u
#define CYREG_USB_SOF1 0x40006019u
#define CYDEV_USB_SIE_EP2_BASE 0x4000601cu
#define CYDEV_USB_SIE_EP2_SIZE 0x00000003u
#define CYREG_USB_SIE_EP2_CNT0 0x4000601cu
#define CYREG_USB_SIE_EP2_CNT1 0x4000601du
#define CYREG_USB_SIE_EP2_CR0 0x4000601eu
#define CYREG_USB_OSCLK_DR0 0x40006020u
#define CYREG_USB_OSCLK_DR1 0x40006021u
#define CYREG_USB_EP0_CR 0x40006028u
#define CYREG_USB_EP0_CNT 0x40006029u
#define CYDEV_USB_SIE_EP3_BASE 0x4000602cu
#define CYDEV_USB_SIE_EP3_SIZE 0x00000003u
#define CYREG_USB_SIE_EP3_CNT0 0x4000602cu
#define CYREG_USB_SIE_EP3_CNT1 0x4000602du
#define CYREG_USB_SIE_EP3_CR0 0x4000602eu
#define CYDEV_USB_SIE_EP4_BASE 0x4000603cu
#define CYDEV_USB_SIE_EP4_SIZE 0x00000003u
#define CYREG_USB_SIE_EP4_CNT0 0x4000603cu
#define CYREG_USB_SIE_EP4_CNT1 0x4000603du
#define CYREG_USB_SIE_EP4_CR0 0x4000603eu
#define CYDEV_USB_SIE_EP5_BASE 0x4000604cu
#define CYDEV_USB_SIE_EP5_SIZE 0x00000003u
#define CYREG_USB_SIE_EP5_CNT0 0x4000604cu
#define CYREG_USB_SIE_EP5_CNT1 0x4000604du
#define CYREG_USB_SIE_EP5_CR0 0x4000604eu
#define CYDEV_USB_SIE_EP6_BASE 0x4000605cu
#define CYDEV_USB_SIE_EP6_SIZE 0x00000003u
#define CYREG_USB_SIE_EP6_CNT0 0x4000605cu
#define CYREG_USB_SIE_EP6_CNT1 0x4000605du
#define CYREG_USB_SIE_EP6_CR0 0x4000605eu
#define CYDEV_USB_SIE_EP7_BASE 0x4000606cu
#define CYDEV_USB_SIE_EP7_SIZE 0x00000003u
#define CYREG_USB_SIE_EP7_CNT0 0x4000606cu
#define CYREG_USB_SIE_EP7_CNT1 0x4000606du
#define CYREG_USB_SIE_EP7_CR0 0x4000606eu
#define CYDEV_USB_SIE_EP8_BASE 0x4000607cu
#define CYDEV_USB_SIE_EP8_SIZE 0x00000003u
#define CYREG_USB_SIE_EP8_CNT0 0x4000607cu
#define CYREG_USB_SIE_EP8_CNT1 0x4000607du
#define CYREG_USB_SIE_EP8_CR0 0x4000607eu
#define CYDEV_USB_ARB_EP1_BASE 0x40006080u
#define CYDEV_USB_ARB_EP1_SIZE 0x00000003u
#define CYREG_USB_ARB_EP1_CFG 0x40006080u
#define CYREG_USB_ARB_EP1_INT_EN 0x40006081u
#define CYREG_USB_ARB_EP1_SR 0x40006082u
#define CYDEV_USB_ARB_RW1_BASE 0x40006084u
#define CYDEV_USB_ARB_RW1_SIZE 0x00000005u
#define CYREG_USB_ARB_RW1_WA 0x40006084u
#define CYREG_USB_ARB_RW1_WA_MSB 0x40006085u
#define CYREG_USB_ARB_RW1_RA 0x40006086u
#define CYREG_USB_ARB_RW1_RA_MSB 0x40006087u
#define CYREG_USB_ARB_RW1_DR 0x40006088u
#define CYREG_USB_BUF_SIZE 0x4000608cu
#define CYREG_USB_EP_ACTIVE 0x4000608eu
#define CYREG_USB_EP_TYPE 0x4000608fu
#define CYDEV_USB_ARB_EP2_BASE 0x40006090u
#define CYDEV_USB_ARB_EP2_SIZE 0x00000003u
#define CYREG_USB_ARB_EP2_CFG 0x40006090u
#define CYREG_USB_ARB_EP2_INT_EN 0x40006091u
#define CYREG_USB_ARB_EP2_SR 0x40006092u
#define CYDEV_USB_ARB_RW2_BASE 0x40006094u
#define CYDEV_USB_ARB_RW2_SIZE 0x00000005u
#define CYREG_USB_ARB_RW2_WA 0x40006094u
#define CYREG_USB_ARB_RW2_WA_MSB 0x40006095u
#define CYREG_USB_ARB_RW2_RA 0x40006096u
#define CYREG_USB_ARB_RW2_RA_MSB 0x40006097u
#define CYREG_USB_ARB_RW2_DR 0x40006098u
#define CYREG_USB_ARB_CFG 0x4000609cu
#define CYREG_USB_USB_CLK_EN 0x4000609du
#define CYREG_USB_ARB_INT_EN 0x4000609eu
#define CYREG_USB_ARB_INT_SR 0x4000609fu
#define CYDEV_USB_ARB_EP3_BASE 0x400060a0u
#define CYDEV_USB_ARB_EP3_SIZE 0x00000003u
#define CYREG_USB_ARB_EP3_CFG 0x400060a0u
#define CYREG_USB_ARB_EP3_INT_EN 0x400060a1u
#define CYREG_USB_ARB_EP3_SR 0x400060a2u
#define CYDEV_USB_ARB_RW3_BASE 0x400060a4u
#define CYDEV_USB_ARB_RW3_SIZE 0x00000005u
#define CYREG_USB_ARB_RW3_WA 0x400060a4u
#define CYREG_USB_ARB_RW3_WA_MSB 0x400060a5u
#define CYREG_USB_ARB_RW3_RA 0x400060a6u
#define CYREG_USB_ARB_RW3_RA_MSB 0x400060a7u
#define CYREG_USB_ARB_RW3_DR 0x400060a8u
#define CYREG_USB_CWA 0x400060acu
#define CYREG_USB_CWA_MSB 0x400060adu
#define CYDEV_USB_ARB_EP4_BASE 0x400060b0u
#define CYDEV_USB_ARB_EP4_SIZE 0x00000003u
#define CYREG_USB_ARB_EP4_CFG 0x400060b0u
#define CYREG_USB_ARB_EP4_INT_EN 0x400060b1u
#define CYREG_USB_ARB_EP4_SR 0x400060b2u
#define CYDEV_USB_ARB_RW4_BASE 0x400060b4u
#define CYDEV_USB_ARB_RW4_SIZE 0x00000005u
#define CYREG_USB_ARB_RW4_WA 0x400060b4u
#define CYREG_USB_ARB_RW4_WA_MSB 0x400060b5u
#define CYREG_USB_ARB_RW4_RA 0x400060b6u
#define CYREG_USB_ARB_RW4_RA_MSB 0x400060b7u
#define CYREG_USB_ARB_RW4_DR 0x400060b8u
#define CYREG_USB_DMA_THRES 0x400060bcu
#define CYREG_USB_DMA_THRES_MSB 0x400060bdu
#define CYDEV_USB_ARB_EP5_BASE 0x400060c0u
#define CYDEV_USB_ARB_EP5_SIZE 0x00000003u
#define CYREG_USB_ARB_EP5_CFG 0x400060c0u
#define CYREG_USB_ARB_EP5_INT_EN 0x400060c1u
#define CYREG_USB_ARB_EP5_SR 0x400060c2u
#define CYDEV_USB_ARB_RW5_BASE 0x400060c4u
#define CYDEV_USB_ARB_RW5_SIZE 0x00000005u
#define CYREG_USB_ARB_RW5_WA 0x400060c4u
#define CYREG_USB_ARB_RW5_WA_MSB 0x400060c5u
#define CYREG_USB_ARB_RW5_RA 0x400060c6u
#define CYREG_USB_ARB_RW5_RA_MSB 0x400060c7u
#define CYREG_USB_ARB_RW5_DR 0x400060c8u
#define CYREG_USB_BUS_RST_CNT 0x400060ccu
#define CYDEV_USB_ARB_EP6_BASE 0x400060d0u
#define CYDEV_USB_ARB_EP6_SIZE 0x00000003u
#define CYREG_USB_ARB_EP6_CFG 0x400060d0u
#define CYREG_USB_ARB_EP6_INT_EN 0x400060d1u
#define CYREG_USB_ARB_EP6_SR 0x400060d2u
#define CYDEV_USB_ARB_RW6_BASE 0x400060d4u
#define CYDEV_USB_ARB_RW6_SIZE 0x00000005u
#define CYREG_USB_ARB_RW6_WA 0x400060d4u
#define CYREG_USB_ARB_RW6_WA_MSB 0x400060d5u
#define CYREG_USB_ARB_RW6_RA 0x400060d6u
#define CYREG_USB_ARB_RW6_RA_MSB 0x400060d7u
#define CYREG_USB_ARB_RW6_DR 0x400060d8u
#define CYDEV_USB_ARB_EP7_BASE 0x400060e0u
#define CYDEV_USB_ARB_EP7_SIZE 0x00000003u
#define CYREG_USB_ARB_EP7_CFG 0x400060e0u
#define CYREG_USB_ARB_EP7_INT_EN 0x400060e1u
#define CYREG_USB_ARB_EP7_SR 0x400060e2u
#define CYDEV_USB_ARB_RW7_BASE 0x400060e4u
#define CYDEV_USB_ARB_RW7_SIZE 0x00000005u
#define CYREG_USB_ARB_RW7_WA 0x400060e4u
#define CYREG_USB_ARB_RW7_WA_MSB 0x400060e5u
#define CYREG_USB_ARB_RW7_RA 0x400060e6u
#define CYREG_USB_ARB_RW7_RA_MSB 0x400060e7u
#define CYREG_USB_ARB_RW7_DR 0x400060e8u
#define CYDEV_USB_ARB_EP8_BASE 0x400060f0u
#define CYDEV_USB_ARB_EP8_SIZE 0x00000003u
#define CYREG_USB_ARB_EP8_CFG 0x400060f0u
#define CYREG_USB_ARB_EP8_INT_EN 0x400060f1u
#define CYREG_USB_ARB_EP8_SR 0x400060f2u
#define CYDEV_USB_ARB_RW8_BASE 0x400060f4u
#define CYDEV_USB_ARB_RW8_SIZE 0x00000005u
#define CYREG_USB_ARB_RW8_WA 0x400060f4u
#define CYREG_USB_ARB_RW8_WA_MSB 0x400060f5u
#define CYREG_USB_ARB_RW8_RA 0x400060f6u
#define CYREG_USB_ARB_RW8_RA_MSB 0x400060f7u
#define CYREG_USB_ARB_RW8_DR 0x400060f8u
#define CYDEV_USB_MEM_BASE 0x40006100u
#define CYDEV_USB_MEM_SIZE 0x00000200u
#define CYREG_USB_MEM_DATA_MBASE 0x40006100u
#define CYREG_USB_MEM_DATA_MSIZE 0x00000200u
#define CYDEV_UWRK_BASE 0x40006400u
#define CYDEV_UWRK_SIZE 0x00000b60u
#define CYDEV_UWRK_UWRK8_BASE 0x40006400u
#define CYDEV_UWRK_UWRK8_SIZE 0x000003b0u
#define CYDEV_UWRK_UWRK8_B0_BASE 0x40006400u
#define CYDEV_UWRK_UWRK8_B0_SIZE 0x000000b0u
#define CYREG_B0_UDB00_A0 0x40006400u
#define CYREG_B0_UDB01_A0 0x40006401u
#define CYREG_B0_UDB02_A0 0x40006402u
#define CYREG_B0_UDB03_A0 0x40006403u
#define CYREG_B0_UDB04_A0 0x40006404u
#define CYREG_B0_UDB05_A0 0x40006405u
#define CYREG_B0_UDB06_A0 0x40006406u
#define CYREG_B0_UDB07_A0 0x40006407u
#define CYREG_B0_UDB08_A0 0x40006408u
#define CYREG_B0_UDB09_A0 0x40006409u
#define CYREG_B0_UDB10_A0 0x4000640au
#define CYREG_B0_UDB11_A0 0x4000640bu
#define CYREG_B0_UDB12_A0 0x4000640cu
#define CYREG_B0_UDB13_A0 0x4000640du
#define CYREG_B0_UDB14_A0 0x4000640eu
#define CYREG_B0_UDB15_A0 0x4000640fu
#define CYREG_B0_UDB00_A1 0x40006410u
#define CYREG_B0_UDB01_A1 0x40006411u
#define CYREG_B0_UDB02_A1 0x40006412u
#define CYREG_B0_UDB03_A1 0x40006413u
#define CYREG_B0_UDB04_A1 0x40006414u
#define CYREG_B0_UDB05_A1 0x40006415u
#define CYREG_B0_UDB06_A1 0x40006416u
#define CYREG_B0_UDB07_A1 0x40006417u
#define CYREG_B0_UDB08_A1 0x40006418u
#define CYREG_B0_UDB09_A1 0x40006419u
#define CYREG_B0_UDB10_A1 0x4000641au
#define CYREG_B0_UDB11_A1 0x4000641bu
#define CYREG_B0_UDB12_A1 0x4000641cu
#define CYREG_B0_UDB13_A1 0x4000641du
#define CYREG_B0_UDB14_A1 0x4000641eu
#define CYREG_B0_UDB15_A1 0x4000641fu
#define CYREG_B0_UDB00_D0 0x40006420u
#define CYREG_B0_UDB01_D0 0x40006421u
#define CYREG_B0_UDB02_D0 0x40006422u
#define CYREG_B0_UDB03_D0 0x40006423u
#define CYREG_B0_UDB04_D0 0x40006424u
#define CYREG_B0_UDB05_D0 0x40006425u
#define CYREG_B0_UDB06_D0 0x40006426u
#define CYREG_B0_UDB07_D0 0x40006427u
#define CYREG_B0_UDB08_D0 0x40006428u
#define CYREG_B0_UDB09_D0 0x40006429u
#define CYREG_B0_UDB10_D0 0x4000642au
#define CYREG_B0_UDB11_D0 0x4000642bu
#define CYREG_B0_UDB12_D0 0x4000642cu
#define CYREG_B0_UDB13_D0 0x4000642du
#define CYREG_B0_UDB14_D0 0x4000642eu
#define CYREG_B0_UDB15_D0 0x4000642fu
#define CYREG_B0_UDB00_D1 0x40006430u
#define CYREG_B0_UDB01_D1 0x40006431u
#define CYREG_B0_UDB02_D1 0x40006432u
#define CYREG_B0_UDB03_D1 0x40006433u
#define CYREG_B0_UDB04_D1 0x40006434u
#define CYREG_B0_UDB05_D1 0x40006435u
#define CYREG_B0_UDB06_D1 0x40006436u
#define CYREG_B0_UDB07_D1 0x40006437u
#define CYREG_B0_UDB08_D1 0x40006438u
#define CYREG_B0_UDB09_D1 0x40006439u
#define CYREG_B0_UDB10_D1 0x4000643au
#define CYREG_B0_UDB11_D1 0x4000643bu
#define CYREG_B0_UDB12_D1 0x4000643cu
#define CYREG_B0_UDB13_D1 0x4000643du
#define CYREG_B0_UDB14_D1 0x4000643eu
#define CYREG_B0_UDB15_D1 0x4000643fu
#define CYREG_B0_UDB00_F0 0x40006440u
#define CYREG_B0_UDB01_F0 0x40006441u
#define CYREG_B0_UDB02_F0 0x40006442u
#define CYREG_B0_UDB03_F0 0x40006443u
#define CYREG_B0_UDB04_F0 0x40006444u
#define CYREG_B0_UDB05_F0 0x40006445u
#define CYREG_B0_UDB06_F0 0x40006446u
#define CYREG_B0_UDB07_F0 0x40006447u
#define CYREG_B0_UDB08_F0 0x40006448u
#define CYREG_B0_UDB09_F0 0x40006449u
#define CYREG_B0_UDB10_F0 0x4000644au
#define CYREG_B0_UDB11_F0 0x4000644bu
#define CYREG_B0_UDB12_F0 0x4000644cu
#define CYREG_B0_UDB13_F0 0x4000644du
#define CYREG_B0_UDB14_F0 0x4000644eu
#define CYREG_B0_UDB15_F0 0x4000644fu
#define CYREG_B0_UDB00_F1 0x40006450u
#define CYREG_B0_UDB01_F1 0x40006451u
#define CYREG_B0_UDB02_F1 0x40006452u
#define CYREG_B0_UDB03_F1 0x40006453u
#define CYREG_B0_UDB04_F1 0x40006454u
#define CYREG_B0_UDB05_F1 0x40006455u
#define CYREG_B0_UDB06_F1 0x40006456u
#define CYREG_B0_UDB07_F1 0x40006457u
#define CYREG_B0_UDB08_F1 0x40006458u
#define CYREG_B0_UDB09_F1 0x40006459u
#define CYREG_B0_UDB10_F1 0x4000645au
#define CYREG_B0_UDB11_F1 0x4000645bu
#define CYREG_B0_UDB12_F1 0x4000645cu
#define CYREG_B0_UDB13_F1 0x4000645du
#define CYREG_B0_UDB14_F1 0x4000645eu
#define CYREG_B0_UDB15_F1 0x4000645fu
#define CYREG_B0_UDB00_ST 0x40006460u
#define CYREG_B0_UDB01_ST 0x40006461u
#define CYREG_B0_UDB02_ST 0x40006462u
#define CYREG_B0_UDB03_ST 0x40006463u
#define CYREG_B0_UDB04_ST 0x40006464u
#define CYREG_B0_UDB05_ST 0x40006465u
#define CYREG_B0_UDB06_ST 0x40006466u
#define CYREG_B0_UDB07_ST 0x40006467u
#define CYREG_B0_UDB08_ST 0x40006468u
#define CYREG_B0_UDB09_ST 0x40006469u
#define CYREG_B0_UDB10_ST 0x4000646au
#define CYREG_B0_UDB11_ST 0x4000646bu
#define CYREG_B0_UDB12_ST 0x4000646cu
#define CYREG_B0_UDB13_ST 0x4000646du
#define CYREG_B0_UDB14_ST 0x4000646eu
#define CYREG_B0_UDB15_ST 0x4000646fu
#define CYREG_B0_UDB00_CTL 0x40006470u
#define CYREG_B0_UDB01_CTL 0x40006471u
#define CYREG_B0_UDB02_CTL 0x40006472u
#define CYREG_B0_UDB03_CTL 0x40006473u
#define CYREG_B0_UDB04_CTL 0x40006474u
#define CYREG_B0_UDB05_CTL 0x40006475u
#define CYREG_B0_UDB06_CTL 0x40006476u
#define CYREG_B0_UDB07_CTL 0x40006477u
#define CYREG_B0_UDB08_CTL 0x40006478u
#define CYREG_B0_UDB09_CTL 0x40006479u
#define CYREG_B0_UDB10_CTL 0x4000647au
#define CYREG_B0_UDB11_CTL 0x4000647bu
#define CYREG_B0_UDB12_CTL 0x4000647cu
#define CYREG_B0_UDB13_CTL 0x4000647du
#define CYREG_B0_UDB14_CTL 0x4000647eu
#define CYREG_B0_UDB15_CTL 0x4000647fu
#define CYREG_B0_UDB00_MSK 0x40006480u
#define CYREG_B0_UDB01_MSK 0x40006481u
#define CYREG_B0_UDB02_MSK 0x40006482u
#define CYREG_B0_UDB03_MSK 0x40006483u
#define CYREG_B0_UDB04_MSK 0x40006484u
#define CYREG_B0_UDB05_MSK 0x40006485u
#define CYREG_B0_UDB06_MSK 0x40006486u
#define CYREG_B0_UDB07_MSK 0x40006487u
#define CYREG_B0_UDB08_MSK 0x40006488u
#define CYREG_B0_UDB09_MSK 0x40006489u
#define CYREG_B0_UDB10_MSK 0x4000648au
#define CYREG_B0_UDB11_MSK 0x4000648bu
#define CYREG_B0_UDB12_MSK 0x4000648cu
#define CYREG_B0_UDB13_MSK 0x4000648du
#define CYREG_B0_UDB14_MSK 0x4000648eu
#define CYREG_B0_UDB15_MSK 0x4000648fu
#define CYREG_B0_UDB00_ACTL 0x40006490u
#define CYREG_B0_UDB01_ACTL 0x40006491u
#define CYREG_B0_UDB02_ACTL 0x40006492u
#define CYREG_B0_UDB03_ACTL 0x40006493u
#define CYREG_B0_UDB04_ACTL 0x40006494u
#define CYREG_B0_UDB05_ACTL 0x40006495u
#define CYREG_B0_UDB06_ACTL 0x40006496u
#define CYREG_B0_UDB07_ACTL 0x40006497u
#define CYREG_B0_UDB08_ACTL 0x40006498u
#define CYREG_B0_UDB09_ACTL 0x40006499u
#define CYREG_B0_UDB10_ACTL 0x4000649au
#define CYREG_B0_UDB11_ACTL 0x4000649bu
#define CYREG_B0_UDB12_ACTL 0x4000649cu
#define CYREG_B0_UDB13_ACTL 0x4000649du
#define CYREG_B0_UDB14_ACTL 0x4000649eu
#define CYREG_B0_UDB15_ACTL 0x4000649fu
#define CYREG_B0_UDB00_MC 0x400064a0u
#define CYREG_B0_UDB01_MC 0x400064a1u
#define CYREG_B0_UDB02_MC 0x400064a2u
#define CYREG_B0_UDB03_MC 0x400064a3u
#define CYREG_B0_UDB04_MC 0x400064a4u
#define CYREG_B0_UDB05_MC 0x400064a5u
#define CYREG_B0_UDB06_MC 0x400064a6u
#define CYREG_B0_UDB07_MC 0x400064a7u
#define CYREG_B0_UDB08_MC 0x400064a8u
#define CYREG_B0_UDB09_MC 0x400064a9u
#define CYREG_B0_UDB10_MC 0x400064aau
#define CYREG_B0_UDB11_MC 0x400064abu
#define CYREG_B0_UDB12_MC 0x400064acu
#define CYREG_B0_UDB13_MC 0x400064adu
#define CYREG_B0_UDB14_MC 0x400064aeu
#define CYREG_B0_UDB15_MC 0x400064afu
#define CYDEV_UWRK_UWRK8_B1_BASE 0x40006500u
#define CYDEV_UWRK_UWRK8_B1_SIZE 0x000000b0u
#define CYREG_B1_UDB04_A0 0x40006504u
#define CYREG_B1_UDB05_A0 0x40006505u
#define CYREG_B1_UDB06_A0 0x40006506u
#define CYREG_B1_UDB07_A0 0x40006507u
#define CYREG_B1_UDB08_A0 0x40006508u
#define CYREG_B1_UDB09_A0 0x40006509u
