MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYREG_B1_UDB10_A0 0x4000650au
#define CYREG_B1_UDB11_A0 0x4000650bu
#define CYREG_B1_UDB04_A1 0x40006514u
#define CYREG_B1_UDB05_A1 0x40006515u
#define CYREG_B1_UDB06_A1 0x40006516u
#define CYREG_B1_UDB07_A1 0x40006517u
#define CYREG_B1_UDB08_A1 0x40006518u
#define CYREG_B1_UDB09_A1 0x40006519u
#define CYREG_B1_UDB10_A1 0x4000651au
#define CYREG_B1_UDB11_A1 0x4000651bu
#define CYREG_B1_UDB04_D0 0x40006524u
#define CYREG_B1_UDB05_D0 0x40006525u
#define CYREG_B1_UDB06_D0 0x40006526u
#define CYREG_B1_UDB07_D0 0x40006527u
#define CYREG_B1_UDB08_D0 0x40006528u
#define CYREG_B1_UDB09_D0 0x40006529u
#define CYREG_B1_UDB10_D0 0x4000652au
#define CYREG_B1_UDB11_D0 0x4000652bu
#define CYREG_B1_UDB04_D1 0x40006534u
#define CYREG_B1_UDB05_D1 0x40006535u
#define CYREG_B1_UDB06_D1 0x40006536u
#define CYREG_B1_UDB07_D1 0x40006537u
#define CYREG_B1_UDB08_D1 0x40006538u
#define CYREG_B1_UDB09_D1 0x40006539u
#define CYREG_B1_UDB10_D1 0x4000653au
#define CYREG_B1_UDB11_D1 0x4000653bu
#define CYREG_B1_UDB04_F0 0x40006544u
#define CYREG_B1_UDB05_F0 0x40006545u
#define CYREG_B1_UDB06_F0 0x40006546u
#define CYREG_B1_UDB07_F0 0x40006547u
#define CYREG_B1_UDB08_F0 0x40006548u
#define CYREG_B1_UDB09_F0 0x40006549u
#define CYREG_B1_UDB10_F0 0x4000654au
#define CYREG_B1_UDB11_F0 0x4000654bu
#define CYREG_B1_UDB04_F1 0x40006554u
#define CYREG_B1_UDB05_F1 0x40006555u
#define CYREG_B1_UDB06_F1 0x40006556u
#define CYREG_B1_UDB07_F1 0x40006557u
#define CYREG_B1_UDB08_F1 0x40006558u
#define CYREG_B1_UDB09_F1 0x40006559u
#define CYREG_B1_UDB10_F1 0x4000655au
#define CYREG_B1_UDB11_F1 0x4000655bu
#define CYREG_B1_UDB04_ST 0x40006564u
#define CYREG_B1_UDB05_ST 0x40006565u
#define CYREG_B1_UDB06_ST 0x40006566u
#define CYREG_B1_UDB07_ST 0x40006567u
#define CYREG_B1_UDB08_ST 0x40006568u
#define CYREG_B1_UDB09_ST 0x40006569u
#define CYREG_B1_UDB10_ST 0x4000656au
#define CYREG_B1_UDB11_ST 0x4000656bu
#define CYREG_B1_UDB04_CTL 0x40006574u
#define CYREG_B1_UDB05_CTL 0x40006575u
#define CYREG_B1_UDB06_CTL 0x40006576u
#define CYREG_B1_UDB07_CTL 0x40006577u
#define CYREG_B1_UDB08_CTL 0x40006578u
#define CYREG_B1_UDB09_CTL 0x40006579u
#define CYREG_B1_UDB10_CTL 0x4000657au
#define CYREG_B1_UDB11_CTL 0x4000657bu
#define CYREG_B1_UDB04_MSK 0x40006584u
#define CYREG_B1_UDB05_MSK 0x40006585u
#define CYREG_B1_UDB06_MSK 0x40006586u
#define CYREG_B1_UDB07_MSK 0x40006587u
#define CYREG_B1_UDB08_MSK 0x40006588u
#define CYREG_B1_UDB09_MSK 0x40006589u
#define CYREG_B1_UDB10_MSK 0x4000658au
#define CYREG_B1_UDB11_MSK 0x4000658bu
#define CYREG_B1_UDB04_ACTL 0x40006594u
#define CYREG_B1_UDB05_ACTL 0x40006595u
#define CYREG_B1_UDB06_ACTL 0x40006596u
#define CYREG_B1_UDB07_ACTL 0x40006597u
#define CYREG_B1_UDB08_ACTL 0x40006598u
#define CYREG_B1_UDB09_ACTL 0x40006599u
#define CYREG_B1_UDB10_ACTL 0x4000659au
#define CYREG_B1_UDB11_ACTL 0x4000659bu
#define CYREG_B1_UDB04_MC 0x400065a4u
#define CYREG_B1_UDB05_MC 0x400065a5u
#define CYREG_B1_UDB06_MC 0x400065a6u
#define CYREG_B1_UDB07_MC 0x400065a7u
#define CYREG_B1_UDB08_MC 0x400065a8u
#define CYREG_B1_UDB09_MC 0x400065a9u
#define CYREG_B1_UDB10_MC 0x400065aau
#define CYREG_B1_UDB11_MC 0x400065abu
#define CYDEV_UWRK_UWRK16_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_SIZE 0x00000760u
#define CYDEV_UWRK_UWRK16_CAT_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_CAT_SIZE 0x00000760u
#define CYDEV_UWRK_UWRK16_CAT_B0_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_CAT_B0_SIZE 0x00000160u
#define CYREG_B0_UDB00_A0_A1 0x40006800u
#define CYREG_B0_UDB01_A0_A1 0x40006802u
#define CYREG_B0_UDB02_A0_A1 0x40006804u
#define CYREG_B0_UDB03_A0_A1 0x40006806u
#define CYREG_B0_UDB04_A0_A1 0x40006808u
#define CYREG_B0_UDB05_A0_A1 0x4000680au
#define CYREG_B0_UDB06_A0_A1 0x4000680cu
#define CYREG_B0_UDB07_A0_A1 0x4000680eu
#define CYREG_B0_UDB08_A0_A1 0x40006810u
#define CYREG_B0_UDB09_A0_A1 0x40006812u
#define CYREG_B0_UDB10_A0_A1 0x40006814u
#define CYREG_B0_UDB11_A0_A1 0x40006816u
#define CYREG_B0_UDB12_A0_A1 0x40006818u
#define CYREG_B0_UDB13_A0_A1 0x4000681au
#define CYREG_B0_UDB14_A0_A1 0x4000681cu
#define CYREG_B0_UDB15_A0_A1 0x4000681eu
#define CYREG_B0_UDB00_D0_D1 0x40006840u
#define CYREG_B0_UDB01_D0_D1 0x40006842u
#define CYREG_B0_UDB02_D0_D1 0x40006844u
#define CYREG_B0_UDB03_D0_D1 0x40006846u
#define CYREG_B0_UDB04_D0_D1 0x40006848u
#define CYREG_B0_UDB05_D0_D1 0x4000684au
#define CYREG_B0_UDB06_D0_D1 0x4000684cu
#define CYREG_B0_UDB07_D0_D1 0x4000684eu
#define CYREG_B0_UDB08_D0_D1 0x40006850u
#define CYREG_B0_UDB09_D0_D1 0x40006852u
#define CYREG_B0_UDB10_D0_D1 0x40006854u
#define CYREG_B0_UDB11_D0_D1 0x40006856u
#define CYREG_B0_UDB12_D0_D1 0x40006858u
#define CYREG_B0_UDB13_D0_D1 0x4000685au
#define CYREG_B0_UDB14_D0_D1 0x4000685cu
#define CYREG_B0_UDB15_D0_D1 0x4000685eu
#define CYREG_B0_UDB00_F0_F1 0x40006880u
#define CYREG_B0_UDB01_F0_F1 0x40006882u
#define CYREG_B0_UDB02_F0_F1 0x40006884u
#define CYREG_B0_UDB03_F0_F1 0x40006886u
#define CYREG_B0_UDB04_F0_F1 0x40006888u
#define CYREG_B0_UDB05_F0_F1 0x4000688au
#define CYREG_B0_UDB06_F0_F1 0x4000688cu
#define CYREG_B0_UDB07_F0_F1 0x4000688eu
#define CYREG_B0_UDB08_F0_F1 0x40006890u
#define CYREG_B0_UDB09_F0_F1 0x40006892u
#define CYREG_B0_UDB10_F0_F1 0x40006894u
#define CYREG_B0_UDB11_F0_F1 0x40006896u
#define CYREG_B0_UDB12_F0_F1 0x40006898u
#define CYREG_B0_UDB13_F0_F1 0x4000689au
#define CYREG_B0_UDB14_F0_F1 0x4000689cu
#define CYREG_B0_UDB15_F0_F1 0x4000689eu
#define CYREG_B0_UDB00_ST_CTL 0x400068c0u
#define CYREG_B0_UDB01_ST_CTL 0x400068c2u
#define CYREG_B0_UDB02_ST_CTL 0x400068c4u
#define CYREG_B0_UDB03_ST_CTL 0x400068c6u
#define CYREG_B0_UDB04_ST_CTL 0x400068c8u
#define CYREG_B0_UDB05_ST_CTL 0x400068cau
#define CYREG_B0_UDB06_ST_CTL 0x400068ccu
#define CYREG_B0_UDB07_ST_CTL 0x400068ceu
#define CYREG_B0_UDB08_ST_CTL 0x400068d0u
#define CYREG_B0_UDB09_ST_CTL 0x400068d2u
#define CYREG_B0_UDB10_ST_CTL 0x400068d4u
#define CYREG_B0_UDB11_ST_CTL 0x400068d6u
#define CYREG_B0_UDB12_ST_CTL 0x400068d8u
#define CYREG_B0_UDB13_ST_CTL 0x400068dau
#define CYREG_B0_UDB14_ST_CTL 0x400068dcu
#define CYREG_B0_UDB15_ST_CTL 0x400068deu
#define CYREG_B0_UDB00_MSK_ACTL 0x40006900u
#define CYREG_B0_UDB01_MSK_ACTL 0x40006902u
#define CYREG_B0_UDB02_MSK_ACTL 0x40006904u
#define CYREG_B0_UDB03_MSK_ACTL 0x40006906u
#define CYREG_B0_UDB04_MSK_ACTL 0x40006908u
#define CYREG_B0_UDB05_MSK_ACTL 0x4000690au
#define CYREG_B0_UDB06_MSK_ACTL 0x4000690cu
#define CYREG_B0_UDB07_MSK_ACTL 0x4000690eu
#define CYREG_B0_UDB08_MSK_ACTL 0x40006910u
#define CYREG_B0_UDB09_MSK_ACTL 0x40006912u
#define CYREG_B0_UDB10_MSK_ACTL 0x40006914u
#define CYREG_B0_UDB11_MSK_ACTL 0x40006916u
#define CYREG_B0_UDB12_MSK_ACTL 0x40006918u
#define CYREG_B0_UDB13_MSK_ACTL 0x4000691au
#define CYREG_B0_UDB14_MSK_ACTL 0x4000691cu
#define CYREG_B0_UDB15_MSK_ACTL 0x4000691eu
#define CYREG_B0_UDB00_MC_00 0x40006940u
#define CYREG_B0_UDB01_MC_00 0x40006942u
#define CYREG_B0_UDB02_MC_00 0x40006944u
#define CYREG_B0_UDB03_MC_00 0x40006946u
#define CYREG_B0_UDB04_MC_00 0x40006948u
#define CYREG_B0_UDB05_MC_00 0x4000694au
#define CYREG_B0_UDB06_MC_00 0x4000694cu
#define CYREG_B0_UDB07_MC_00 0x4000694eu
#define CYREG_B0_UDB08_MC_00 0x40006950u
#define CYREG_B0_UDB09_MC_00 0x40006952u
#define CYREG_B0_UDB10_MC_00 0x40006954u
#define CYREG_B0_UDB11_MC_00 0x40006956u
#define CYREG_B0_UDB12_MC_00 0x40006958u
#define CYREG_B0_UDB13_MC_00 0x4000695au
#define CYREG_B0_UDB14_MC_00 0x4000695cu
#define CYREG_B0_UDB15_MC_00 0x4000695eu
#define CYDEV_UWRK_UWRK16_CAT_B1_BASE 0x40006a00u
#define CYDEV_UWRK_UWRK16_CAT_B1_SIZE 0x00000160u
#define CYREG_B1_UDB04_A0_A1 0x40006a08u
#define CYREG_B1_UDB05_A0_A1 0x40006a0au
#define CYREG_B1_UDB06_A0_A1 0x40006a0cu
#define CYREG_B1_UDB07_A0_A1 0x40006a0eu
#define CYREG_B1_UDB08_A0_A1 0x40006a10u
#define CYREG_B1_UDB09_A0_A1 0x40006a12u
#define CYREG_B1_UDB10_A0_A1 0x40006a14u
#define CYREG_B1_UDB11_A0_A1 0x40006a16u
#define CYREG_B1_UDB04_D0_D1 0x40006a48u
#define CYREG_B1_UDB05_D0_D1 0x40006a4au
#define CYREG_B1_UDB06_D0_D1 0x40006a4cu
#define CYREG_B1_UDB07_D0_D1 0x40006a4eu
#define CYREG_B1_UDB08_D0_D1 0x40006a50u
#define CYREG_B1_UDB09_D0_D1 0x40006a52u
#define CYREG_B1_UDB10_D0_D1 0x40006a54u
#define CYREG_B1_UDB11_D0_D1 0x40006a56u
#define CYREG_B1_UDB04_F0_F1 0x40006a88u
#define CYREG_B1_UDB05_F0_F1 0x40006a8au
#define CYREG_B1_UDB06_F0_F1 0x40006a8cu
#define CYREG_B1_UDB07_F0_F1 0x40006a8eu
#define CYREG_B1_UDB08_F0_F1 0x40006a90u
#define CYREG_B1_UDB09_F0_F1 0x40006a92u
#define CYREG_B1_UDB10_F0_F1 0x40006a94u
#define CYREG_B1_UDB11_F0_F1 0x40006a96u
#define CYREG_B1_UDB04_ST_CTL 0x40006ac8u
#define CYREG_B1_UDB05_ST_CTL 0x40006acau
#define CYREG_B1_UDB06_ST_CTL 0x40006accu
#define CYREG_B1_UDB07_ST_CTL 0x40006aceu
#define CYREG_B1_UDB08_ST_CTL 0x40006ad0u
#define CYREG_B1_UDB09_ST_CTL 0x40006ad2u
#define CYREG_B1_UDB10_ST_CTL 0x40006ad4u
#define CYREG_B1_UDB11_ST_CTL 0x40006ad6u
#define CYREG_B1_UDB04_MSK_ACTL 0x40006b08u
#define CYREG_B1_UDB05_MSK_ACTL 0x40006b0au
#define CYREG_B1_UDB06_MSK_ACTL 0x40006b0cu
#define CYREG_B1_UDB07_MSK_ACTL 0x40006b0eu
#define CYREG_B1_UDB08_MSK_ACTL 0x40006b10u
#define CYREG_B1_UDB09_MSK_ACTL 0x40006b12u
#define CYREG_B1_UDB10_MSK_ACTL 0x40006b14u
#define CYREG_B1_UDB11_MSK_ACTL 0x40006b16u
#define CYREG_B1_UDB04_MC_00 0x40006b48u
#define CYREG_B1_UDB05_MC_00 0x40006b4au
#define CYREG_B1_UDB06_MC_00 0x40006b4cu
#define CYREG_B1_UDB07_MC_00 0x40006b4eu
#define CYREG_B1_UDB08_MC_00 0x40006b50u
#define CYREG_B1_UDB09_MC_00 0x40006b52u
#define CYREG_B1_UDB10_MC_00 0x40006b54u
#define CYREG_B1_UDB11_MC_00 0x40006b56u
#define CYDEV_UWRK_UWRK16_DEF_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_DEF_SIZE 0x0000075eu
#define CYDEV_UWRK_UWRK16_DEF_B0_BASE 0x40006800u
#define CYDEV_UWRK_UWRK16_DEF_B0_SIZE 0x0000015eu
#define CYREG_B0_UDB00_01_A0 0x40006800u
#define CYREG_B0_UDB01_02_A0 0x40006802u
#define CYREG_B0_UDB02_03_A0 0x40006804u
#define CYREG_B0_UDB03_04_A0 0x40006806u
#define CYREG_B0_UDB04_05_A0 0x40006808u
#define CYREG_B0_UDB05_06_A0 0x4000680au
#define CYREG_B0_UDB06_07_A0 0x4000680cu
#define CYREG_B0_UDB07_08_A0 0x4000680eu
#define CYREG_B0_UDB08_09_A0 0x40006810u
#define CYREG_B0_UDB09_10_A0 0x40006812u
#define CYREG_B0_UDB10_11_A0 0x40006814u
#define CYREG_B0_UDB11_12_A0 0x40006816u
#define CYREG_B0_UDB12_13_A0 0x40006818u
#define CYREG_B0_UDB13_14_A0 0x4000681au
#define CYREG_B0_UDB14_15_A0 0x4000681cu
#define CYREG_B0_UDB00_01_A1 0x40006820u
#define CYREG_B0_UDB01_02_A1 0x40006822u
#define CYREG_B0_UDB02_03_A1 0x40006824u
#define CYREG_B0_UDB03_04_A1 0x40006826u
#define CYREG_B0_UDB04_05_A1 0x40006828u
#define CYREG_B0_UDB05_06_A1 0x4000682au
#define CYREG_B0_UDB06_07_A1 0x4000682cu
#define CYREG_B0_UDB07_08_A1 0x4000682eu
#define CYREG_B0_UDB08_09_A1 0x40006830u
#define CYREG_B0_UDB09_10_A1 0x40006832u
#define CYREG_B0_UDB10_11_A1 0x40006834u
#define CYREG_B0_UDB11_12_A1 0x40006836u
#define CYREG_B0_UDB12_13_A1 0x40006838u
#define CYREG_B0_UDB13_14_A1 0x4000683au
#define CYREG_B0_UDB14_15_A1 0x4000683cu
#define CYREG_B0_UDB00_01_D0 0x40006840u
#define CYREG_B0_UDB01_02_D0 0x40006842u
#define CYREG_B0_UDB02_03_D0 0x40006844u
#define CYREG_B0_UDB03_04_D0 0x40006846u
#define CYREG_B0_UDB04_05_D0 0x40006848u
#define CYREG_B0_UDB05_06_D0 0x4000684au
#define CYREG_B0_UDB06_07_D0 0x4000684cu
#define CYREG_B0_UDB07_08_D0 0x4000684eu
#define CYREG_B0_UDB08_09_D0 0x40006850u
#define CYREG_B0_UDB09_10_D0 0x40006852u
#define CYREG_B0_UDB10_11_D0 0x40006854u
#define CYREG_B0_UDB11_12_D0 0x40006856u
#define CYREG_B0_UDB12_13_D0 0x40006858u
#define CYREG_B0_UDB13_14_D0 0x4000685au
#define CYREG_B0_UDB14_15_D0 0x4000685cu
#define CYREG_B0_UDB00_01_D1 0x40006860u
#define CYREG_B0_UDB01_02_D1 0x40006862u
#define CYREG_B0_UDB02_03_D1 0x40006864u
#define CYREG_B0_UDB03_04_D1 0x40006866u
#define CYREG_B0_UDB04_05_D1 0x40006868u
#define CYREG_B0_UDB05_06_D1 0x4000686au
#define CYREG_B0_UDB06_07_D1 0x4000686cu
#define CYREG_B0_UDB07_08_D1 0x4000686eu
#define CYREG_B0_UDB08_09_D1 0x40006870u
#define CYREG_B0_UDB09_10_D1 0x40006872u
#define CYREG_B0_UDB10_11_D1 0x40006874u
#define CYREG_B0_UDB11_12_D1 0x40006876u
#define CYREG_B0_UDB12_13_D1 0x40006878u
#define CYREG_B0_UDB13_14_D1 0x4000687au
#define CYREG_B0_UDB14_15_D1 0x4000687cu
#define CYREG_B0_UDB00_01_F0 0x40006880u
#define CYREG_B0_UDB01_02_F0 0x40006882u
#define CYREG_B0_UDB02_03_F0 0x40006884u
#define CYREG_B0_UDB03_04_F0 0x40006886u
#define CYREG_B0_UDB04_05_F0 0x40006888u
#define CYREG_B0_UDB05_06_F0 0x4000688au
#define CYREG_B0_UDB06_07_F0 0x4000688cu
#define CYREG_B0_UDB07_08_F0 0x4000688eu
#define CYREG_B0_UDB08_09_F0 0x40006890u
#define CYREG_B0_UDB09_10_F0 0x40006892u
#define CYREG_B0_UDB10_11_F0 0x40006894u
#define CYREG_B0_UDB11_12_F0 0x40006896u
#define CYREG_B0_UDB12_13_F0 0x40006898u
#define CYREG_B0_UDB13_14_F0 0x4000689au
#define CYREG_B0_UDB14_15_F0 0x4000689cu
#define CYREG_B0_UDB00_01_F1 0x400068a0u
#define CYREG_B0_UDB01_02_F1 0x400068a2u
#define CYREG_B0_UDB02_03_F1 0x400068a4u
#define CYREG_B0_UDB03_04_F1 0x400068a6u
#define CYREG_B0_UDB04_05_F1 0x400068a8u
#define CYREG_B0_UDB05_06_F1 0x400068aau
#define CYREG_B0_UDB06_07_F1 0x400068acu
#define CYREG_B0_UDB07_08_F1 0x400068aeu
#define CYREG_B0_UDB08_09_F1 0x400068b0u
#define CYREG_B0_UDB09_10_F1 0x400068b2u
#define CYREG_B0_UDB10_11_F1 0x400068b4u
#define CYREG_B0_UDB11_12_F1 0x400068b6u
#define CYREG_B0_UDB12_13_F1 0x400068b8u
#define CYREG_B0_UDB13_14_F1 0x400068bau
#define CYREG_B0_UDB14_15_F1 0x400068bcu
#define CYREG_B0_UDB00_01_ST 0x400068c0u
#define CYREG_B0_UDB01_02_ST 0x400068c2u
#define CYREG_B0_UDB02_03_ST 0x400068c4u
#define CYREG_B0_UDB03_04_ST 0x400068c6u
#define CYREG_B0_UDB04_05_ST 0x400068c8u
#define CYREG_B0_UDB05_06_ST 0x400068cau
#define CYREG_B0_UDB06_07_ST 0x400068ccu
#define CYREG_B0_UDB07_08_ST 0x400068ceu
#define CYREG_B0_UDB08_09_ST 0x400068d0u
#define CYREG_B0_UDB09_10_ST 0x400068d2u
#define CYREG_B0_UDB10_11_ST 0x400068d4u
#define CYREG_B0_UDB11_12_ST 0x400068d6u
#define CYREG_B0_UDB12_13_ST 0x400068d8u
#define CYREG_B0_UDB13_14_ST 0x400068dau
#define CYREG_B0_UDB14_15_ST 0x400068dcu
#define CYREG_B0_UDB00_01_CTL 0x400068e0u
#define CYREG_B0_UDB01_02_CTL 0x400068e2u
#define CYREG_B0_UDB02_03_CTL 0x400068e4u
#define CYREG_B0_UDB03_04_CTL 0x400068e6u
#define CYREG_B0_UDB04_05_CTL 0x400068e8u
#define CYREG_B0_UDB05_06_CTL 0x400068eau
#define CYREG_B0_UDB06_07_CTL 0x400068ecu
#define CYREG_B0_UDB07_08_CTL 0x400068eeu
#define CYREG_B0_UDB08_09_CTL 0x400068f0u
#define CYREG_B0_UDB09_10_CTL 0x400068f2u
#define CYREG_B0_UDB10_11_CTL 0x400068f4u
#define CYREG_B0_UDB11_12_CTL 0x400068f6u
#define CYREG_B0_UDB12_13_CTL 0x400068f8u
#define CYREG_B0_UDB13_14_CTL 0x400068fau
#define CYREG_B0_UDB14_15_CTL 0x400068fcu
#define CYREG_B0_UDB00_01_MSK 0x40006900u
#define CYREG_B0_UDB01_02_MSK 0x40006902u
#define CYREG_B0_UDB02_03_MSK 0x40006904u
#define CYREG_B0_UDB03_04_MSK 0x40006906u
#define CYREG_B0_UDB04_05_MSK 0x40006908u
#define CYREG_B0_UDB05_06_MSK 0x4000690au
#define CYREG_B0_UDB06_07_MSK 0x4000690cu
#define CYREG_B0_UDB07_08_MSK 0x4000690eu
#define CYREG_B0_UDB08_09_MSK 0x40006910u
#define CYREG_B0_UDB09_10_MSK 0x40006912u
#define CYREG_B0_UDB10_11_MSK 0x40006914u
#define CYREG_B0_UDB11_12_MSK 0x40006916u
#define CYREG_B0_UDB12_13_MSK 0x40006918u
#define CYREG_B0_UDB13_14_MSK 0x4000691au
#define CYREG_B0_UDB14_15_MSK 0x4000691cu
#define CYREG_B0_UDB00_01_ACTL 0x40006920u
#define CYREG_B0_UDB01_02_ACTL 0x40006922u
#define CYREG_B0_UDB02_03_ACTL 0x40006924u
#define CYREG_B0_UDB03_04_ACTL 0x40006926u
#define CYREG_B0_UDB04_05_ACTL 0x40006928u
#define CYREG_B0_UDB05_06_ACTL 0x4000692au
#define CYREG_B0_UDB06_07_ACTL 0x4000692cu
#define CYREG_B0_UDB07_08_ACTL 0x4000692eu
#define CYREG_B0_UDB08_09_ACTL 0x40006930u
#define CYREG_B0_UDB09_10_ACTL 0x40006932u
#define CYREG_B0_UDB10_11_ACTL 0x40006934u
#define CYREG_B0_UDB11_12_ACTL 0x40006936u
#define CYREG_B0_UDB12_13_ACTL 0x40006938u
#define CYREG_B0_UDB13_14_ACTL 0x4000693au
#define CYREG_B0_UDB14_15_ACTL 0x4000693cu
#define CYREG_B0_UDB00_01_MC 0x40006940u
#define CYREG_B0_UDB01_02_MC 0x40006942u
#define CYREG_B0_UDB02_03_MC 0x40006944u
#define CYREG_B0_UDB03_04_MC 0x40006946u
#define CYREG_B0_UDB04_05_MC 0x40006948u
#define CYREG_B0_UDB05_06_MC 0x4000694au
#define CYREG_B0_UDB06_07_MC 0x4000694cu
#define CYREG_B0_UDB07_08_MC 0x4000694eu
#define CYREG_B0_UDB08_09_MC 0x40006950u
#define CYREG_B0_UDB09_10_MC 0x40006952u
#define CYREG_B0_UDB10_11_MC 0x40006954u
#define CYREG_B0_UDB11_12_MC 0x40006956u
#define CYREG_B0_UDB12_13_MC 0x40006958u
#define CYREG_B0_UDB13_14_MC 0x4000695au
#define CYREG_B0_UDB14_15_MC 0x4000695cu
#define CYDEV_UWRK_UWRK16_DEF_B1_BASE 0x40006a00u
#define CYDEV_UWRK_UWRK16_DEF_B1_SIZE 0x0000015eu
#define CYREG_B1_UDB04_05_A0 0x40006a08u
#define CYREG_B1_UDB05_06_A0 0x40006a0au
#define CYREG_B1_UDB06_07_A0 0x40006a0cu
#define CYREG_B1_UDB07_08_A0 0x40006a0eu
#define CYREG_B1_UDB08_09_A0 0x40006a10u
#define CYREG_B1_UDB09_10_A0 0x40006a12u
#define CYREG_B1_UDB10_11_A0 0x40006a14u
#define CYREG_B1_UDB11_12_A0 0x40006a16u
#define CYREG_B1_UDB04_05_A1 0x40006a28u
#define CYREG_B1_UDB05_06_A1 0x40006a2au
#define CYREG_B1_UDB06_07_A1 0x40006a2cu
#define CYREG_B1_UDB07_08_A1 0x40006a2eu
#define CYREG_B1_UDB08_09_A1 0x40006a30u
#define CYREG_B1_UDB09_10_A1 0x40006a32u
#define CYREG_B1_UDB10_11_A1 0x40006a34u
#define CYREG_B1_UDB11_12_A1 0x40006a36u
#define CYREG_B1_UDB04_05_D0 0x40006a48u
#define CYREG_B1_UDB05_06_D0 0x40006a4au
#define CYREG_B1_UDB06_07_D0 0x40006a4cu
#define CYREG_B1_UDB07_08_D0 0x40006a4eu
#define CYREG_B1_UDB08_09_D0 0x40006a50u
#define CYREG_B1_UDB09_10_D0 0x40006a52u
#define CYREG_B1_UDB10_11_D0 0x40006a54u
#define CYREG_B1_UDB11_12_D0 0x40006a56u
#define CYREG_B1_UDB04_05_D1 0x40006a68u
#define CYREG_B1_UDB05_06_D1 0x40006a6au
#define CYREG_B1_UDB06_07_D1 0x40006a6cu
#define CYREG_B1_UDB07_08_D1 0x40006a6eu
#define CYREG_B1_UDB08_09_D1 0x40006a70u
#define CYREG_B1_UDB09_10_D1 0x40006a72u
#define CYREG_B1_UDB10_11_D1 0x40006a74u
#define CYREG_B1_UDB11_12_D1 0x40006a76u
#define CYREG_B1_UDB04_05_F0 0x40006a88u
#define CYREG_B1_UDB05_06_F0 0x40006a8au
#define CYREG_B1_UDB06_07_F0 0x40006a8cu
#define CYREG_B1_UDB07_08_F0 0x40006a8eu
#define CYREG_B1_UDB08_09_F0 0x40006a90u
#define CYREG_B1_UDB09_10_F0 0x40006a92u
#define CYREG_B1_UDB10_11_F0 0x40006a94u
#define CYREG_B1_UDB11_12_F0 0x40006a96u
#define CYREG_B1_UDB04_05_F1 0x40006aa8u
#define CYREG_B1_UDB05_06_F1 0x40006aaau
#define CYREG_B1_UDB06_07_F1 0x40006aacu
#define CYREG_B1_UDB07_08_F1 0x40006aaeu
#define CYREG_B1_UDB08_09_F1 0x40006ab0u
#define CYREG_B1_UDB09_10_F1 0x40006ab2u
#define CYREG_B1_UDB10_11_F1 0x40006ab4u
#define CYREG_B1_UDB11_12_F1 0x40006ab6u
#define CYREG_B1_UDB04_05_ST 0x40006ac8u
#define CYREG_B1_UDB05_06_ST 0x40006acau
#define CYREG_B1_UDB06_07_ST 0x40006accu
#define CYREG_B1_UDB07_08_ST 0x40006aceu
#define CYREG_B1_UDB08_09_ST 0x40006ad0u
#define CYREG_B1_UDB09_10_ST 0x40006ad2u
#define CYREG_B1_UDB10_11_ST 0x40006ad4u
#define CYREG_B1_UDB11_12_ST 0x40006ad6u
#define CYREG_B1_UDB04_05_CTL 0x40006ae8u
#define CYREG_B1_UDB05_06_CTL 0x40006aeau
#define CYREG_B1_UDB06_07_CTL 0x40006aecu
#define CYREG_B1_UDB07_08_CTL 0x40006aeeu
#define CYREG_B1_UDB08_09_CTL 0x40006af0u
#define CYREG_B1_UDB09_10_CTL 0x40006af2u
#define CYREG_B1_UDB10_11_CTL 0x40006af4u
#define CYREG_B1_UDB11_12_CTL 0x40006af6u
#define CYREG_B1_UDB04_05_MSK 0x40006b08u
#define CYREG_B1_UDB05_06_MSK 0x40006b0au
#define CYREG_B1_UDB06_07_MSK 0x40006b0cu
#define CYREG_B1_UDB07_08_MSK 0x40006b0eu
#define CYREG_B1_UDB08_09_MSK 0x40006b10u
#define CYREG_B1_UDB09_10_MSK 0x40006b12u
#define CYREG_B1_UDB10_11_MSK 0x40006b14u
#define CYREG_B1_UDB11_12_MSK 0x40006b16u
#define CYREG_B1_UDB04_05_ACTL 0x40006b28u
#define CYREG_B1_UDB05_06_ACTL 0x40006b2au
#define CYREG_B1_UDB06_07_ACTL 0x40006b2cu
#define CYREG_B1_UDB07_08_ACTL 0x40006b2eu
#define CYREG_B1_UDB08_09_ACTL 0x40006b30u
#define CYREG_B1_UDB09_10_ACTL 0x40006b32u
#define CYREG_B1_UDB10_11_ACTL 0x40006b34u
#define CYREG_B1_UDB11_12_ACTL 0x40006b36u
#define CYREG_B1_UDB04_05_MC 0x40006b48u
#define CYREG_B1_UDB05_06_MC 0x40006b4au
#define CYREG_B1_UDB06_07_MC 0x40006b4cu
#define CYREG_B1_UDB07_08_MC 0x40006b4eu
#define CYREG_B1_UDB08_09_MC 0x40006b50u
#define CYREG_B1_UDB09_10_MC 0x40006b52u
#define CYREG_B1_UDB10_11_MC 0x40006b54u
#define CYREG_B1_UDB11_12_MC 0x40006b56u
#define CYDEV_PHUB_BASE 0x40007000u
#define CYDEV_PHUB_SIZE 0x00000c00u
#define CYREG_PHUB_CFG 0x40007000u
#define CYREG_PHUB_ERR 0x40007004u
#define CYREG_PHUB_ERR_ADR 0x40007008u
#define CYDEV_PHUB_CH0_BASE 0x40007010u
#define CYDEV_PHUB_CH0_SIZE 0x0000000cu
#define CYREG_PHUB_CH0_BASIC_CFG 0x40007010u
#define CYREG_PHUB_CH0_ACTION 0x40007014u
#define CYREG_PHUB_CH0_BASIC_STATUS 0x40007018u
#define CYDEV_PHUB_CH1_BASE 0x40007020u
#define CYDEV_PHUB_CH1_SIZE 0x0000000cu
#define CYREG_PHUB_CH1_BASIC_CFG 0x40007020u
#define CYREG_PHUB_CH1_ACTION 0x40007024u
#define CYREG_PHUB_CH1_BASIC_STATUS 0x40007028u
#define CYDEV_PHUB_CH2_BASE 0x40007030u
#define CYDEV_PHUB_CH2_SIZE 0x0000000cu
#define CYREG_PHUB_CH2_BASIC_CFG 0x40007030u
#define CYREG_PHUB_CH2_ACTION 0x40007034u
#define CYREG_PHUB_CH2_BASIC_STATUS 0x40007038u
#define CYDEV_PHUB_CH3_BASE 0x40007040u
#define CYDEV_PHUB_CH3_SIZE 0x0000000cu
#define CYREG_PHUB_CH3_BASIC_CFG 0x40007040u
#define CYREG_PHUB_CH3_ACTION 0x40007044u
#define CYREG_PHUB_CH3_BASIC_STATUS 0x40007048u
#define CYDEV_PHUB_CH4_BASE 0x40007050u
#define CYDEV_PHUB_CH4_SIZE 0x0000000cu
#define CYREG_PHUB_CH4_BASIC_CFG 0x40007050u
#define CYREG_PHUB_CH4_ACTION 0x40007054u
#define CYREG_PHUB_CH4_BASIC_STATUS 0x40007058u
#define CYDEV_PHUB_CH5_BASE 0x40007060u
#define CYDEV_PHUB_CH5_SIZE 0x0000000cu
#define CYREG_PHUB_CH5_BASIC_CFG 0x40007060u
#define CYREG_PHUB_CH5_ACTION 0x40007064u
#define CYREG_PHUB_CH5_BASIC_STATUS 0x40007068u
#define CYDEV_PHUB_CH6_BASE 0x40007070u
#define CYDEV_PHUB_CH6_SIZE 0x0000000cu
#define CYREG_PHUB_CH6_BASIC_CFG 0x40007070u
#define CYREG_PHUB_CH6_ACTION 0x40007074u
#define CYREG_PHUB_CH6_BASIC_STATUS 0x40007078u
#define CYDEV_PHUB_CH7_BASE 0x40007080u
#define CYDEV_PHUB_CH7_SIZE 0x0000000cu
#define CYREG_PHUB_CH7_BASIC_CFG 0x40007080u
#define CYREG_PHUB_CH7_ACTION 0x40007084u
#define CYREG_PHUB_CH7_BASIC_STATUS 0x40007088u
#define CYDEV_PHUB_CH8_BASE 0x40007090u
#define CYDEV_PHUB_CH8_SIZE 0x0000000cu
#define CYREG_PHUB_CH8_BASIC_CFG 0x40007090u
#define CYREG_PHUB_CH8_ACTION 0x40007094u
#define CYREG_PHUB_CH8_BASIC_STATUS 0x40007098u
#define CYDEV_PHUB_CH9_BASE 0x400070a0u
#define CYDEV_PHUB_CH9_SIZE 0x0000000cu
#define CYREG_PHUB_CH9_BASIC_CFG 0x400070a0u
#define CYREG_PHUB_CH9_ACTION 0x400070a4u
#define CYREG_PHUB_CH9_BASIC_STATUS 0x400070a8u
#define CYDEV_PHUB_CH10_BASE 0x400070b0u
#define CYDEV_PHUB_CH10_SIZE 0x0000000cu
#define CYREG_PHUB_CH10_BASIC_CFG 0x400070b0u
#define CYREG_PHUB_CH10_ACTION 0x400070b4u
#define CYREG_PHUB_CH10_BASIC_STATUS 0x400070b8u
#define CYDEV_PHUB_CH11_BASE 0x400070c0u
#define CYDEV_PHUB_CH11_SIZE 0x0000000cu
#define CYREG_PHUB_CH11_BASIC_CFG 0x400070c0u
#define CYREG_PHUB_CH11_ACTION 0x400070c4u
#define CYREG_PHUB_CH11_BASIC_STATUS 0x400070c8u
#define CYDEV_PHUB_CH12_BASE 0x400070d0u
#define CYDEV_PHUB_CH12_SIZE 0x0000000cu
#define CYREG_PHUB_CH12_BASIC_CFG 0x400070d0u
#define CYREG_PHUB_CH12_ACTION 0x400070d4u
#define CYREG_PHUB_CH12_BASIC_STATUS 0x400070d8u
#define CYDEV_PHUB_CH13_BASE 0x400070e0u
#define CYDEV_PHUB_CH13_SIZE 0x0000000cu
#define CYREG_PHUB_CH13_BASIC_CFG 0x400070e0u
