MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYREG_PHUB_CH13_ACTION 0x400070e4u
#define CYREG_PHUB_CH13_BASIC_STATUS 0x400070e8u
#define CYDEV_PHUB_CH14_BASE 0x400070f0u
#define CYDEV_PHUB_CH14_SIZE 0x0000000cu
#define CYREG_PHUB_CH14_BASIC_CFG 0x400070f0u
#define CYREG_PHUB_CH14_ACTION 0x400070f4u
#define CYREG_PHUB_CH14_BASIC_STATUS 0x400070f8u
#define CYDEV_PHUB_CH15_BASE 0x40007100u
#define CYDEV_PHUB_CH15_SIZE 0x0000000cu
#define CYREG_PHUB_CH15_BASIC_CFG 0x40007100u
#define CYREG_PHUB_CH15_ACTION 0x40007104u
#define CYREG_PHUB_CH15_BASIC_STATUS 0x40007108u
#define CYDEV_PHUB_CH16_BASE 0x40007110u
#define CYDEV_PHUB_CH16_SIZE 0x0000000cu
#define CYREG_PHUB_CH16_BASIC_CFG 0x40007110u
#define CYREG_PHUB_CH16_ACTION 0x40007114u
#define CYREG_PHUB_CH16_BASIC_STATUS 0x40007118u
#define CYDEV_PHUB_CH17_BASE 0x40007120u
#define CYDEV_PHUB_CH17_SIZE 0x0000000cu
#define CYREG_PHUB_CH17_BASIC_CFG 0x40007120u
#define CYREG_PHUB_CH17_ACTION 0x40007124u
#define CYREG_PHUB_CH17_BASIC_STATUS 0x40007128u
#define CYDEV_PHUB_CH18_BASE 0x40007130u
#define CYDEV_PHUB_CH18_SIZE 0x0000000cu
#define CYREG_PHUB_CH18_BASIC_CFG 0x40007130u
#define CYREG_PHUB_CH18_ACTION 0x40007134u
#define CYREG_PHUB_CH18_BASIC_STATUS 0x40007138u
#define CYDEV_PHUB_CH19_BASE 0x40007140u
#define CYDEV_PHUB_CH19_SIZE 0x0000000cu
#define CYREG_PHUB_CH19_BASIC_CFG 0x40007140u
#define CYREG_PHUB_CH19_ACTION 0x40007144u
#define CYREG_PHUB_CH19_BASIC_STATUS 0x40007148u
#define CYDEV_PHUB_CH20_BASE 0x40007150u
#define CYDEV_PHUB_CH20_SIZE 0x0000000cu
#define CYREG_PHUB_CH20_BASIC_CFG 0x40007150u
#define CYREG_PHUB_CH20_ACTION 0x40007154u
#define CYREG_PHUB_CH20_BASIC_STATUS 0x40007158u
#define CYDEV_PHUB_CH21_BASE 0x40007160u
#define CYDEV_PHUB_CH21_SIZE 0x0000000cu
#define CYREG_PHUB_CH21_BASIC_CFG 0x40007160u
#define CYREG_PHUB_CH21_ACTION 0x40007164u
#define CYREG_PHUB_CH21_BASIC_STATUS 0x40007168u
#define CYDEV_PHUB_CH22_BASE 0x40007170u
#define CYDEV_PHUB_CH22_SIZE 0x0000000cu
#define CYREG_PHUB_CH22_BASIC_CFG 0x40007170u
#define CYREG_PHUB_CH22_ACTION 0x40007174u
#define CYREG_PHUB_CH22_BASIC_STATUS 0x40007178u
#define CYDEV_PHUB_CH23_BASE 0x40007180u
#define CYDEV_PHUB_CH23_SIZE 0x0000000cu
#define CYREG_PHUB_CH23_BASIC_CFG 0x40007180u
#define CYREG_PHUB_CH23_ACTION 0x40007184u
#define CYREG_PHUB_CH23_BASIC_STATUS 0x40007188u
#define CYDEV_PHUB_CFGMEM0_BASE 0x40007600u
#define CYDEV_PHUB_CFGMEM0_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM0_CFG0 0x40007600u
#define CYREG_PHUB_CFGMEM0_CFG1 0x40007604u
#define CYDEV_PHUB_CFGMEM1_BASE 0x40007608u
#define CYDEV_PHUB_CFGMEM1_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM1_CFG0 0x40007608u
#define CYREG_PHUB_CFGMEM1_CFG1 0x4000760cu
#define CYDEV_PHUB_CFGMEM2_BASE 0x40007610u
#define CYDEV_PHUB_CFGMEM2_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM2_CFG0 0x40007610u
#define CYREG_PHUB_CFGMEM2_CFG1 0x40007614u
#define CYDEV_PHUB_CFGMEM3_BASE 0x40007618u
#define CYDEV_PHUB_CFGMEM3_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM3_CFG0 0x40007618u
#define CYREG_PHUB_CFGMEM3_CFG1 0x4000761cu
#define CYDEV_PHUB_CFGMEM4_BASE 0x40007620u
#define CYDEV_PHUB_CFGMEM4_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM4_CFG0 0x40007620u
#define CYREG_PHUB_CFGMEM4_CFG1 0x40007624u
#define CYDEV_PHUB_CFGMEM5_BASE 0x40007628u
#define CYDEV_PHUB_CFGMEM5_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM5_CFG0 0x40007628u
#define CYREG_PHUB_CFGMEM5_CFG1 0x4000762cu
#define CYDEV_PHUB_CFGMEM6_BASE 0x40007630u
#define CYDEV_PHUB_CFGMEM6_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM6_CFG0 0x40007630u
#define CYREG_PHUB_CFGMEM6_CFG1 0x40007634u
#define CYDEV_PHUB_CFGMEM7_BASE 0x40007638u
#define CYDEV_PHUB_CFGMEM7_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM7_CFG0 0x40007638u
#define CYREG_PHUB_CFGMEM7_CFG1 0x4000763cu
#define CYDEV_PHUB_CFGMEM8_BASE 0x40007640u
#define CYDEV_PHUB_CFGMEM8_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM8_CFG0 0x40007640u
#define CYREG_PHUB_CFGMEM8_CFG1 0x40007644u
#define CYDEV_PHUB_CFGMEM9_BASE 0x40007648u
#define CYDEV_PHUB_CFGMEM9_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM9_CFG0 0x40007648u
#define CYREG_PHUB_CFGMEM9_CFG1 0x4000764cu
#define CYDEV_PHUB_CFGMEM10_BASE 0x40007650u
#define CYDEV_PHUB_CFGMEM10_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM10_CFG0 0x40007650u
#define CYREG_PHUB_CFGMEM10_CFG1 0x40007654u
#define CYDEV_PHUB_CFGMEM11_BASE 0x40007658u
#define CYDEV_PHUB_CFGMEM11_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM11_CFG0 0x40007658u
#define CYREG_PHUB_CFGMEM11_CFG1 0x4000765cu
#define CYDEV_PHUB_CFGMEM12_BASE 0x40007660u
#define CYDEV_PHUB_CFGMEM12_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM12_CFG0 0x40007660u
#define CYREG_PHUB_CFGMEM12_CFG1 0x40007664u
#define CYDEV_PHUB_CFGMEM13_BASE 0x40007668u
#define CYDEV_PHUB_CFGMEM13_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM13_CFG0 0x40007668u
#define CYREG_PHUB_CFGMEM13_CFG1 0x4000766cu
#define CYDEV_PHUB_CFGMEM14_BASE 0x40007670u
#define CYDEV_PHUB_CFGMEM14_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM14_CFG0 0x40007670u
#define CYREG_PHUB_CFGMEM14_CFG1 0x40007674u
#define CYDEV_PHUB_CFGMEM15_BASE 0x40007678u
#define CYDEV_PHUB_CFGMEM15_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM15_CFG0 0x40007678u
#define CYREG_PHUB_CFGMEM15_CFG1 0x4000767cu
#define CYDEV_PHUB_CFGMEM16_BASE 0x40007680u
#define CYDEV_PHUB_CFGMEM16_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM16_CFG0 0x40007680u
#define CYREG_PHUB_CFGMEM16_CFG1 0x40007684u
#define CYDEV_PHUB_CFGMEM17_BASE 0x40007688u
#define CYDEV_PHUB_CFGMEM17_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM17_CFG0 0x40007688u
#define CYREG_PHUB_CFGMEM17_CFG1 0x4000768cu
#define CYDEV_PHUB_CFGMEM18_BASE 0x40007690u
#define CYDEV_PHUB_CFGMEM18_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM18_CFG0 0x40007690u
#define CYREG_PHUB_CFGMEM18_CFG1 0x40007694u
#define CYDEV_PHUB_CFGMEM19_BASE 0x40007698u
#define CYDEV_PHUB_CFGMEM19_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM19_CFG0 0x40007698u
#define CYREG_PHUB_CFGMEM19_CFG1 0x4000769cu
#define CYDEV_PHUB_CFGMEM20_BASE 0x400076a0u
#define CYDEV_PHUB_CFGMEM20_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM20_CFG0 0x400076a0u
#define CYREG_PHUB_CFGMEM20_CFG1 0x400076a4u
#define CYDEV_PHUB_CFGMEM21_BASE 0x400076a8u
#define CYDEV_PHUB_CFGMEM21_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM21_CFG0 0x400076a8u
#define CYREG_PHUB_CFGMEM21_CFG1 0x400076acu
#define CYDEV_PHUB_CFGMEM22_BASE 0x400076b0u
#define CYDEV_PHUB_CFGMEM22_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM22_CFG0 0x400076b0u
#define CYREG_PHUB_CFGMEM22_CFG1 0x400076b4u
#define CYDEV_PHUB_CFGMEM23_BASE 0x400076b8u
#define CYDEV_PHUB_CFGMEM23_SIZE 0x00000008u
#define CYREG_PHUB_CFGMEM23_CFG0 0x400076b8u
#define CYREG_PHUB_CFGMEM23_CFG1 0x400076bcu
#define CYDEV_PHUB_TDMEM0_BASE 0x40007800u
#define CYDEV_PHUB_TDMEM0_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM0_ORIG_TD0 0x40007800u
#define CYREG_PHUB_TDMEM0_ORIG_TD1 0x40007804u
#define CYDEV_PHUB_TDMEM1_BASE 0x40007808u
#define CYDEV_PHUB_TDMEM1_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM1_ORIG_TD0 0x40007808u
#define CYREG_PHUB_TDMEM1_ORIG_TD1 0x4000780cu
#define CYDEV_PHUB_TDMEM2_BASE 0x40007810u
#define CYDEV_PHUB_TDMEM2_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM2_ORIG_TD0 0x40007810u
#define CYREG_PHUB_TDMEM2_ORIG_TD1 0x40007814u
#define CYDEV_PHUB_TDMEM3_BASE 0x40007818u
#define CYDEV_PHUB_TDMEM3_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM3_ORIG_TD0 0x40007818u
#define CYREG_PHUB_TDMEM3_ORIG_TD1 0x4000781cu
#define CYDEV_PHUB_TDMEM4_BASE 0x40007820u
#define CYDEV_PHUB_TDMEM4_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM4_ORIG_TD0 0x40007820u
#define CYREG_PHUB_TDMEM4_ORIG_TD1 0x40007824u
#define CYDEV_PHUB_TDMEM5_BASE 0x40007828u
#define CYDEV_PHUB_TDMEM5_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM5_ORIG_TD0 0x40007828u
#define CYREG_PHUB_TDMEM5_ORIG_TD1 0x4000782cu
#define CYDEV_PHUB_TDMEM6_BASE 0x40007830u
#define CYDEV_PHUB_TDMEM6_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM6_ORIG_TD0 0x40007830u
#define CYREG_PHUB_TDMEM6_ORIG_TD1 0x40007834u
#define CYDEV_PHUB_TDMEM7_BASE 0x40007838u
#define CYDEV_PHUB_TDMEM7_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM7_ORIG_TD0 0x40007838u
#define CYREG_PHUB_TDMEM7_ORIG_TD1 0x4000783cu
#define CYDEV_PHUB_TDMEM8_BASE 0x40007840u
#define CYDEV_PHUB_TDMEM8_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM8_ORIG_TD0 0x40007840u
#define CYREG_PHUB_TDMEM8_ORIG_TD1 0x40007844u
#define CYDEV_PHUB_TDMEM9_BASE 0x40007848u
#define CYDEV_PHUB_TDMEM9_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM9_ORIG_TD0 0x40007848u
#define CYREG_PHUB_TDMEM9_ORIG_TD1 0x4000784cu
#define CYDEV_PHUB_TDMEM10_BASE 0x40007850u
#define CYDEV_PHUB_TDMEM10_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM10_ORIG_TD0 0x40007850u
#define CYREG_PHUB_TDMEM10_ORIG_TD1 0x40007854u
#define CYDEV_PHUB_TDMEM11_BASE 0x40007858u
#define CYDEV_PHUB_TDMEM11_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM11_ORIG_TD0 0x40007858u
#define CYREG_PHUB_TDMEM11_ORIG_TD1 0x4000785cu
#define CYDEV_PHUB_TDMEM12_BASE 0x40007860u
#define CYDEV_PHUB_TDMEM12_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM12_ORIG_TD0 0x40007860u
#define CYREG_PHUB_TDMEM12_ORIG_TD1 0x40007864u
#define CYDEV_PHUB_TDMEM13_BASE 0x40007868u
#define CYDEV_PHUB_TDMEM13_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM13_ORIG_TD0 0x40007868u
#define CYREG_PHUB_TDMEM13_ORIG_TD1 0x4000786cu
#define CYDEV_PHUB_TDMEM14_BASE 0x40007870u
#define CYDEV_PHUB_TDMEM14_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM14_ORIG_TD0 0x40007870u
#define CYREG_PHUB_TDMEM14_ORIG_TD1 0x40007874u
#define CYDEV_PHUB_TDMEM15_BASE 0x40007878u
#define CYDEV_PHUB_TDMEM15_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM15_ORIG_TD0 0x40007878u
#define CYREG_PHUB_TDMEM15_ORIG_TD1 0x4000787cu
#define CYDEV_PHUB_TDMEM16_BASE 0x40007880u
#define CYDEV_PHUB_TDMEM16_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM16_ORIG_TD0 0x40007880u
#define CYREG_PHUB_TDMEM16_ORIG_TD1 0x40007884u
#define CYDEV_PHUB_TDMEM17_BASE 0x40007888u
#define CYDEV_PHUB_TDMEM17_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM17_ORIG_TD0 0x40007888u
#define CYREG_PHUB_TDMEM17_ORIG_TD1 0x4000788cu
#define CYDEV_PHUB_TDMEM18_BASE 0x40007890u
#define CYDEV_PHUB_TDMEM18_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM18_ORIG_TD0 0x40007890u
#define CYREG_PHUB_TDMEM18_ORIG_TD1 0x40007894u
#define CYDEV_PHUB_TDMEM19_BASE 0x40007898u
#define CYDEV_PHUB_TDMEM19_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM19_ORIG_TD0 0x40007898u
#define CYREG_PHUB_TDMEM19_ORIG_TD1 0x4000789cu
#define CYDEV_PHUB_TDMEM20_BASE 0x400078a0u
#define CYDEV_PHUB_TDMEM20_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM20_ORIG_TD0 0x400078a0u
#define CYREG_PHUB_TDMEM20_ORIG_TD1 0x400078a4u
#define CYDEV_PHUB_TDMEM21_BASE 0x400078a8u
#define CYDEV_PHUB_TDMEM21_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM21_ORIG_TD0 0x400078a8u
#define CYREG_PHUB_TDMEM21_ORIG_TD1 0x400078acu
#define CYDEV_PHUB_TDMEM22_BASE 0x400078b0u
#define CYDEV_PHUB_TDMEM22_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM22_ORIG_TD0 0x400078b0u
#define CYREG_PHUB_TDMEM22_ORIG_TD1 0x400078b4u
#define CYDEV_PHUB_TDMEM23_BASE 0x400078b8u
#define CYDEV_PHUB_TDMEM23_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM23_ORIG_TD0 0x400078b8u
#define CYREG_PHUB_TDMEM23_ORIG_TD1 0x400078bcu
#define CYDEV_PHUB_TDMEM24_BASE 0x400078c0u
#define CYDEV_PHUB_TDMEM24_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM24_ORIG_TD0 0x400078c0u
#define CYREG_PHUB_TDMEM24_ORIG_TD1 0x400078c4u
#define CYDEV_PHUB_TDMEM25_BASE 0x400078c8u
#define CYDEV_PHUB_TDMEM25_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM25_ORIG_TD0 0x400078c8u
#define CYREG_PHUB_TDMEM25_ORIG_TD1 0x400078ccu
#define CYDEV_PHUB_TDMEM26_BASE 0x400078d0u
#define CYDEV_PHUB_TDMEM26_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM26_ORIG_TD0 0x400078d0u
#define CYREG_PHUB_TDMEM26_ORIG_TD1 0x400078d4u
#define CYDEV_PHUB_TDMEM27_BASE 0x400078d8u
#define CYDEV_PHUB_TDMEM27_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM27_ORIG_TD0 0x400078d8u
#define CYREG_PHUB_TDMEM27_ORIG_TD1 0x400078dcu
#define CYDEV_PHUB_TDMEM28_BASE 0x400078e0u
#define CYDEV_PHUB_TDMEM28_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM28_ORIG_TD0 0x400078e0u
#define CYREG_PHUB_TDMEM28_ORIG_TD1 0x400078e4u
#define CYDEV_PHUB_TDMEM29_BASE 0x400078e8u
#define CYDEV_PHUB_TDMEM29_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM29_ORIG_TD0 0x400078e8u
#define CYREG_PHUB_TDMEM29_ORIG_TD1 0x400078ecu
#define CYDEV_PHUB_TDMEM30_BASE 0x400078f0u
#define CYDEV_PHUB_TDMEM30_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM30_ORIG_TD0 0x400078f0u
#define CYREG_PHUB_TDMEM30_ORIG_TD1 0x400078f4u
#define CYDEV_PHUB_TDMEM31_BASE 0x400078f8u
#define CYDEV_PHUB_TDMEM31_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM31_ORIG_TD0 0x400078f8u
#define CYREG_PHUB_TDMEM31_ORIG_TD1 0x400078fcu
#define CYDEV_PHUB_TDMEM32_BASE 0x40007900u
#define CYDEV_PHUB_TDMEM32_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM32_ORIG_TD0 0x40007900u
#define CYREG_PHUB_TDMEM32_ORIG_TD1 0x40007904u
#define CYDEV_PHUB_TDMEM33_BASE 0x40007908u
#define CYDEV_PHUB_TDMEM33_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM33_ORIG_TD0 0x40007908u
#define CYREG_PHUB_TDMEM33_ORIG_TD1 0x4000790cu
#define CYDEV_PHUB_TDMEM34_BASE 0x40007910u
#define CYDEV_PHUB_TDMEM34_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM34_ORIG_TD0 0x40007910u
#define CYREG_PHUB_TDMEM34_ORIG_TD1 0x40007914u
#define CYDEV_PHUB_TDMEM35_BASE 0x40007918u
#define CYDEV_PHUB_TDMEM35_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM35_ORIG_TD0 0x40007918u
#define CYREG_PHUB_TDMEM35_ORIG_TD1 0x4000791cu
#define CYDEV_PHUB_TDMEM36_BASE 0x40007920u
#define CYDEV_PHUB_TDMEM36_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM36_ORIG_TD0 0x40007920u
#define CYREG_PHUB_TDMEM36_ORIG_TD1 0x40007924u
#define CYDEV_PHUB_TDMEM37_BASE 0x40007928u
#define CYDEV_PHUB_TDMEM37_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM37_ORIG_TD0 0x40007928u
#define CYREG_PHUB_TDMEM37_ORIG_TD1 0x4000792cu
#define CYDEV_PHUB_TDMEM38_BASE 0x40007930u
#define CYDEV_PHUB_TDMEM38_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM38_ORIG_TD0 0x40007930u
#define CYREG_PHUB_TDMEM38_ORIG_TD1 0x40007934u
#define CYDEV_PHUB_TDMEM39_BASE 0x40007938u
#define CYDEV_PHUB_TDMEM39_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM39_ORIG_TD0 0x40007938u
#define CYREG_PHUB_TDMEM39_ORIG_TD1 0x4000793cu
#define CYDEV_PHUB_TDMEM40_BASE 0x40007940u
#define CYDEV_PHUB_TDMEM40_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM40_ORIG_TD0 0x40007940u
#define CYREG_PHUB_TDMEM40_ORIG_TD1 0x40007944u
#define CYDEV_PHUB_TDMEM41_BASE 0x40007948u
#define CYDEV_PHUB_TDMEM41_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM41_ORIG_TD0 0x40007948u
#define CYREG_PHUB_TDMEM41_ORIG_TD1 0x4000794cu
#define CYDEV_PHUB_TDMEM42_BASE 0x40007950u
#define CYDEV_PHUB_TDMEM42_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM42_ORIG_TD0 0x40007950u
#define CYREG_PHUB_TDMEM42_ORIG_TD1 0x40007954u
#define CYDEV_PHUB_TDMEM43_BASE 0x40007958u
#define CYDEV_PHUB_TDMEM43_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM43_ORIG_TD0 0x40007958u
#define CYREG_PHUB_TDMEM43_ORIG_TD1 0x4000795cu
#define CYDEV_PHUB_TDMEM44_BASE 0x40007960u
#define CYDEV_PHUB_TDMEM44_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM44_ORIG_TD0 0x40007960u
#define CYREG_PHUB_TDMEM44_ORIG_TD1 0x40007964u
#define CYDEV_PHUB_TDMEM45_BASE 0x40007968u
#define CYDEV_PHUB_TDMEM45_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM45_ORIG_TD0 0x40007968u
#define CYREG_PHUB_TDMEM45_ORIG_TD1 0x4000796cu
#define CYDEV_PHUB_TDMEM46_BASE 0x40007970u
#define CYDEV_PHUB_TDMEM46_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM46_ORIG_TD0 0x40007970u
#define CYREG_PHUB_TDMEM46_ORIG_TD1 0x40007974u
#define CYDEV_PHUB_TDMEM47_BASE 0x40007978u
#define CYDEV_PHUB_TDMEM47_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM47_ORIG_TD0 0x40007978u
#define CYREG_PHUB_TDMEM47_ORIG_TD1 0x4000797cu
#define CYDEV_PHUB_TDMEM48_BASE 0x40007980u
#define CYDEV_PHUB_TDMEM48_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM48_ORIG_TD0 0x40007980u
#define CYREG_PHUB_TDMEM48_ORIG_TD1 0x40007984u
#define CYDEV_PHUB_TDMEM49_BASE 0x40007988u
#define CYDEV_PHUB_TDMEM49_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM49_ORIG_TD0 0x40007988u
#define CYREG_PHUB_TDMEM49_ORIG_TD1 0x4000798cu
#define CYDEV_PHUB_TDMEM50_BASE 0x40007990u
#define CYDEV_PHUB_TDMEM50_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM50_ORIG_TD0 0x40007990u
#define CYREG_PHUB_TDMEM50_ORIG_TD1 0x40007994u
#define CYDEV_PHUB_TDMEM51_BASE 0x40007998u
#define CYDEV_PHUB_TDMEM51_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM51_ORIG_TD0 0x40007998u
#define CYREG_PHUB_TDMEM51_ORIG_TD1 0x4000799cu
#define CYDEV_PHUB_TDMEM52_BASE 0x400079a0u
#define CYDEV_PHUB_TDMEM52_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM52_ORIG_TD0 0x400079a0u
#define CYREG_PHUB_TDMEM52_ORIG_TD1 0x400079a4u
#define CYDEV_PHUB_TDMEM53_BASE 0x400079a8u
#define CYDEV_PHUB_TDMEM53_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM53_ORIG_TD0 0x400079a8u
#define CYREG_PHUB_TDMEM53_ORIG_TD1 0x400079acu
#define CYDEV_PHUB_TDMEM54_BASE 0x400079b0u
#define CYDEV_PHUB_TDMEM54_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM54_ORIG_TD0 0x400079b0u
#define CYREG_PHUB_TDMEM54_ORIG_TD1 0x400079b4u
#define CYDEV_PHUB_TDMEM55_BASE 0x400079b8u
#define CYDEV_PHUB_TDMEM55_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM55_ORIG_TD0 0x400079b8u
#define CYREG_PHUB_TDMEM55_ORIG_TD1 0x400079bcu
#define CYDEV_PHUB_TDMEM56_BASE 0x400079c0u
#define CYDEV_PHUB_TDMEM56_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM56_ORIG_TD0 0x400079c0u
#define CYREG_PHUB_TDMEM56_ORIG_TD1 0x400079c4u
#define CYDEV_PHUB_TDMEM57_BASE 0x400079c8u
#define CYDEV_PHUB_TDMEM57_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM57_ORIG_TD0 0x400079c8u
#define CYREG_PHUB_TDMEM57_ORIG_TD1 0x400079ccu
#define CYDEV_PHUB_TDMEM58_BASE 0x400079d0u
#define CYDEV_PHUB_TDMEM58_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM58_ORIG_TD0 0x400079d0u
#define CYREG_PHUB_TDMEM58_ORIG_TD1 0x400079d4u
#define CYDEV_PHUB_TDMEM59_BASE 0x400079d8u
#define CYDEV_PHUB_TDMEM59_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM59_ORIG_TD0 0x400079d8u
#define CYREG_PHUB_TDMEM59_ORIG_TD1 0x400079dcu
#define CYDEV_PHUB_TDMEM60_BASE 0x400079e0u
#define CYDEV_PHUB_TDMEM60_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM60_ORIG_TD0 0x400079e0u
#define CYREG_PHUB_TDMEM60_ORIG_TD1 0x400079e4u
#define CYDEV_PHUB_TDMEM61_BASE 0x400079e8u
#define CYDEV_PHUB_TDMEM61_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM61_ORIG_TD0 0x400079e8u
#define CYREG_PHUB_TDMEM61_ORIG_TD1 0x400079ecu
#define CYDEV_PHUB_TDMEM62_BASE 0x400079f0u
#define CYDEV_PHUB_TDMEM62_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM62_ORIG_TD0 0x400079f0u
#define CYREG_PHUB_TDMEM62_ORIG_TD1 0x400079f4u
#define CYDEV_PHUB_TDMEM63_BASE 0x400079f8u
#define CYDEV_PHUB_TDMEM63_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM63_ORIG_TD0 0x400079f8u
#define CYREG_PHUB_TDMEM63_ORIG_TD1 0x400079fcu
#define CYDEV_PHUB_TDMEM64_BASE 0x40007a00u
#define CYDEV_PHUB_TDMEM64_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM64_ORIG_TD0 0x40007a00u
#define CYREG_PHUB_TDMEM64_ORIG_TD1 0x40007a04u
#define CYDEV_PHUB_TDMEM65_BASE 0x40007a08u
#define CYDEV_PHUB_TDMEM65_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM65_ORIG_TD0 0x40007a08u
#define CYREG_PHUB_TDMEM65_ORIG_TD1 0x40007a0cu
#define CYDEV_PHUB_TDMEM66_BASE 0x40007a10u
#define CYDEV_PHUB_TDMEM66_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM66_ORIG_TD0 0x40007a10u
#define CYREG_PHUB_TDMEM66_ORIG_TD1 0x40007a14u
#define CYDEV_PHUB_TDMEM67_BASE 0x40007a18u
#define CYDEV_PHUB_TDMEM67_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM67_ORIG_TD0 0x40007a18u
#define CYREG_PHUB_TDMEM67_ORIG_TD1 0x40007a1cu
#define CYDEV_PHUB_TDMEM68_BASE 0x40007a20u
#define CYDEV_PHUB_TDMEM68_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM68_ORIG_TD0 0x40007a20u
#define CYREG_PHUB_TDMEM68_ORIG_TD1 0x40007a24u
#define CYDEV_PHUB_TDMEM69_BASE 0x40007a28u
#define CYDEV_PHUB_TDMEM69_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM69_ORIG_TD0 0x40007a28u
#define CYREG_PHUB_TDMEM69_ORIG_TD1 0x40007a2cu
#define CYDEV_PHUB_TDMEM70_BASE 0x40007a30u
#define CYDEV_PHUB_TDMEM70_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM70_ORIG_TD0 0x40007a30u
#define CYREG_PHUB_TDMEM70_ORIG_TD1 0x40007a34u
#define CYDEV_PHUB_TDMEM71_BASE 0x40007a38u
#define CYDEV_PHUB_TDMEM71_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM71_ORIG_TD0 0x40007a38u
#define CYREG_PHUB_TDMEM71_ORIG_TD1 0x40007a3cu
#define CYDEV_PHUB_TDMEM72_BASE 0x40007a40u
#define CYDEV_PHUB_TDMEM72_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM72_ORIG_TD0 0x40007a40u
#define CYREG_PHUB_TDMEM72_ORIG_TD1 0x40007a44u
#define CYDEV_PHUB_TDMEM73_BASE 0x40007a48u
#define CYDEV_PHUB_TDMEM73_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM73_ORIG_TD0 0x40007a48u
#define CYREG_PHUB_TDMEM73_ORIG_TD1 0x40007a4cu
#define CYDEV_PHUB_TDMEM74_BASE 0x40007a50u
#define CYDEV_PHUB_TDMEM74_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM74_ORIG_TD0 0x40007a50u
#define CYREG_PHUB_TDMEM74_ORIG_TD1 0x40007a54u
#define CYDEV_PHUB_TDMEM75_BASE 0x40007a58u
#define CYDEV_PHUB_TDMEM75_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM75_ORIG_TD0 0x40007a58u
#define CYREG_PHUB_TDMEM75_ORIG_TD1 0x40007a5cu
#define CYDEV_PHUB_TDMEM76_BASE 0x40007a60u
#define CYDEV_PHUB_TDMEM76_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM76_ORIG_TD0 0x40007a60u
#define CYREG_PHUB_TDMEM76_ORIG_TD1 0x40007a64u
#define CYDEV_PHUB_TDMEM77_BASE 0x40007a68u
#define CYDEV_PHUB_TDMEM77_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM77_ORIG_TD0 0x40007a68u
#define CYREG_PHUB_TDMEM77_ORIG_TD1 0x40007a6cu
#define CYDEV_PHUB_TDMEM78_BASE 0x40007a70u
#define CYDEV_PHUB_TDMEM78_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM78_ORIG_TD0 0x40007a70u
#define CYREG_PHUB_TDMEM78_ORIG_TD1 0x40007a74u
#define CYDEV_PHUB_TDMEM79_BASE 0x40007a78u
#define CYDEV_PHUB_TDMEM79_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM79_ORIG_TD0 0x40007a78u
#define CYREG_PHUB_TDMEM79_ORIG_TD1 0x40007a7cu
#define CYDEV_PHUB_TDMEM80_BASE 0x40007a80u
#define CYDEV_PHUB_TDMEM80_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM80_ORIG_TD0 0x40007a80u
#define CYREG_PHUB_TDMEM80_ORIG_TD1 0x40007a84u
#define CYDEV_PHUB_TDMEM81_BASE 0x40007a88u
#define CYDEV_PHUB_TDMEM81_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM81_ORIG_TD0 0x40007a88u
#define CYREG_PHUB_TDMEM81_ORIG_TD1 0x40007a8cu
#define CYDEV_PHUB_TDMEM82_BASE 0x40007a90u
#define CYDEV_PHUB_TDMEM82_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM82_ORIG_TD0 0x40007a90u
#define CYREG_PHUB_TDMEM82_ORIG_TD1 0x40007a94u
#define CYDEV_PHUB_TDMEM83_BASE 0x40007a98u
#define CYDEV_PHUB_TDMEM83_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM83_ORIG_TD0 0x40007a98u
#define CYREG_PHUB_TDMEM83_ORIG_TD1 0x40007a9cu
#define CYDEV_PHUB_TDMEM84_BASE 0x40007aa0u
#define CYDEV_PHUB_TDMEM84_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM84_ORIG_TD0 0x40007aa0u
#define CYREG_PHUB_TDMEM84_ORIG_TD1 0x40007aa4u
#define CYDEV_PHUB_TDMEM85_BASE 0x40007aa8u
#define CYDEV_PHUB_TDMEM85_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM85_ORIG_TD0 0x40007aa8u
#define CYREG_PHUB_TDMEM85_ORIG_TD1 0x40007aacu
#define CYDEV_PHUB_TDMEM86_BASE 0x40007ab0u
#define CYDEV_PHUB_TDMEM86_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM86_ORIG_TD0 0x40007ab0u
#define CYREG_PHUB_TDMEM86_ORIG_TD1 0x40007ab4u
#define CYDEV_PHUB_TDMEM87_BASE 0x40007ab8u
#define CYDEV_PHUB_TDMEM87_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM87_ORIG_TD0 0x40007ab8u
#define CYREG_PHUB_TDMEM87_ORIG_TD1 0x40007abcu
#define CYDEV_PHUB_TDMEM88_BASE 0x40007ac0u
#define CYDEV_PHUB_TDMEM88_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM88_ORIG_TD0 0x40007ac0u
#define CYREG_PHUB_TDMEM88_ORIG_TD1 0x40007ac4u
#define CYDEV_PHUB_TDMEM89_BASE 0x40007ac8u
#define CYDEV_PHUB_TDMEM89_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM89_ORIG_TD0 0x40007ac8u
#define CYREG_PHUB_TDMEM89_ORIG_TD1 0x40007accu
#define CYDEV_PHUB_TDMEM90_BASE 0x40007ad0u
#define CYDEV_PHUB_TDMEM90_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM90_ORIG_TD0 0x40007ad0u
#define CYREG_PHUB_TDMEM90_ORIG_TD1 0x40007ad4u
#define CYDEV_PHUB_TDMEM91_BASE 0x40007ad8u
#define CYDEV_PHUB_TDMEM91_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM91_ORIG_TD0 0x40007ad8u
#define CYREG_PHUB_TDMEM91_ORIG_TD1 0x40007adcu
