MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYDEV_PHUB_TDMEM92_BASE 0x40007ae0u
#define CYDEV_PHUB_TDMEM92_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM92_ORIG_TD0 0x40007ae0u
#define CYREG_PHUB_TDMEM92_ORIG_TD1 0x40007ae4u
#define CYDEV_PHUB_TDMEM93_BASE 0x40007ae8u
#define CYDEV_PHUB_TDMEM93_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM93_ORIG_TD0 0x40007ae8u
#define CYREG_PHUB_TDMEM93_ORIG_TD1 0x40007aecu
#define CYDEV_PHUB_TDMEM94_BASE 0x40007af0u
#define CYDEV_PHUB_TDMEM94_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM94_ORIG_TD0 0x40007af0u
#define CYREG_PHUB_TDMEM94_ORIG_TD1 0x40007af4u
#define CYDEV_PHUB_TDMEM95_BASE 0x40007af8u
#define CYDEV_PHUB_TDMEM95_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM95_ORIG_TD0 0x40007af8u
#define CYREG_PHUB_TDMEM95_ORIG_TD1 0x40007afcu
#define CYDEV_PHUB_TDMEM96_BASE 0x40007b00u
#define CYDEV_PHUB_TDMEM96_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM96_ORIG_TD0 0x40007b00u
#define CYREG_PHUB_TDMEM96_ORIG_TD1 0x40007b04u
#define CYDEV_PHUB_TDMEM97_BASE 0x40007b08u
#define CYDEV_PHUB_TDMEM97_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM97_ORIG_TD0 0x40007b08u
#define CYREG_PHUB_TDMEM97_ORIG_TD1 0x40007b0cu
#define CYDEV_PHUB_TDMEM98_BASE 0x40007b10u
#define CYDEV_PHUB_TDMEM98_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM98_ORIG_TD0 0x40007b10u
#define CYREG_PHUB_TDMEM98_ORIG_TD1 0x40007b14u
#define CYDEV_PHUB_TDMEM99_BASE 0x40007b18u
#define CYDEV_PHUB_TDMEM99_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM99_ORIG_TD0 0x40007b18u
#define CYREG_PHUB_TDMEM99_ORIG_TD1 0x40007b1cu
#define CYDEV_PHUB_TDMEM100_BASE 0x40007b20u
#define CYDEV_PHUB_TDMEM100_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM100_ORIG_TD0 0x40007b20u
#define CYREG_PHUB_TDMEM100_ORIG_TD1 0x40007b24u
#define CYDEV_PHUB_TDMEM101_BASE 0x40007b28u
#define CYDEV_PHUB_TDMEM101_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM101_ORIG_TD0 0x40007b28u
#define CYREG_PHUB_TDMEM101_ORIG_TD1 0x40007b2cu
#define CYDEV_PHUB_TDMEM102_BASE 0x40007b30u
#define CYDEV_PHUB_TDMEM102_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM102_ORIG_TD0 0x40007b30u
#define CYREG_PHUB_TDMEM102_ORIG_TD1 0x40007b34u
#define CYDEV_PHUB_TDMEM103_BASE 0x40007b38u
#define CYDEV_PHUB_TDMEM103_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM103_ORIG_TD0 0x40007b38u
#define CYREG_PHUB_TDMEM103_ORIG_TD1 0x40007b3cu
#define CYDEV_PHUB_TDMEM104_BASE 0x40007b40u
#define CYDEV_PHUB_TDMEM104_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM104_ORIG_TD0 0x40007b40u
#define CYREG_PHUB_TDMEM104_ORIG_TD1 0x40007b44u
#define CYDEV_PHUB_TDMEM105_BASE 0x40007b48u
#define CYDEV_PHUB_TDMEM105_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM105_ORIG_TD0 0x40007b48u
#define CYREG_PHUB_TDMEM105_ORIG_TD1 0x40007b4cu
#define CYDEV_PHUB_TDMEM106_BASE 0x40007b50u
#define CYDEV_PHUB_TDMEM106_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM106_ORIG_TD0 0x40007b50u
#define CYREG_PHUB_TDMEM106_ORIG_TD1 0x40007b54u
#define CYDEV_PHUB_TDMEM107_BASE 0x40007b58u
#define CYDEV_PHUB_TDMEM107_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM107_ORIG_TD0 0x40007b58u
#define CYREG_PHUB_TDMEM107_ORIG_TD1 0x40007b5cu
#define CYDEV_PHUB_TDMEM108_BASE 0x40007b60u
#define CYDEV_PHUB_TDMEM108_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM108_ORIG_TD0 0x40007b60u
#define CYREG_PHUB_TDMEM108_ORIG_TD1 0x40007b64u
#define CYDEV_PHUB_TDMEM109_BASE 0x40007b68u
#define CYDEV_PHUB_TDMEM109_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM109_ORIG_TD0 0x40007b68u
#define CYREG_PHUB_TDMEM109_ORIG_TD1 0x40007b6cu
#define CYDEV_PHUB_TDMEM110_BASE 0x40007b70u
#define CYDEV_PHUB_TDMEM110_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM110_ORIG_TD0 0x40007b70u
#define CYREG_PHUB_TDMEM110_ORIG_TD1 0x40007b74u
#define CYDEV_PHUB_TDMEM111_BASE 0x40007b78u
#define CYDEV_PHUB_TDMEM111_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM111_ORIG_TD0 0x40007b78u
#define CYREG_PHUB_TDMEM111_ORIG_TD1 0x40007b7cu
#define CYDEV_PHUB_TDMEM112_BASE 0x40007b80u
#define CYDEV_PHUB_TDMEM112_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM112_ORIG_TD0 0x40007b80u
#define CYREG_PHUB_TDMEM112_ORIG_TD1 0x40007b84u
#define CYDEV_PHUB_TDMEM113_BASE 0x40007b88u
#define CYDEV_PHUB_TDMEM113_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM113_ORIG_TD0 0x40007b88u
#define CYREG_PHUB_TDMEM113_ORIG_TD1 0x40007b8cu
#define CYDEV_PHUB_TDMEM114_BASE 0x40007b90u
#define CYDEV_PHUB_TDMEM114_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM114_ORIG_TD0 0x40007b90u
#define CYREG_PHUB_TDMEM114_ORIG_TD1 0x40007b94u
#define CYDEV_PHUB_TDMEM115_BASE 0x40007b98u
#define CYDEV_PHUB_TDMEM115_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM115_ORIG_TD0 0x40007b98u
#define CYREG_PHUB_TDMEM115_ORIG_TD1 0x40007b9cu
#define CYDEV_PHUB_TDMEM116_BASE 0x40007ba0u
#define CYDEV_PHUB_TDMEM116_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM116_ORIG_TD0 0x40007ba0u
#define CYREG_PHUB_TDMEM116_ORIG_TD1 0x40007ba4u
#define CYDEV_PHUB_TDMEM117_BASE 0x40007ba8u
#define CYDEV_PHUB_TDMEM117_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM117_ORIG_TD0 0x40007ba8u
#define CYREG_PHUB_TDMEM117_ORIG_TD1 0x40007bacu
#define CYDEV_PHUB_TDMEM118_BASE 0x40007bb0u
#define CYDEV_PHUB_TDMEM118_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM118_ORIG_TD0 0x40007bb0u
#define CYREG_PHUB_TDMEM118_ORIG_TD1 0x40007bb4u
#define CYDEV_PHUB_TDMEM119_BASE 0x40007bb8u
#define CYDEV_PHUB_TDMEM119_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM119_ORIG_TD0 0x40007bb8u
#define CYREG_PHUB_TDMEM119_ORIG_TD1 0x40007bbcu
#define CYDEV_PHUB_TDMEM120_BASE 0x40007bc0u
#define CYDEV_PHUB_TDMEM120_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM120_ORIG_TD0 0x40007bc0u
#define CYREG_PHUB_TDMEM120_ORIG_TD1 0x40007bc4u
#define CYDEV_PHUB_TDMEM121_BASE 0x40007bc8u
#define CYDEV_PHUB_TDMEM121_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM121_ORIG_TD0 0x40007bc8u
#define CYREG_PHUB_TDMEM121_ORIG_TD1 0x40007bccu
#define CYDEV_PHUB_TDMEM122_BASE 0x40007bd0u
#define CYDEV_PHUB_TDMEM122_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM122_ORIG_TD0 0x40007bd0u
#define CYREG_PHUB_TDMEM122_ORIG_TD1 0x40007bd4u
#define CYDEV_PHUB_TDMEM123_BASE 0x40007bd8u
#define CYDEV_PHUB_TDMEM123_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM123_ORIG_TD0 0x40007bd8u
#define CYREG_PHUB_TDMEM123_ORIG_TD1 0x40007bdcu
#define CYDEV_PHUB_TDMEM124_BASE 0x40007be0u
#define CYDEV_PHUB_TDMEM124_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM124_ORIG_TD0 0x40007be0u
#define CYREG_PHUB_TDMEM124_ORIG_TD1 0x40007be4u
#define CYDEV_PHUB_TDMEM125_BASE 0x40007be8u
#define CYDEV_PHUB_TDMEM125_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM125_ORIG_TD0 0x40007be8u
#define CYREG_PHUB_TDMEM125_ORIG_TD1 0x40007becu
#define CYDEV_PHUB_TDMEM126_BASE 0x40007bf0u
#define CYDEV_PHUB_TDMEM126_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM126_ORIG_TD0 0x40007bf0u
#define CYREG_PHUB_TDMEM126_ORIG_TD1 0x40007bf4u
#define CYDEV_PHUB_TDMEM127_BASE 0x40007bf8u
#define CYDEV_PHUB_TDMEM127_SIZE 0x00000008u
#define CYREG_PHUB_TDMEM127_ORIG_TD0 0x40007bf8u
#define CYREG_PHUB_TDMEM127_ORIG_TD1 0x40007bfcu
#define CYDEV_EE_BASE 0x40008000u
#define CYDEV_EE_SIZE 0x00000800u
#define CYREG_EE_DATA_MBASE 0x40008000u
#define CYREG_EE_DATA_MSIZE 0x00000800u
#define CYDEV_CAN0_BASE 0x4000a000u
#define CYDEV_CAN0_SIZE 0x000002a0u
#define CYDEV_CAN0_CSR_BASE 0x4000a000u
#define CYDEV_CAN0_CSR_SIZE 0x00000018u
#define CYREG_CAN0_CSR_INT_SR 0x4000a000u
#define CYREG_CAN0_CSR_INT_EN 0x4000a004u
#define CYREG_CAN0_CSR_BUF_SR 0x4000a008u
#define CYREG_CAN0_CSR_ERR_SR 0x4000a00cu
#define CYREG_CAN0_CSR_CMD 0x4000a010u
#define CYREG_CAN0_CSR_CFG 0x4000a014u
#define CYDEV_CAN0_TX0_BASE 0x4000a020u
#define CYDEV_CAN0_TX0_SIZE 0x00000010u
#define CYREG_CAN0_TX0_CMD 0x4000a020u
#define CYREG_CAN0_TX0_ID 0x4000a024u
#define CYREG_CAN0_TX0_DH 0x4000a028u
#define CYREG_CAN0_TX0_DL 0x4000a02cu
#define CYDEV_CAN0_TX1_BASE 0x4000a030u
#define CYDEV_CAN0_TX1_SIZE 0x00000010u
#define CYREG_CAN0_TX1_CMD 0x4000a030u
#define CYREG_CAN0_TX1_ID 0x4000a034u
#define CYREG_CAN0_TX1_DH 0x4000a038u
#define CYREG_CAN0_TX1_DL 0x4000a03cu
#define CYDEV_CAN0_TX2_BASE 0x4000a040u
#define CYDEV_CAN0_TX2_SIZE 0x00000010u
#define CYREG_CAN0_TX2_CMD 0x4000a040u
#define CYREG_CAN0_TX2_ID 0x4000a044u
#define CYREG_CAN0_TX2_DH 0x4000a048u
#define CYREG_CAN0_TX2_DL 0x4000a04cu
#define CYDEV_CAN0_TX3_BASE 0x4000a050u
#define CYDEV_CAN0_TX3_SIZE 0x00000010u
#define CYREG_CAN0_TX3_CMD 0x4000a050u
#define CYREG_CAN0_TX3_ID 0x4000a054u
#define CYREG_CAN0_TX3_DH 0x4000a058u
#define CYREG_CAN0_TX3_DL 0x4000a05cu
#define CYDEV_CAN0_TX4_BASE 0x4000a060u
#define CYDEV_CAN0_TX4_SIZE 0x00000010u
#define CYREG_CAN0_TX4_CMD 0x4000a060u
#define CYREG_CAN0_TX4_ID 0x4000a064u
#define CYREG_CAN0_TX4_DH 0x4000a068u
#define CYREG_CAN0_TX4_DL 0x4000a06cu
#define CYDEV_CAN0_TX5_BASE 0x4000a070u
#define CYDEV_CAN0_TX5_SIZE 0x00000010u
#define CYREG_CAN0_TX5_CMD 0x4000a070u
#define CYREG_CAN0_TX5_ID 0x4000a074u
#define CYREG_CAN0_TX5_DH 0x4000a078u
#define CYREG_CAN0_TX5_DL 0x4000a07cu
#define CYDEV_CAN0_TX6_BASE 0x4000a080u
#define CYDEV_CAN0_TX6_SIZE 0x00000010u
#define CYREG_CAN0_TX6_CMD 0x4000a080u
#define CYREG_CAN0_TX6_ID 0x4000a084u
#define CYREG_CAN0_TX6_DH 0x4000a088u
#define CYREG_CAN0_TX6_DL 0x4000a08cu
#define CYDEV_CAN0_TX7_BASE 0x4000a090u
#define CYDEV_CAN0_TX7_SIZE 0x00000010u
#define CYREG_CAN0_TX7_CMD 0x4000a090u
#define CYREG_CAN0_TX7_ID 0x4000a094u
#define CYREG_CAN0_TX7_DH 0x4000a098u
#define CYREG_CAN0_TX7_DL 0x4000a09cu
#define CYDEV_CAN0_RX0_BASE 0x4000a0a0u
#define CYDEV_CAN0_RX0_SIZE 0x00000020u
#define CYREG_CAN0_RX0_CMD 0x4000a0a0u
#define CYREG_CAN0_RX0_ID 0x4000a0a4u
#define CYREG_CAN0_RX0_DH 0x4000a0a8u
#define CYREG_CAN0_RX0_DL 0x4000a0acu
#define CYREG_CAN0_RX0_AMR 0x4000a0b0u
#define CYREG_CAN0_RX0_ACR 0x4000a0b4u
#define CYREG_CAN0_RX0_AMRD 0x4000a0b8u
#define CYREG_CAN0_RX0_ACRD 0x4000a0bcu
#define CYDEV_CAN0_RX1_BASE 0x4000a0c0u
#define CYDEV_CAN0_RX1_SIZE 0x00000020u
#define CYREG_CAN0_RX1_CMD 0x4000a0c0u
#define CYREG_CAN0_RX1_ID 0x4000a0c4u
#define CYREG_CAN0_RX1_DH 0x4000a0c8u
#define CYREG_CAN0_RX1_DL 0x4000a0ccu
#define CYREG_CAN0_RX1_AMR 0x4000a0d0u
#define CYREG_CAN0_RX1_ACR 0x4000a0d4u
#define CYREG_CAN0_RX1_AMRD 0x4000a0d8u
#define CYREG_CAN0_RX1_ACRD 0x4000a0dcu
#define CYDEV_CAN0_RX2_BASE 0x4000a0e0u
#define CYDEV_CAN0_RX2_SIZE 0x00000020u
#define CYREG_CAN0_RX2_CMD 0x4000a0e0u
#define CYREG_CAN0_RX2_ID 0x4000a0e4u
#define CYREG_CAN0_RX2_DH 0x4000a0e8u
#define CYREG_CAN0_RX2_DL 0x4000a0ecu
#define CYREG_CAN0_RX2_AMR 0x4000a0f0u
#define CYREG_CAN0_RX2_ACR 0x4000a0f4u
#define CYREG_CAN0_RX2_AMRD 0x4000a0f8u
#define CYREG_CAN0_RX2_ACRD 0x4000a0fcu
#define CYDEV_CAN0_RX3_BASE 0x4000a100u
#define CYDEV_CAN0_RX3_SIZE 0x00000020u
#define CYREG_CAN0_RX3_CMD 0x4000a100u
#define CYREG_CAN0_RX3_ID 0x4000a104u
#define CYREG_CAN0_RX3_DH 0x4000a108u
#define CYREG_CAN0_RX3_DL 0x4000a10cu
#define CYREG_CAN0_RX3_AMR 0x4000a110u
#define CYREG_CAN0_RX3_ACR 0x4000a114u
#define CYREG_CAN0_RX3_AMRD 0x4000a118u
#define CYREG_CAN0_RX3_ACRD 0x4000a11cu
#define CYDEV_CAN0_RX4_BASE 0x4000a120u
#define CYDEV_CAN0_RX4_SIZE 0x00000020u
#define CYREG_CAN0_RX4_CMD 0x4000a120u
#define CYREG_CAN0_RX4_ID 0x4000a124u
#define CYREG_CAN0_RX4_DH 0x4000a128u
#define CYREG_CAN0_RX4_DL 0x4000a12cu
#define CYREG_CAN0_RX4_AMR 0x4000a130u
#define CYREG_CAN0_RX4_ACR 0x4000a134u
#define CYREG_CAN0_RX4_AMRD 0x4000a138u
#define CYREG_CAN0_RX4_ACRD 0x4000a13cu
#define CYDEV_CAN0_RX5_BASE 0x4000a140u
#define CYDEV_CAN0_RX5_SIZE 0x00000020u
#define CYREG_CAN0_RX5_CMD 0x4000a140u
#define CYREG_CAN0_RX5_ID 0x4000a144u
#define CYREG_CAN0_RX5_DH 0x4000a148u
#define CYREG_CAN0_RX5_DL 0x4000a14cu
#define CYREG_CAN0_RX5_AMR 0x4000a150u
#define CYREG_CAN0_RX5_ACR 0x4000a154u
#define CYREG_CAN0_RX5_AMRD 0x4000a158u
#define CYREG_CAN0_RX5_ACRD 0x4000a15cu
#define CYDEV_CAN0_RX6_BASE 0x4000a160u
#define CYDEV_CAN0_RX6_SIZE 0x00000020u
#define CYREG_CAN0_RX6_CMD 0x4000a160u
#define CYREG_CAN0_RX6_ID 0x4000a164u
#define CYREG_CAN0_RX6_DH 0x4000a168u
#define CYREG_CAN0_RX6_DL 0x4000a16cu
#define CYREG_CAN0_RX6_AMR 0x4000a170u
#define CYREG_CAN0_RX6_ACR 0x4000a174u
#define CYREG_CAN0_RX6_AMRD 0x4000a178u
#define CYREG_CAN0_RX6_ACRD 0x4000a17cu
#define CYDEV_CAN0_RX7_BASE 0x4000a180u
#define CYDEV_CAN0_RX7_SIZE 0x00000020u
#define CYREG_CAN0_RX7_CMD 0x4000a180u
#define CYREG_CAN0_RX7_ID 0x4000a184u
#define CYREG_CAN0_RX7_DH 0x4000a188u
#define CYREG_CAN0_RX7_DL 0x4000a18cu
#define CYREG_CAN0_RX7_AMR 0x4000a190u
#define CYREG_CAN0_RX7_ACR 0x4000a194u
#define CYREG_CAN0_RX7_AMRD 0x4000a198u
#define CYREG_CAN0_RX7_ACRD 0x4000a19cu
#define CYDEV_CAN0_RX8_BASE 0x4000a1a0u
#define CYDEV_CAN0_RX8_SIZE 0x00000020u
#define CYREG_CAN0_RX8_CMD 0x4000a1a0u
#define CYREG_CAN0_RX8_ID 0x4000a1a4u
#define CYREG_CAN0_RX8_DH 0x4000a1a8u
#define CYREG_CAN0_RX8_DL 0x4000a1acu
#define CYREG_CAN0_RX8_AMR 0x4000a1b0u
#define CYREG_CAN0_RX8_ACR 0x4000a1b4u
#define CYREG_CAN0_RX8_AMRD 0x4000a1b8u
#define CYREG_CAN0_RX8_ACRD 0x4000a1bcu
#define CYDEV_CAN0_RX9_BASE 0x4000a1c0u
#define CYDEV_CAN0_RX9_SIZE 0x00000020u
#define CYREG_CAN0_RX9_CMD 0x4000a1c0u
#define CYREG_CAN0_RX9_ID 0x4000a1c4u
#define CYREG_CAN0_RX9_DH 0x4000a1c8u
#define CYREG_CAN0_RX9_DL 0x4000a1ccu
#define CYREG_CAN0_RX9_AMR 0x4000a1d0u
#define CYREG_CAN0_RX9_ACR 0x4000a1d4u
#define CYREG_CAN0_RX9_AMRD 0x4000a1d8u
#define CYREG_CAN0_RX9_ACRD 0x4000a1dcu
#define CYDEV_CAN0_RX10_BASE 0x4000a1e0u
#define CYDEV_CAN0_RX10_SIZE 0x00000020u
#define CYREG_CAN0_RX10_CMD 0x4000a1e0u
#define CYREG_CAN0_RX10_ID 0x4000a1e4u
#define CYREG_CAN0_RX10_DH 0x4000a1e8u
#define CYREG_CAN0_RX10_DL 0x4000a1ecu
#define CYREG_CAN0_RX10_AMR 0x4000a1f0u
#define CYREG_CAN0_RX10_ACR 0x4000a1f4u
#define CYREG_CAN0_RX10_AMRD 0x4000a1f8u
#define CYREG_CAN0_RX10_ACRD 0x4000a1fcu
#define CYDEV_CAN0_RX11_BASE 0x4000a200u
#define CYDEV_CAN0_RX11_SIZE 0x00000020u
#define CYREG_CAN0_RX11_CMD 0x4000a200u
#define CYREG_CAN0_RX11_ID 0x4000a204u
#define CYREG_CAN0_RX11_DH 0x4000a208u
#define CYREG_CAN0_RX11_DL 0x4000a20cu
#define CYREG_CAN0_RX11_AMR 0x4000a210u
#define CYREG_CAN0_RX11_ACR 0x4000a214u
#define CYREG_CAN0_RX11_AMRD 0x4000a218u
#define CYREG_CAN0_RX11_ACRD 0x4000a21cu
#define CYDEV_CAN0_RX12_BASE 0x4000a220u
#define CYDEV_CAN0_RX12_SIZE 0x00000020u
#define CYREG_CAN0_RX12_CMD 0x4000a220u
#define CYREG_CAN0_RX12_ID 0x4000a224u
#define CYREG_CAN0_RX12_DH 0x4000a228u
#define CYREG_CAN0_RX12_DL 0x4000a22cu
#define CYREG_CAN0_RX12_AMR 0x4000a230u
#define CYREG_CAN0_RX12_ACR 0x4000a234u
#define CYREG_CAN0_RX12_AMRD 0x4000a238u
#define CYREG_CAN0_RX12_ACRD 0x4000a23cu
#define CYDEV_CAN0_RX13_BASE 0x4000a240u
#define CYDEV_CAN0_RX13_SIZE 0x00000020u
#define CYREG_CAN0_RX13_CMD 0x4000a240u
#define CYREG_CAN0_RX13_ID 0x4000a244u
#define CYREG_CAN0_RX13_DH 0x4000a248u
#define CYREG_CAN0_RX13_DL 0x4000a24cu
#define CYREG_CAN0_RX13_AMR 0x4000a250u
#define CYREG_CAN0_RX13_ACR 0x4000a254u
#define CYREG_CAN0_RX13_AMRD 0x4000a258u
#define CYREG_CAN0_RX13_ACRD 0x4000a25cu
#define CYDEV_CAN0_RX14_BASE 0x4000a260u
#define CYDEV_CAN0_RX14_SIZE 0x00000020u
#define CYREG_CAN0_RX14_CMD 0x4000a260u
#define CYREG_CAN0_RX14_ID 0x4000a264u
#define CYREG_CAN0_RX14_DH 0x4000a268u
#define CYREG_CAN0_RX14_DL 0x4000a26cu
#define CYREG_CAN0_RX14_AMR 0x4000a270u
#define CYREG_CAN0_RX14_ACR 0x4000a274u
#define CYREG_CAN0_RX14_AMRD 0x4000a278u
#define CYREG_CAN0_RX14_ACRD 0x4000a27cu
#define CYDEV_CAN0_RX15_BASE 0x4000a280u
#define CYDEV_CAN0_RX15_SIZE 0x00000020u
#define CYREG_CAN0_RX15_CMD 0x4000a280u
#define CYREG_CAN0_RX15_ID 0x4000a284u
#define CYREG_CAN0_RX15_DH 0x4000a288u
#define CYREG_CAN0_RX15_DL 0x4000a28cu
#define CYREG_CAN0_RX15_AMR 0x4000a290u
#define CYREG_CAN0_RX15_ACR 0x4000a294u
#define CYREG_CAN0_RX15_AMRD 0x4000a298u
#define CYREG_CAN0_RX15_ACRD 0x4000a29cu
#define CYDEV_DFB0_BASE 0x4000c000u
#define CYDEV_DFB0_SIZE 0x000007b5u
#define CYDEV_DFB0_DPA_SRAM_BASE 0x4000c000u
#define CYDEV_DFB0_DPA_SRAM_SIZE 0x00000200u
#define CYREG_DFB0_DPA_SRAM_DATA_MBASE 0x4000c000u
#define CYREG_DFB0_DPA_SRAM_DATA_MSIZE 0x00000200u
#define CYDEV_DFB0_DPB_SRAM_BASE 0x4000c200u
#define CYDEV_DFB0_DPB_SRAM_SIZE 0x00000200u
#define CYREG_DFB0_DPB_SRAM_DATA_MBASE 0x4000c200u
#define CYREG_DFB0_DPB_SRAM_DATA_MSIZE 0x00000200u
#define CYDEV_DFB0_CSA_SRAM_BASE 0x4000c400u
#define CYDEV_DFB0_CSA_SRAM_SIZE 0x00000100u
#define CYREG_DFB0_CSA_SRAM_DATA_MBASE 0x4000c400u
#define CYREG_DFB0_CSA_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_CSB_SRAM_BASE 0x4000c500u
#define CYDEV_DFB0_CSB_SRAM_SIZE 0x00000100u
#define CYREG_DFB0_CSB_SRAM_DATA_MBASE 0x4000c500u
#define CYREG_DFB0_CSB_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_FSM_SRAM_BASE 0x4000c600u
#define CYDEV_DFB0_FSM_SRAM_SIZE 0x00000100u
#define CYREG_DFB0_FSM_SRAM_DATA_MBASE 0x4000c600u
#define CYREG_DFB0_FSM_SRAM_DATA_MSIZE 0x00000100u
#define CYDEV_DFB0_ACU_SRAM_BASE 0x4000c700u
#define CYDEV_DFB0_ACU_SRAM_SIZE 0x00000040u
#define CYREG_DFB0_ACU_SRAM_DATA_MBASE 0x4000c700u
#define CYREG_DFB0_ACU_SRAM_DATA_MSIZE 0x00000040u
#define CYREG_DFB0_CR 0x4000c780u
#define CYREG_DFB0_SR 0x4000c784u
#define CYREG_DFB0_RAM_EN 0x4000c788u
#define CYREG_DFB0_RAM_DIR 0x4000c78cu
#define CYREG_DFB0_SEMA 0x4000c790u
#define CYREG_DFB0_DSI_CTRL 0x4000c794u
#define CYREG_DFB0_INT_CTRL 0x4000c798u
#define CYREG_DFB0_DMA_CTRL 0x4000c79cu
#define CYREG_DFB0_STAGEA 0x4000c7a0u
#define CYREG_DFB0_STAGEAM 0x4000c7a1u
#define CYREG_DFB0_STAGEAH 0x4000c7a2u
#define CYREG_DFB0_STAGEB 0x4000c7a4u
#define CYREG_DFB0_STAGEBM 0x4000c7a5u
#define CYREG_DFB0_STAGEBH 0x4000c7a6u
#define CYREG_DFB0_HOLDA 0x4000c7a8u
#define CYREG_DFB0_HOLDAM 0x4000c7a9u
#define CYREG_DFB0_HOLDAH 0x4000c7aau
#define CYREG_DFB0_HOLDAS 0x4000c7abu
#define CYREG_DFB0_HOLDB 0x4000c7acu
#define CYREG_DFB0_HOLDBM 0x4000c7adu
#define CYREG_DFB0_HOLDBH 0x4000c7aeu
#define CYREG_DFB0_HOLDBS 0x4000c7afu
#define CYREG_DFB0_COHER 0x4000c7b0u
#define CYREG_DFB0_DALIGN 0x4000c7b4u
#define CYDEV_UCFG_BASE 0x40010000u
#define CYDEV_UCFG_SIZE 0x00005040u
#define CYDEV_UCFG_B0_BASE 0x40010000u
#define CYDEV_UCFG_B0_SIZE 0x00000fefu
#define CYDEV_UCFG_B0_P0_BASE 0x40010000u
#define CYDEV_UCFG_B0_P0_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P0_U0_BASE 0x40010000u
#define CYDEV_UCFG_B0_P0_U0_SIZE 0x00000070u
#define CYREG_B0_P0_U0_PLD_IT0 0x40010000u
#define CYREG_B0_P0_U0_PLD_IT1 0x40010004u
#define CYREG_B0_P0_U0_PLD_IT2 0x40010008u
#define CYREG_B0_P0_U0_PLD_IT3 0x4001000cu
#define CYREG_B0_P0_U0_PLD_IT4 0x40010010u
#define CYREG_B0_P0_U0_PLD_IT5 0x40010014u
#define CYREG_B0_P0_U0_PLD_IT6 0x40010018u
#define CYREG_B0_P0_U0_PLD_IT7 0x4001001cu
#define CYREG_B0_P0_U0_PLD_IT8 0x40010020u
#define CYREG_B0_P0_U0_PLD_IT9 0x40010024u
#define CYREG_B0_P0_U0_PLD_IT10 0x40010028u
#define CYREG_B0_P0_U0_PLD_IT11 0x4001002cu
#define CYREG_B0_P0_U0_PLD_ORT0 0x40010030u
#define CYREG_B0_P0_U0_PLD_ORT1 0x40010032u
#define CYREG_B0_P0_U0_PLD_ORT2 0x40010034u
#define CYREG_B0_P0_U0_PLD_ORT3 0x40010036u
#define CYREG_B0_P0_U0_MC_CFG_CEN_CONST 0x40010038u
#define CYREG_B0_P0_U0_MC_CFG_XORFB 0x4001003au
#define CYREG_B0_P0_U0_MC_CFG_SET_RESET 0x4001003cu
#define CYREG_B0_P0_U0_MC_CFG_BYPASS 0x4001003eu
#define CYREG_B0_P0_U0_CFG0 0x40010040u
#define CYREG_B0_P0_U0_CFG1 0x40010041u
#define CYREG_B0_P0_U0_CFG2 0x40010042u
#define CYREG_B0_P0_U0_CFG3 0x40010043u
#define CYREG_B0_P0_U0_CFG4 0x40010044u
#define CYREG_B0_P0_U0_CFG5 0x40010045u
#define CYREG_B0_P0_U0_CFG6 0x40010046u
#define CYREG_B0_P0_U0_CFG7 0x40010047u
#define CYREG_B0_P0_U0_CFG8 0x40010048u
#define CYREG_B0_P0_U0_CFG9 0x40010049u
#define CYREG_B0_P0_U0_CFG10 0x4001004au
#define CYREG_B0_P0_U0_CFG11 0x4001004bu
#define CYREG_B0_P0_U0_CFG12 0x4001004cu
#define CYREG_B0_P0_U0_CFG13 0x4001004du
#define CYREG_B0_P0_U0_CFG14 0x4001004eu
#define CYREG_B0_P0_U0_CFG15 0x4001004fu
#define CYREG_B0_P0_U0_CFG16 0x40010050u
#define CYREG_B0_P0_U0_CFG20 0x40010054u
#define CYREG_B0_P0_U0_CFG21 0x40010055u
#define CYREG_B0_P0_U0_CFG22 0x40010056u
#define CYREG_B0_P0_U0_CFG23 0x40010057u
#define CYREG_B0_P0_U0_CFG24 0x40010058u
#define CYREG_B0_P0_U0_CFG25 0x40010059u
#define CYREG_B0_P0_U0_CFG26 0x4001005au
#define CYREG_B0_P0_U0_CFG27 0x4001005bu
#define CYREG_B0_P0_U0_CFG28 0x4001005cu
#define CYREG_B0_P0_U0_CFG29 0x4001005du
#define CYREG_B0_P0_U0_CFG30 0x4001005eu
#define CYREG_B0_P0_U0_CFG31 0x4001005fu
#define CYREG_B0_P0_U0_DCFG0 0x40010060u
#define CYREG_B0_P0_U0_DCFG1 0x40010062u
#define CYREG_B0_P0_U0_DCFG2 0x40010064u
#define CYREG_B0_P0_U0_DCFG3 0x40010066u
#define CYREG_B0_P0_U0_DCFG4 0x40010068u
#define CYREG_B0_P0_U0_DCFG5 0x4001006au
#define CYREG_B0_P0_U0_DCFG6 0x4001006cu
#define CYREG_B0_P0_U0_DCFG7 0x4001006eu
#define CYDEV_UCFG_B0_P0_U1_BASE 0x40010080u
#define CYDEV_UCFG_B0_P0_U1_SIZE 0x00000070u
#define CYREG_B0_P0_U1_PLD_IT0 0x40010080u
#define CYREG_B0_P0_U1_PLD_IT1 0x40010084u
#define CYREG_B0_P0_U1_PLD_IT2 0x40010088u
#define CYREG_B0_P0_U1_PLD_IT3 0x4001008cu
#define CYREG_B0_P0_U1_PLD_IT4 0x40010090u
#define CYREG_B0_P0_U1_PLD_IT5 0x40010094u
#define CYREG_B0_P0_U1_PLD_IT6 0x40010098u
#define CYREG_B0_P0_U1_PLD_IT7 0x4001009cu
#define CYREG_B0_P0_U1_PLD_IT8 0x400100a0u
#define CYREG_B0_P0_U1_PLD_IT9 0x400100a4u
#define CYREG_B0_P0_U1_PLD_IT10 0x400100a8u
#define CYREG_B0_P0_U1_PLD_IT11 0x400100acu
#define CYREG_B0_P0_U1_PLD_ORT0 0x400100b0u
#define CYREG_B0_P0_U1_PLD_ORT1 0x400100b2u
#define CYREG_B0_P0_U1_PLD_ORT2 0x400100b4u
#define CYREG_B0_P0_U1_PLD_ORT3 0x400100b6u
#define CYREG_B0_P0_U1_MC_CFG_CEN_CONST 0x400100b8u
#define CYREG_B0_P0_U1_MC_CFG_XORFB 0x400100bau
#define CYREG_B0_P0_U1_MC_CFG_SET_RESET 0x400100bcu
#define CYREG_B0_P0_U1_MC_CFG_BYPASS 0x400100beu
#define CYREG_B0_P0_U1_CFG0 0x400100c0u
#define CYREG_B0_P0_U1_CFG1 0x400100c1u
#define CYREG_B0_P0_U1_CFG2 0x400100c2u
#define CYREG_B0_P0_U1_CFG3 0x400100c3u
#define CYREG_B0_P0_U1_CFG4 0x400100c4u
#define CYREG_B0_P0_U1_CFG5 0x400100c5u
#define CYREG_B0_P0_U1_CFG6 0x400100c6u
#define CYREG_B0_P0_U1_CFG7 0x400100c7u
#define CYREG_B0_P0_U1_CFG8 0x400100c8u
#define CYREG_B0_P0_U1_CFG9 0x400100c9u
#define CYREG_B0_P0_U1_CFG10 0x400100cau
#define CYREG_B0_P0_U1_CFG11 0x400100cbu
#define CYREG_B0_P0_U1_CFG12 0x400100ccu
#define CYREG_B0_P0_U1_CFG13 0x400100cdu
#define CYREG_B0_P0_U1_CFG14 0x400100ceu
#define CYREG_B0_P0_U1_CFG15 0x400100cfu
#define CYREG_B0_P0_U1_CFG16 0x400100d0u
#define CYREG_B0_P0_U1_CFG20 0x400100d4u
#define CYREG_B0_P0_U1_CFG21 0x400100d5u
#define CYREG_B0_P0_U1_CFG22 0x400100d6u
#define CYREG_B0_P0_U1_CFG23 0x400100d7u
#define CYREG_B0_P0_U1_CFG24 0x400100d8u
#define CYREG_B0_P0_U1_CFG25 0x400100d9u
#define CYREG_B0_P0_U1_CFG26 0x400100dau
#define CYREG_B0_P0_U1_CFG27 0x400100dbu
#define CYREG_B0_P0_U1_CFG28 0x400100dcu
#define CYREG_B0_P0_U1_CFG29 0x400100ddu
#define CYREG_B0_P0_U1_CFG30 0x400100deu
#define CYREG_B0_P0_U1_CFG31 0x400100dfu
#define CYREG_B0_P0_U1_DCFG0 0x400100e0u
#define CYREG_B0_P0_U1_DCFG1 0x400100e2u
#define CYREG_B0_P0_U1_DCFG2 0x400100e4u
#define CYREG_B0_P0_U1_DCFG3 0x400100e6u
#define CYREG_B0_P0_U1_DCFG4 0x400100e8u
#define CYREG_B0_P0_U1_DCFG5 0x400100eau
#define CYREG_B0_P0_U1_DCFG6 0x400100ecu
#define CYREG_B0_P0_U1_DCFG7 0x400100eeu
#define CYDEV_UCFG_B0_P0_ROUTE_BASE 0x40010100u
#define CYDEV_UCFG_B0_P0_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P1_BASE 0x40010200u
#define CYDEV_UCFG_B0_P1_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P1_U0_BASE 0x40010200u
#define CYDEV_UCFG_B0_P1_U0_SIZE 0x00000070u
#define CYREG_B0_P1_U0_PLD_IT0 0x40010200u
#define CYREG_B0_P1_U0_PLD_IT1 0x40010204u
#define CYREG_B0_P1_U0_PLD_IT2 0x40010208u
#define CYREG_B0_P1_U0_PLD_IT3 0x4001020cu
#define CYREG_B0_P1_U0_PLD_IT4 0x40010210u
#define CYREG_B0_P1_U0_PLD_IT5 0x40010214u
#define CYREG_B0_P1_U0_PLD_IT6 0x40010218u
#define CYREG_B0_P1_U0_PLD_IT7 0x4001021cu
