MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYREG_B0_P1_U0_PLD_IT8 0x40010220u
#define CYREG_B0_P1_U0_PLD_IT9 0x40010224u
#define CYREG_B0_P1_U0_PLD_IT10 0x40010228u
#define CYREG_B0_P1_U0_PLD_IT11 0x4001022cu
#define CYREG_B0_P1_U0_PLD_ORT0 0x40010230u
#define CYREG_B0_P1_U0_PLD_ORT1 0x40010232u
#define CYREG_B0_P1_U0_PLD_ORT2 0x40010234u
#define CYREG_B0_P1_U0_PLD_ORT3 0x40010236u
#define CYREG_B0_P1_U0_MC_CFG_CEN_CONST 0x40010238u
#define CYREG_B0_P1_U0_MC_CFG_XORFB 0x4001023au
#define CYREG_B0_P1_U0_MC_CFG_SET_RESET 0x4001023cu
#define CYREG_B0_P1_U0_MC_CFG_BYPASS 0x4001023eu
#define CYREG_B0_P1_U0_CFG0 0x40010240u
#define CYREG_B0_P1_U0_CFG1 0x40010241u
#define CYREG_B0_P1_U0_CFG2 0x40010242u
#define CYREG_B0_P1_U0_CFG3 0x40010243u
#define CYREG_B0_P1_U0_CFG4 0x40010244u
#define CYREG_B0_P1_U0_CFG5 0x40010245u
#define CYREG_B0_P1_U0_CFG6 0x40010246u
#define CYREG_B0_P1_U0_CFG7 0x40010247u
#define CYREG_B0_P1_U0_CFG8 0x40010248u
#define CYREG_B0_P1_U0_CFG9 0x40010249u
#define CYREG_B0_P1_U0_CFG10 0x4001024au
#define CYREG_B0_P1_U0_CFG11 0x4001024bu
#define CYREG_B0_P1_U0_CFG12 0x4001024cu
#define CYREG_B0_P1_U0_CFG13 0x4001024du
#define CYREG_B0_P1_U0_CFG14 0x4001024eu
#define CYREG_B0_P1_U0_CFG15 0x4001024fu
#define CYREG_B0_P1_U0_CFG16 0x40010250u
#define CYREG_B0_P1_U0_CFG20 0x40010254u
#define CYREG_B0_P1_U0_CFG21 0x40010255u
#define CYREG_B0_P1_U0_CFG22 0x40010256u
#define CYREG_B0_P1_U0_CFG23 0x40010257u
#define CYREG_B0_P1_U0_CFG24 0x40010258u
#define CYREG_B0_P1_U0_CFG25 0x40010259u
#define CYREG_B0_P1_U0_CFG26 0x4001025au
#define CYREG_B0_P1_U0_CFG27 0x4001025bu
#define CYREG_B0_P1_U0_CFG28 0x4001025cu
#define CYREG_B0_P1_U0_CFG29 0x4001025du
#define CYREG_B0_P1_U0_CFG30 0x4001025eu
#define CYREG_B0_P1_U0_CFG31 0x4001025fu
#define CYREG_B0_P1_U0_DCFG0 0x40010260u
#define CYREG_B0_P1_U0_DCFG1 0x40010262u
#define CYREG_B0_P1_U0_DCFG2 0x40010264u
#define CYREG_B0_P1_U0_DCFG3 0x40010266u
#define CYREG_B0_P1_U0_DCFG4 0x40010268u
#define CYREG_B0_P1_U0_DCFG5 0x4001026au
#define CYREG_B0_P1_U0_DCFG6 0x4001026cu
#define CYREG_B0_P1_U0_DCFG7 0x4001026eu
#define CYDEV_UCFG_B0_P1_U1_BASE 0x40010280u
#define CYDEV_UCFG_B0_P1_U1_SIZE 0x00000070u
#define CYREG_B0_P1_U1_PLD_IT0 0x40010280u
#define CYREG_B0_P1_U1_PLD_IT1 0x40010284u
#define CYREG_B0_P1_U1_PLD_IT2 0x40010288u
#define CYREG_B0_P1_U1_PLD_IT3 0x4001028cu
#define CYREG_B0_P1_U1_PLD_IT4 0x40010290u
#define CYREG_B0_P1_U1_PLD_IT5 0x40010294u
#define CYREG_B0_P1_U1_PLD_IT6 0x40010298u
#define CYREG_B0_P1_U1_PLD_IT7 0x4001029cu
#define CYREG_B0_P1_U1_PLD_IT8 0x400102a0u
#define CYREG_B0_P1_U1_PLD_IT9 0x400102a4u
#define CYREG_B0_P1_U1_PLD_IT10 0x400102a8u
#define CYREG_B0_P1_U1_PLD_IT11 0x400102acu
#define CYREG_B0_P1_U1_PLD_ORT0 0x400102b0u
#define CYREG_B0_P1_U1_PLD_ORT1 0x400102b2u
#define CYREG_B0_P1_U1_PLD_ORT2 0x400102b4u
#define CYREG_B0_P1_U1_PLD_ORT3 0x400102b6u
#define CYREG_B0_P1_U1_MC_CFG_CEN_CONST 0x400102b8u
#define CYREG_B0_P1_U1_MC_CFG_XORFB 0x400102bau
#define CYREG_B0_P1_U1_MC_CFG_SET_RESET 0x400102bcu
#define CYREG_B0_P1_U1_MC_CFG_BYPASS 0x400102beu
#define CYREG_B0_P1_U1_CFG0 0x400102c0u
#define CYREG_B0_P1_U1_CFG1 0x400102c1u
#define CYREG_B0_P1_U1_CFG2 0x400102c2u
#define CYREG_B0_P1_U1_CFG3 0x400102c3u
#define CYREG_B0_P1_U1_CFG4 0x400102c4u
#define CYREG_B0_P1_U1_CFG5 0x400102c5u
#define CYREG_B0_P1_U1_CFG6 0x400102c6u
#define CYREG_B0_P1_U1_CFG7 0x400102c7u
#define CYREG_B0_P1_U1_CFG8 0x400102c8u
#define CYREG_B0_P1_U1_CFG9 0x400102c9u
#define CYREG_B0_P1_U1_CFG10 0x400102cau
#define CYREG_B0_P1_U1_CFG11 0x400102cbu
#define CYREG_B0_P1_U1_CFG12 0x400102ccu
#define CYREG_B0_P1_U1_CFG13 0x400102cdu
#define CYREG_B0_P1_U1_CFG14 0x400102ceu
#define CYREG_B0_P1_U1_CFG15 0x400102cfu
#define CYREG_B0_P1_U1_CFG16 0x400102d0u
#define CYREG_B0_P1_U1_CFG20 0x400102d4u
#define CYREG_B0_P1_U1_CFG21 0x400102d5u
#define CYREG_B0_P1_U1_CFG22 0x400102d6u
#define CYREG_B0_P1_U1_CFG23 0x400102d7u
#define CYREG_B0_P1_U1_CFG24 0x400102d8u
#define CYREG_B0_P1_U1_CFG25 0x400102d9u
#define CYREG_B0_P1_U1_CFG26 0x400102dau
#define CYREG_B0_P1_U1_CFG27 0x400102dbu
#define CYREG_B0_P1_U1_CFG28 0x400102dcu
#define CYREG_B0_P1_U1_CFG29 0x400102ddu
#define CYREG_B0_P1_U1_CFG30 0x400102deu
#define CYREG_B0_P1_U1_CFG31 0x400102dfu
#define CYREG_B0_P1_U1_DCFG0 0x400102e0u
#define CYREG_B0_P1_U1_DCFG1 0x400102e2u
#define CYREG_B0_P1_U1_DCFG2 0x400102e4u
#define CYREG_B0_P1_U1_DCFG3 0x400102e6u
#define CYREG_B0_P1_U1_DCFG4 0x400102e8u
#define CYREG_B0_P1_U1_DCFG5 0x400102eau
#define CYREG_B0_P1_U1_DCFG6 0x400102ecu
#define CYREG_B0_P1_U1_DCFG7 0x400102eeu
#define CYDEV_UCFG_B0_P1_ROUTE_BASE 0x40010300u
#define CYDEV_UCFG_B0_P1_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P2_BASE 0x40010400u
#define CYDEV_UCFG_B0_P2_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P2_U0_BASE 0x40010400u
#define CYDEV_UCFG_B0_P2_U0_SIZE 0x00000070u
#define CYREG_B0_P2_U0_PLD_IT0 0x40010400u
#define CYREG_B0_P2_U0_PLD_IT1 0x40010404u
#define CYREG_B0_P2_U0_PLD_IT2 0x40010408u
#define CYREG_B0_P2_U0_PLD_IT3 0x4001040cu
#define CYREG_B0_P2_U0_PLD_IT4 0x40010410u
#define CYREG_B0_P2_U0_PLD_IT5 0x40010414u
#define CYREG_B0_P2_U0_PLD_IT6 0x40010418u
#define CYREG_B0_P2_U0_PLD_IT7 0x4001041cu
#define CYREG_B0_P2_U0_PLD_IT8 0x40010420u
#define CYREG_B0_P2_U0_PLD_IT9 0x40010424u
#define CYREG_B0_P2_U0_PLD_IT10 0x40010428u
#define CYREG_B0_P2_U0_PLD_IT11 0x4001042cu
#define CYREG_B0_P2_U0_PLD_ORT0 0x40010430u
#define CYREG_B0_P2_U0_PLD_ORT1 0x40010432u
#define CYREG_B0_P2_U0_PLD_ORT2 0x40010434u
#define CYREG_B0_P2_U0_PLD_ORT3 0x40010436u
#define CYREG_B0_P2_U0_MC_CFG_CEN_CONST 0x40010438u
#define CYREG_B0_P2_U0_MC_CFG_XORFB 0x4001043au
#define CYREG_B0_P2_U0_MC_CFG_SET_RESET 0x4001043cu
#define CYREG_B0_P2_U0_MC_CFG_BYPASS 0x4001043eu
#define CYREG_B0_P2_U0_CFG0 0x40010440u
#define CYREG_B0_P2_U0_CFG1 0x40010441u
#define CYREG_B0_P2_U0_CFG2 0x40010442u
#define CYREG_B0_P2_U0_CFG3 0x40010443u
#define CYREG_B0_P2_U0_CFG4 0x40010444u
#define CYREG_B0_P2_U0_CFG5 0x40010445u
#define CYREG_B0_P2_U0_CFG6 0x40010446u
#define CYREG_B0_P2_U0_CFG7 0x40010447u
#define CYREG_B0_P2_U0_CFG8 0x40010448u
#define CYREG_B0_P2_U0_CFG9 0x40010449u
#define CYREG_B0_P2_U0_CFG10 0x4001044au
#define CYREG_B0_P2_U0_CFG11 0x4001044bu
#define CYREG_B0_P2_U0_CFG12 0x4001044cu
#define CYREG_B0_P2_U0_CFG13 0x4001044du
#define CYREG_B0_P2_U0_CFG14 0x4001044eu
#define CYREG_B0_P2_U0_CFG15 0x4001044fu
#define CYREG_B0_P2_U0_CFG16 0x40010450u
#define CYREG_B0_P2_U0_CFG20 0x40010454u
#define CYREG_B0_P2_U0_CFG21 0x40010455u
#define CYREG_B0_P2_U0_CFG22 0x40010456u
#define CYREG_B0_P2_U0_CFG23 0x40010457u
#define CYREG_B0_P2_U0_CFG24 0x40010458u
#define CYREG_B0_P2_U0_CFG25 0x40010459u
#define CYREG_B0_P2_U0_CFG26 0x4001045au
#define CYREG_B0_P2_U0_CFG27 0x4001045bu
#define CYREG_B0_P2_U0_CFG28 0x4001045cu
#define CYREG_B0_P2_U0_CFG29 0x4001045du
#define CYREG_B0_P2_U0_CFG30 0x4001045eu
#define CYREG_B0_P2_U0_CFG31 0x4001045fu
#define CYREG_B0_P2_U0_DCFG0 0x40010460u
#define CYREG_B0_P2_U0_DCFG1 0x40010462u
#define CYREG_B0_P2_U0_DCFG2 0x40010464u
#define CYREG_B0_P2_U0_DCFG3 0x40010466u
#define CYREG_B0_P2_U0_DCFG4 0x40010468u
#define CYREG_B0_P2_U0_DCFG5 0x4001046au
#define CYREG_B0_P2_U0_DCFG6 0x4001046cu
#define CYREG_B0_P2_U0_DCFG7 0x4001046eu
#define CYDEV_UCFG_B0_P2_U1_BASE 0x40010480u
#define CYDEV_UCFG_B0_P2_U1_SIZE 0x00000070u
#define CYREG_B0_P2_U1_PLD_IT0 0x40010480u
#define CYREG_B0_P2_U1_PLD_IT1 0x40010484u
#define CYREG_B0_P2_U1_PLD_IT2 0x40010488u
#define CYREG_B0_P2_U1_PLD_IT3 0x4001048cu
#define CYREG_B0_P2_U1_PLD_IT4 0x40010490u
#define CYREG_B0_P2_U1_PLD_IT5 0x40010494u
#define CYREG_B0_P2_U1_PLD_IT6 0x40010498u
#define CYREG_B0_P2_U1_PLD_IT7 0x4001049cu
#define CYREG_B0_P2_U1_PLD_IT8 0x400104a0u
#define CYREG_B0_P2_U1_PLD_IT9 0x400104a4u
#define CYREG_B0_P2_U1_PLD_IT10 0x400104a8u
#define CYREG_B0_P2_U1_PLD_IT11 0x400104acu
#define CYREG_B0_P2_U1_PLD_ORT0 0x400104b0u
#define CYREG_B0_P2_U1_PLD_ORT1 0x400104b2u
#define CYREG_B0_P2_U1_PLD_ORT2 0x400104b4u
#define CYREG_B0_P2_U1_PLD_ORT3 0x400104b6u
#define CYREG_B0_P2_U1_MC_CFG_CEN_CONST 0x400104b8u
#define CYREG_B0_P2_U1_MC_CFG_XORFB 0x400104bau
#define CYREG_B0_P2_U1_MC_CFG_SET_RESET 0x400104bcu
#define CYREG_B0_P2_U1_MC_CFG_BYPASS 0x400104beu
#define CYREG_B0_P2_U1_CFG0 0x400104c0u
#define CYREG_B0_P2_U1_CFG1 0x400104c1u
#define CYREG_B0_P2_U1_CFG2 0x400104c2u
#define CYREG_B0_P2_U1_CFG3 0x400104c3u
#define CYREG_B0_P2_U1_CFG4 0x400104c4u
#define CYREG_B0_P2_U1_CFG5 0x400104c5u
#define CYREG_B0_P2_U1_CFG6 0x400104c6u
#define CYREG_B0_P2_U1_CFG7 0x400104c7u
#define CYREG_B0_P2_U1_CFG8 0x400104c8u
#define CYREG_B0_P2_U1_CFG9 0x400104c9u
#define CYREG_B0_P2_U1_CFG10 0x400104cau
#define CYREG_B0_P2_U1_CFG11 0x400104cbu
#define CYREG_B0_P2_U1_CFG12 0x400104ccu
#define CYREG_B0_P2_U1_CFG13 0x400104cdu
#define CYREG_B0_P2_U1_CFG14 0x400104ceu
#define CYREG_B0_P2_U1_CFG15 0x400104cfu
#define CYREG_B0_P2_U1_CFG16 0x400104d0u
#define CYREG_B0_P2_U1_CFG20 0x400104d4u
#define CYREG_B0_P2_U1_CFG21 0x400104d5u
#define CYREG_B0_P2_U1_CFG22 0x400104d6u
#define CYREG_B0_P2_U1_CFG23 0x400104d7u
#define CYREG_B0_P2_U1_CFG24 0x400104d8u
#define CYREG_B0_P2_U1_CFG25 0x400104d9u
#define CYREG_B0_P2_U1_CFG26 0x400104dau
#define CYREG_B0_P2_U1_CFG27 0x400104dbu
#define CYREG_B0_P2_U1_CFG28 0x400104dcu
#define CYREG_B0_P2_U1_CFG29 0x400104ddu
#define CYREG_B0_P2_U1_CFG30 0x400104deu
#define CYREG_B0_P2_U1_CFG31 0x400104dfu
#define CYREG_B0_P2_U1_DCFG0 0x400104e0u
#define CYREG_B0_P2_U1_DCFG1 0x400104e2u
#define CYREG_B0_P2_U1_DCFG2 0x400104e4u
#define CYREG_B0_P2_U1_DCFG3 0x400104e6u
#define CYREG_B0_P2_U1_DCFG4 0x400104e8u
#define CYREG_B0_P2_U1_DCFG5 0x400104eau
#define CYREG_B0_P2_U1_DCFG6 0x400104ecu
#define CYREG_B0_P2_U1_DCFG7 0x400104eeu
#define CYDEV_UCFG_B0_P2_ROUTE_BASE 0x40010500u
#define CYDEV_UCFG_B0_P2_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P3_BASE 0x40010600u
#define CYDEV_UCFG_B0_P3_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P3_U0_BASE 0x40010600u
#define CYDEV_UCFG_B0_P3_U0_SIZE 0x00000070u
#define CYREG_B0_P3_U0_PLD_IT0 0x40010600u
#define CYREG_B0_P3_U0_PLD_IT1 0x40010604u
#define CYREG_B0_P3_U0_PLD_IT2 0x40010608u
#define CYREG_B0_P3_U0_PLD_IT3 0x4001060cu
#define CYREG_B0_P3_U0_PLD_IT4 0x40010610u
#define CYREG_B0_P3_U0_PLD_IT5 0x40010614u
#define CYREG_B0_P3_U0_PLD_IT6 0x40010618u
#define CYREG_B0_P3_U0_PLD_IT7 0x4001061cu
#define CYREG_B0_P3_U0_PLD_IT8 0x40010620u
#define CYREG_B0_P3_U0_PLD_IT9 0x40010624u
#define CYREG_B0_P3_U0_PLD_IT10 0x40010628u
#define CYREG_B0_P3_U0_PLD_IT11 0x4001062cu
#define CYREG_B0_P3_U0_PLD_ORT0 0x40010630u
#define CYREG_B0_P3_U0_PLD_ORT1 0x40010632u
#define CYREG_B0_P3_U0_PLD_ORT2 0x40010634u
#define CYREG_B0_P3_U0_PLD_ORT3 0x40010636u
#define CYREG_B0_P3_U0_MC_CFG_CEN_CONST 0x40010638u
#define CYREG_B0_P3_U0_MC_CFG_XORFB 0x4001063au
#define CYREG_B0_P3_U0_MC_CFG_SET_RESET 0x4001063cu
#define CYREG_B0_P3_U0_MC_CFG_BYPASS 0x4001063eu
#define CYREG_B0_P3_U0_CFG0 0x40010640u
#define CYREG_B0_P3_U0_CFG1 0x40010641u
#define CYREG_B0_P3_U0_CFG2 0x40010642u
#define CYREG_B0_P3_U0_CFG3 0x40010643u
#define CYREG_B0_P3_U0_CFG4 0x40010644u
#define CYREG_B0_P3_U0_CFG5 0x40010645u
#define CYREG_B0_P3_U0_CFG6 0x40010646u
#define CYREG_B0_P3_U0_CFG7 0x40010647u
#define CYREG_B0_P3_U0_CFG8 0x40010648u
#define CYREG_B0_P3_U0_CFG9 0x40010649u
#define CYREG_B0_P3_U0_CFG10 0x4001064au
#define CYREG_B0_P3_U0_CFG11 0x4001064bu
#define CYREG_B0_P3_U0_CFG12 0x4001064cu
#define CYREG_B0_P3_U0_CFG13 0x4001064du
#define CYREG_B0_P3_U0_CFG14 0x4001064eu
#define CYREG_B0_P3_U0_CFG15 0x4001064fu
#define CYREG_B0_P3_U0_CFG16 0x40010650u
#define CYREG_B0_P3_U0_CFG20 0x40010654u
#define CYREG_B0_P3_U0_CFG21 0x40010655u
#define CYREG_B0_P3_U0_CFG22 0x40010656u
#define CYREG_B0_P3_U0_CFG23 0x40010657u
#define CYREG_B0_P3_U0_CFG24 0x40010658u
#define CYREG_B0_P3_U0_CFG25 0x40010659u
#define CYREG_B0_P3_U0_CFG26 0x4001065au
#define CYREG_B0_P3_U0_CFG27 0x4001065bu
#define CYREG_B0_P3_U0_CFG28 0x4001065cu
#define CYREG_B0_P3_U0_CFG29 0x4001065du
#define CYREG_B0_P3_U0_CFG30 0x4001065eu
#define CYREG_B0_P3_U0_CFG31 0x4001065fu
#define CYREG_B0_P3_U0_DCFG0 0x40010660u
#define CYREG_B0_P3_U0_DCFG1 0x40010662u
#define CYREG_B0_P3_U0_DCFG2 0x40010664u
#define CYREG_B0_P3_U0_DCFG3 0x40010666u
#define CYREG_B0_P3_U0_DCFG4 0x40010668u
#define CYREG_B0_P3_U0_DCFG5 0x4001066au
#define CYREG_B0_P3_U0_DCFG6 0x4001066cu
#define CYREG_B0_P3_U0_DCFG7 0x4001066eu
#define CYDEV_UCFG_B0_P3_U1_BASE 0x40010680u
#define CYDEV_UCFG_B0_P3_U1_SIZE 0x00000070u
#define CYREG_B0_P3_U1_PLD_IT0 0x40010680u
#define CYREG_B0_P3_U1_PLD_IT1 0x40010684u
#define CYREG_B0_P3_U1_PLD_IT2 0x40010688u
#define CYREG_B0_P3_U1_PLD_IT3 0x4001068cu
#define CYREG_B0_P3_U1_PLD_IT4 0x40010690u
#define CYREG_B0_P3_U1_PLD_IT5 0x40010694u
#define CYREG_B0_P3_U1_PLD_IT6 0x40010698u
#define CYREG_B0_P3_U1_PLD_IT7 0x4001069cu
#define CYREG_B0_P3_U1_PLD_IT8 0x400106a0u
#define CYREG_B0_P3_U1_PLD_IT9 0x400106a4u
#define CYREG_B0_P3_U1_PLD_IT10 0x400106a8u
#define CYREG_B0_P3_U1_PLD_IT11 0x400106acu
#define CYREG_B0_P3_U1_PLD_ORT0 0x400106b0u
#define CYREG_B0_P3_U1_PLD_ORT1 0x400106b2u
#define CYREG_B0_P3_U1_PLD_ORT2 0x400106b4u
#define CYREG_B0_P3_U1_PLD_ORT3 0x400106b6u
#define CYREG_B0_P3_U1_MC_CFG_CEN_CONST 0x400106b8u
#define CYREG_B0_P3_U1_MC_CFG_XORFB 0x400106bau
#define CYREG_B0_P3_U1_MC_CFG_SET_RESET 0x400106bcu
#define CYREG_B0_P3_U1_MC_CFG_BYPASS 0x400106beu
#define CYREG_B0_P3_U1_CFG0 0x400106c0u
#define CYREG_B0_P3_U1_CFG1 0x400106c1u
#define CYREG_B0_P3_U1_CFG2 0x400106c2u
#define CYREG_B0_P3_U1_CFG3 0x400106c3u
#define CYREG_B0_P3_U1_CFG4 0x400106c4u
#define CYREG_B0_P3_U1_CFG5 0x400106c5u
#define CYREG_B0_P3_U1_CFG6 0x400106c6u
#define CYREG_B0_P3_U1_CFG7 0x400106c7u
#define CYREG_B0_P3_U1_CFG8 0x400106c8u
#define CYREG_B0_P3_U1_CFG9 0x400106c9u
#define CYREG_B0_P3_U1_CFG10 0x400106cau
#define CYREG_B0_P3_U1_CFG11 0x400106cbu
#define CYREG_B0_P3_U1_CFG12 0x400106ccu
#define CYREG_B0_P3_U1_CFG13 0x400106cdu
#define CYREG_B0_P3_U1_CFG14 0x400106ceu
#define CYREG_B0_P3_U1_CFG15 0x400106cfu
#define CYREG_B0_P3_U1_CFG16 0x400106d0u
#define CYREG_B0_P3_U1_CFG20 0x400106d4u
#define CYREG_B0_P3_U1_CFG21 0x400106d5u
#define CYREG_B0_P3_U1_CFG22 0x400106d6u
#define CYREG_B0_P3_U1_CFG23 0x400106d7u
#define CYREG_B0_P3_U1_CFG24 0x400106d8u
#define CYREG_B0_P3_U1_CFG25 0x400106d9u
#define CYREG_B0_P3_U1_CFG26 0x400106dau
#define CYREG_B0_P3_U1_CFG27 0x400106dbu
#define CYREG_B0_P3_U1_CFG28 0x400106dcu
#define CYREG_B0_P3_U1_CFG29 0x400106ddu
#define CYREG_B0_P3_U1_CFG30 0x400106deu
#define CYREG_B0_P3_U1_CFG31 0x400106dfu
#define CYREG_B0_P3_U1_DCFG0 0x400106e0u
#define CYREG_B0_P3_U1_DCFG1 0x400106e2u
#define CYREG_B0_P3_U1_DCFG2 0x400106e4u
#define CYREG_B0_P3_U1_DCFG3 0x400106e6u
#define CYREG_B0_P3_U1_DCFG4 0x400106e8u
#define CYREG_B0_P3_U1_DCFG5 0x400106eau
#define CYREG_B0_P3_U1_DCFG6 0x400106ecu
#define CYREG_B0_P3_U1_DCFG7 0x400106eeu
#define CYDEV_UCFG_B0_P3_ROUTE_BASE 0x40010700u
#define CYDEV_UCFG_B0_P3_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P4_BASE 0x40010800u
#define CYDEV_UCFG_B0_P4_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P4_U0_BASE 0x40010800u
#define CYDEV_UCFG_B0_P4_U0_SIZE 0x00000070u
#define CYREG_B0_P4_U0_PLD_IT0 0x40010800u
#define CYREG_B0_P4_U0_PLD_IT1 0x40010804u
#define CYREG_B0_P4_U0_PLD_IT2 0x40010808u
#define CYREG_B0_P4_U0_PLD_IT3 0x4001080cu
#define CYREG_B0_P4_U0_PLD_IT4 0x40010810u
#define CYREG_B0_P4_U0_PLD_IT5 0x40010814u
#define CYREG_B0_P4_U0_PLD_IT6 0x40010818u
#define CYREG_B0_P4_U0_PLD_IT7 0x4001081cu
#define CYREG_B0_P4_U0_PLD_IT8 0x40010820u
#define CYREG_B0_P4_U0_PLD_IT9 0x40010824u
#define CYREG_B0_P4_U0_PLD_IT10 0x40010828u
#define CYREG_B0_P4_U0_PLD_IT11 0x4001082cu
#define CYREG_B0_P4_U0_PLD_ORT0 0x40010830u
#define CYREG_B0_P4_U0_PLD_ORT1 0x40010832u
#define CYREG_B0_P4_U0_PLD_ORT2 0x40010834u
#define CYREG_B0_P4_U0_PLD_ORT3 0x40010836u
#define CYREG_B0_P4_U0_MC_CFG_CEN_CONST 0x40010838u
#define CYREG_B0_P4_U0_MC_CFG_XORFB 0x4001083au
#define CYREG_B0_P4_U0_MC_CFG_SET_RESET 0x4001083cu
#define CYREG_B0_P4_U0_MC_CFG_BYPASS 0x4001083eu
#define CYREG_B0_P4_U0_CFG0 0x40010840u
#define CYREG_B0_P4_U0_CFG1 0x40010841u
#define CYREG_B0_P4_U0_CFG2 0x40010842u
#define CYREG_B0_P4_U0_CFG3 0x40010843u
#define CYREG_B0_P4_U0_CFG4 0x40010844u
#define CYREG_B0_P4_U0_CFG5 0x40010845u
#define CYREG_B0_P4_U0_CFG6 0x40010846u
#define CYREG_B0_P4_U0_CFG7 0x40010847u
#define CYREG_B0_P4_U0_CFG8 0x40010848u
#define CYREG_B0_P4_U0_CFG9 0x40010849u
#define CYREG_B0_P4_U0_CFG10 0x4001084au
#define CYREG_B0_P4_U0_CFG11 0x4001084bu
#define CYREG_B0_P4_U0_CFG12 0x4001084cu
#define CYREG_B0_P4_U0_CFG13 0x4001084du
#define CYREG_B0_P4_U0_CFG14 0x4001084eu
#define CYREG_B0_P4_U0_CFG15 0x4001084fu
#define CYREG_B0_P4_U0_CFG16 0x40010850u
#define CYREG_B0_P4_U0_CFG20 0x40010854u
#define CYREG_B0_P4_U0_CFG21 0x40010855u
#define CYREG_B0_P4_U0_CFG22 0x40010856u
#define CYREG_B0_P4_U0_CFG23 0x40010857u
#define CYREG_B0_P4_U0_CFG24 0x40010858u
#define CYREG_B0_P4_U0_CFG25 0x40010859u
#define CYREG_B0_P4_U0_CFG26 0x4001085au
#define CYREG_B0_P4_U0_CFG27 0x4001085bu
#define CYREG_B0_P4_U0_CFG28 0x4001085cu
#define CYREG_B0_P4_U0_CFG29 0x4001085du
#define CYREG_B0_P4_U0_CFG30 0x4001085eu
#define CYREG_B0_P4_U0_CFG31 0x4001085fu
#define CYREG_B0_P4_U0_DCFG0 0x40010860u
#define CYREG_B0_P4_U0_DCFG1 0x40010862u
#define CYREG_B0_P4_U0_DCFG2 0x40010864u
#define CYREG_B0_P4_U0_DCFG3 0x40010866u
#define CYREG_B0_P4_U0_DCFG4 0x40010868u
#define CYREG_B0_P4_U0_DCFG5 0x4001086au
#define CYREG_B0_P4_U0_DCFG6 0x4001086cu
#define CYREG_B0_P4_U0_DCFG7 0x4001086eu
#define CYDEV_UCFG_B0_P4_U1_BASE 0x40010880u
#define CYDEV_UCFG_B0_P4_U1_SIZE 0x00000070u
#define CYREG_B0_P4_U1_PLD_IT0 0x40010880u
#define CYREG_B0_P4_U1_PLD_IT1 0x40010884u
#define CYREG_B0_P4_U1_PLD_IT2 0x40010888u
#define CYREG_B0_P4_U1_PLD_IT3 0x4001088cu
#define CYREG_B0_P4_U1_PLD_IT4 0x40010890u
#define CYREG_B0_P4_U1_PLD_IT5 0x40010894u
#define CYREG_B0_P4_U1_PLD_IT6 0x40010898u
#define CYREG_B0_P4_U1_PLD_IT7 0x4001089cu
#define CYREG_B0_P4_U1_PLD_IT8 0x400108a0u
#define CYREG_B0_P4_U1_PLD_IT9 0x400108a4u
#define CYREG_B0_P4_U1_PLD_IT10 0x400108a8u
#define CYREG_B0_P4_U1_PLD_IT11 0x400108acu
#define CYREG_B0_P4_U1_PLD_ORT0 0x400108b0u
#define CYREG_B0_P4_U1_PLD_ORT1 0x400108b2u
#define CYREG_B0_P4_U1_PLD_ORT2 0x400108b4u
#define CYREG_B0_P4_U1_PLD_ORT3 0x400108b6u
#define CYREG_B0_P4_U1_MC_CFG_CEN_CONST 0x400108b8u
#define CYREG_B0_P4_U1_MC_CFG_XORFB 0x400108bau
#define CYREG_B0_P4_U1_MC_CFG_SET_RESET 0x400108bcu
#define CYREG_B0_P4_U1_MC_CFG_BYPASS 0x400108beu
#define CYREG_B0_P4_U1_CFG0 0x400108c0u
#define CYREG_B0_P4_U1_CFG1 0x400108c1u
#define CYREG_B0_P4_U1_CFG2 0x400108c2u
#define CYREG_B0_P4_U1_CFG3 0x400108c3u
#define CYREG_B0_P4_U1_CFG4 0x400108c4u
#define CYREG_B0_P4_U1_CFG5 0x400108c5u
#define CYREG_B0_P4_U1_CFG6 0x400108c6u
#define CYREG_B0_P4_U1_CFG7 0x400108c7u
#define CYREG_B0_P4_U1_CFG8 0x400108c8u
#define CYREG_B0_P4_U1_CFG9 0x400108c9u
#define CYREG_B0_P4_U1_CFG10 0x400108cau
#define CYREG_B0_P4_U1_CFG11 0x400108cbu
#define CYREG_B0_P4_U1_CFG12 0x400108ccu
#define CYREG_B0_P4_U1_CFG13 0x400108cdu
#define CYREG_B0_P4_U1_CFG14 0x400108ceu
#define CYREG_B0_P4_U1_CFG15 0x400108cfu
#define CYREG_B0_P4_U1_CFG16 0x400108d0u
#define CYREG_B0_P4_U1_CFG20 0x400108d4u
#define CYREG_B0_P4_U1_CFG21 0x400108d5u
#define CYREG_B0_P4_U1_CFG22 0x400108d6u
#define CYREG_B0_P4_U1_CFG23 0x400108d7u
#define CYREG_B0_P4_U1_CFG24 0x400108d8u
#define CYREG_B0_P4_U1_CFG25 0x400108d9u
#define CYREG_B0_P4_U1_CFG26 0x400108dau
#define CYREG_B0_P4_U1_CFG27 0x400108dbu
#define CYREG_B0_P4_U1_CFG28 0x400108dcu
#define CYREG_B0_P4_U1_CFG29 0x400108ddu
#define CYREG_B0_P4_U1_CFG30 0x400108deu
#define CYREG_B0_P4_U1_CFG31 0x400108dfu
#define CYREG_B0_P4_U1_DCFG0 0x400108e0u
#define CYREG_B0_P4_U1_DCFG1 0x400108e2u
#define CYREG_B0_P4_U1_DCFG2 0x400108e4u
#define CYREG_B0_P4_U1_DCFG3 0x400108e6u
#define CYREG_B0_P4_U1_DCFG4 0x400108e8u
#define CYREG_B0_P4_U1_DCFG5 0x400108eau
#define CYREG_B0_P4_U1_DCFG6 0x400108ecu
#define CYREG_B0_P4_U1_DCFG7 0x400108eeu
#define CYDEV_UCFG_B0_P4_ROUTE_BASE 0x40010900u
#define CYDEV_UCFG_B0_P4_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P5_BASE 0x40010a00u
#define CYDEV_UCFG_B0_P5_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P5_U0_BASE 0x40010a00u
#define CYDEV_UCFG_B0_P5_U0_SIZE 0x00000070u
#define CYREG_B0_P5_U0_PLD_IT0 0x40010a00u
#define CYREG_B0_P5_U0_PLD_IT1 0x40010a04u
#define CYREG_B0_P5_U0_PLD_IT2 0x40010a08u
#define CYREG_B0_P5_U0_PLD_IT3 0x40010a0cu
#define CYREG_B0_P5_U0_PLD_IT4 0x40010a10u
#define CYREG_B0_P5_U0_PLD_IT5 0x40010a14u
#define CYREG_B0_P5_U0_PLD_IT6 0x40010a18u
#define CYREG_B0_P5_U0_PLD_IT7 0x40010a1cu
#define CYREG_B0_P5_U0_PLD_IT8 0x40010a20u
#define CYREG_B0_P5_U0_PLD_IT9 0x40010a24u
#define CYREG_B0_P5_U0_PLD_IT10 0x40010a28u
#define CYREG_B0_P5_U0_PLD_IT11 0x40010a2cu
#define CYREG_B0_P5_U0_PLD_ORT0 0x40010a30u
#define CYREG_B0_P5_U0_PLD_ORT1 0x40010a32u
#define CYREG_B0_P5_U0_PLD_ORT2 0x40010a34u
#define CYREG_B0_P5_U0_PLD_ORT3 0x40010a36u
#define CYREG_B0_P5_U0_MC_CFG_CEN_CONST 0x40010a38u
#define CYREG_B0_P5_U0_MC_CFG_XORFB 0x40010a3au
#define CYREG_B0_P5_U0_MC_CFG_SET_RESET 0x40010a3cu
#define CYREG_B0_P5_U0_MC_CFG_BYPASS 0x40010a3eu
#define CYREG_B0_P5_U0_CFG0 0x40010a40u
#define CYREG_B0_P5_U0_CFG1 0x40010a41u
#define CYREG_B0_P5_U0_CFG2 0x40010a42u
#define CYREG_B0_P5_U0_CFG3 0x40010a43u
#define CYREG_B0_P5_U0_CFG4 0x40010a44u
#define CYREG_B0_P5_U0_CFG5 0x40010a45u
#define CYREG_B0_P5_U0_CFG6 0x40010a46u
#define CYREG_B0_P5_U0_CFG7 0x40010a47u
#define CYREG_B0_P5_U0_CFG8 0x40010a48u
#define CYREG_B0_P5_U0_CFG9 0x40010a49u
#define CYREG_B0_P5_U0_CFG10 0x40010a4au
#define CYREG_B0_P5_U0_CFG11 0x40010a4bu
#define CYREG_B0_P5_U0_CFG12 0x40010a4cu
#define CYREG_B0_P5_U0_CFG13 0x40010a4du
#define CYREG_B0_P5_U0_CFG14 0x40010a4eu
#define CYREG_B0_P5_U0_CFG15 0x40010a4fu
#define CYREG_B0_P5_U0_CFG16 0x40010a50u
#define CYREG_B0_P5_U0_CFG20 0x40010a54u
#define CYREG_B0_P5_U0_CFG21 0x40010a55u
#define CYREG_B0_P5_U0_CFG22 0x40010a56u
#define CYREG_B0_P5_U0_CFG23 0x40010a57u
#define CYREG_B0_P5_U0_CFG24 0x40010a58u
#define CYREG_B0_P5_U0_CFG25 0x40010a59u
#define CYREG_B0_P5_U0_CFG26 0x40010a5au
#define CYREG_B0_P5_U0_CFG27 0x40010a5bu
#define CYREG_B0_P5_U0_CFG28 0x40010a5cu
#define CYREG_B0_P5_U0_CFG29 0x40010a5du
#define CYREG_B0_P5_U0_CFG30 0x40010a5eu
#define CYREG_B0_P5_U0_CFG31 0x40010a5fu
#define CYREG_B0_P5_U0_DCFG0 0x40010a60u
#define CYREG_B0_P5_U0_DCFG1 0x40010a62u
#define CYREG_B0_P5_U0_DCFG2 0x40010a64u
#define CYREG_B0_P5_U0_DCFG3 0x40010a66u
#define CYREG_B0_P5_U0_DCFG4 0x40010a68u
#define CYREG_B0_P5_U0_DCFG5 0x40010a6au
#define CYREG_B0_P5_U0_DCFG6 0x40010a6cu
#define CYREG_B0_P5_U0_DCFG7 0x40010a6eu
#define CYDEV_UCFG_B0_P5_U1_BASE 0x40010a80u
#define CYDEV_UCFG_B0_P5_U1_SIZE 0x00000070u
#define CYREG_B0_P5_U1_PLD_IT0 0x40010a80u
#define CYREG_B0_P5_U1_PLD_IT1 0x40010a84u
#define CYREG_B0_P5_U1_PLD_IT2 0x40010a88u
#define CYREG_B0_P5_U1_PLD_IT3 0x40010a8cu
#define CYREG_B0_P5_U1_PLD_IT4 0x40010a90u
#define CYREG_B0_P5_U1_PLD_IT5 0x40010a94u
#define CYREG_B0_P5_U1_PLD_IT6 0x40010a98u
#define CYREG_B0_P5_U1_PLD_IT7 0x40010a9cu
#define CYREG_B0_P5_U1_PLD_IT8 0x40010aa0u
#define CYREG_B0_P5_U1_PLD_IT9 0x40010aa4u
#define CYREG_B0_P5_U1_PLD_IT10 0x40010aa8u
#define CYREG_B0_P5_U1_PLD_IT11 0x40010aacu
#define CYREG_B0_P5_U1_PLD_ORT0 0x40010ab0u
#define CYREG_B0_P5_U1_PLD_ORT1 0x40010ab2u
