MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevice_trm.h
#define CYREG_B0_P5_U1_PLD_ORT2 0x40010ab4u
#define CYREG_B0_P5_U1_PLD_ORT3 0x40010ab6u
#define CYREG_B0_P5_U1_MC_CFG_CEN_CONST 0x40010ab8u
#define CYREG_B0_P5_U1_MC_CFG_XORFB 0x40010abau
#define CYREG_B0_P5_U1_MC_CFG_SET_RESET 0x40010abcu
#define CYREG_B0_P5_U1_MC_CFG_BYPASS 0x40010abeu
#define CYREG_B0_P5_U1_CFG0 0x40010ac0u
#define CYREG_B0_P5_U1_CFG1 0x40010ac1u
#define CYREG_B0_P5_U1_CFG2 0x40010ac2u
#define CYREG_B0_P5_U1_CFG3 0x40010ac3u
#define CYREG_B0_P5_U1_CFG4 0x40010ac4u
#define CYREG_B0_P5_U1_CFG5 0x40010ac5u
#define CYREG_B0_P5_U1_CFG6 0x40010ac6u
#define CYREG_B0_P5_U1_CFG7 0x40010ac7u
#define CYREG_B0_P5_U1_CFG8 0x40010ac8u
#define CYREG_B0_P5_U1_CFG9 0x40010ac9u
#define CYREG_B0_P5_U1_CFG10 0x40010acau
#define CYREG_B0_P5_U1_CFG11 0x40010acbu
#define CYREG_B0_P5_U1_CFG12 0x40010accu
#define CYREG_B0_P5_U1_CFG13 0x40010acdu
#define CYREG_B0_P5_U1_CFG14 0x40010aceu
#define CYREG_B0_P5_U1_CFG15 0x40010acfu
#define CYREG_B0_P5_U1_CFG16 0x40010ad0u
#define CYREG_B0_P5_U1_CFG20 0x40010ad4u
#define CYREG_B0_P5_U1_CFG21 0x40010ad5u
#define CYREG_B0_P5_U1_CFG22 0x40010ad6u
#define CYREG_B0_P5_U1_CFG23 0x40010ad7u
#define CYREG_B0_P5_U1_CFG24 0x40010ad8u
#define CYREG_B0_P5_U1_CFG25 0x40010ad9u
#define CYREG_B0_P5_U1_CFG26 0x40010adau
#define CYREG_B0_P5_U1_CFG27 0x40010adbu
#define CYREG_B0_P5_U1_CFG28 0x40010adcu
#define CYREG_B0_P5_U1_CFG29 0x40010addu
#define CYREG_B0_P5_U1_CFG30 0x40010adeu
#define CYREG_B0_P5_U1_CFG31 0x40010adfu
#define CYREG_B0_P5_U1_DCFG0 0x40010ae0u
#define CYREG_B0_P5_U1_DCFG1 0x40010ae2u
#define CYREG_B0_P5_U1_DCFG2 0x40010ae4u
#define CYREG_B0_P5_U1_DCFG3 0x40010ae6u
#define CYREG_B0_P5_U1_DCFG4 0x40010ae8u
#define CYREG_B0_P5_U1_DCFG5 0x40010aeau
#define CYREG_B0_P5_U1_DCFG6 0x40010aecu
#define CYREG_B0_P5_U1_DCFG7 0x40010aeeu
#define CYDEV_UCFG_B0_P5_ROUTE_BASE 0x40010b00u
#define CYDEV_UCFG_B0_P5_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P6_BASE 0x40010c00u
#define CYDEV_UCFG_B0_P6_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P6_U0_BASE 0x40010c00u
#define CYDEV_UCFG_B0_P6_U0_SIZE 0x00000070u
#define CYREG_B0_P6_U0_PLD_IT0 0x40010c00u
#define CYREG_B0_P6_U0_PLD_IT1 0x40010c04u
#define CYREG_B0_P6_U0_PLD_IT2 0x40010c08u
#define CYREG_B0_P6_U0_PLD_IT3 0x40010c0cu
#define CYREG_B0_P6_U0_PLD_IT4 0x40010c10u
#define CYREG_B0_P6_U0_PLD_IT5 0x40010c14u
#define CYREG_B0_P6_U0_PLD_IT6 0x40010c18u
#define CYREG_B0_P6_U0_PLD_IT7 0x40010c1cu
#define CYREG_B0_P6_U0_PLD_IT8 0x40010c20u
#define CYREG_B0_P6_U0_PLD_IT9 0x40010c24u
#define CYREG_B0_P6_U0_PLD_IT10 0x40010c28u
#define CYREG_B0_P6_U0_PLD_IT11 0x40010c2cu
#define CYREG_B0_P6_U0_PLD_ORT0 0x40010c30u
#define CYREG_B0_P6_U0_PLD_ORT1 0x40010c32u
#define CYREG_B0_P6_U0_PLD_ORT2 0x40010c34u
#define CYREG_B0_P6_U0_PLD_ORT3 0x40010c36u
#define CYREG_B0_P6_U0_MC_CFG_CEN_CONST 0x40010c38u
#define CYREG_B0_P6_U0_MC_CFG_XORFB 0x40010c3au
#define CYREG_B0_P6_U0_MC_CFG_SET_RESET 0x40010c3cu
#define CYREG_B0_P6_U0_MC_CFG_BYPASS 0x40010c3eu
#define CYREG_B0_P6_U0_CFG0 0x40010c40u
#define CYREG_B0_P6_U0_CFG1 0x40010c41u
#define CYREG_B0_P6_U0_CFG2 0x40010c42u
#define CYREG_B0_P6_U0_CFG3 0x40010c43u
#define CYREG_B0_P6_U0_CFG4 0x40010c44u
#define CYREG_B0_P6_U0_CFG5 0x40010c45u
#define CYREG_B0_P6_U0_CFG6 0x40010c46u
#define CYREG_B0_P6_U0_CFG7 0x40010c47u
#define CYREG_B0_P6_U0_CFG8 0x40010c48u
#define CYREG_B0_P6_U0_CFG9 0x40010c49u
#define CYREG_B0_P6_U0_CFG10 0x40010c4au
#define CYREG_B0_P6_U0_CFG11 0x40010c4bu
#define CYREG_B0_P6_U0_CFG12 0x40010c4cu
#define CYREG_B0_P6_U0_CFG13 0x40010c4du
#define CYREG_B0_P6_U0_CFG14 0x40010c4eu
#define CYREG_B0_P6_U0_CFG15 0x40010c4fu
#define CYREG_B0_P6_U0_CFG16 0x40010c50u
#define CYREG_B0_P6_U0_CFG20 0x40010c54u
#define CYREG_B0_P6_U0_CFG21 0x40010c55u
#define CYREG_B0_P6_U0_CFG22 0x40010c56u
#define CYREG_B0_P6_U0_CFG23 0x40010c57u
#define CYREG_B0_P6_U0_CFG24 0x40010c58u
#define CYREG_B0_P6_U0_CFG25 0x40010c59u
#define CYREG_B0_P6_U0_CFG26 0x40010c5au
#define CYREG_B0_P6_U0_CFG27 0x40010c5bu
#define CYREG_B0_P6_U0_CFG28 0x40010c5cu
#define CYREG_B0_P6_U0_CFG29 0x40010c5du
#define CYREG_B0_P6_U0_CFG30 0x40010c5eu
#define CYREG_B0_P6_U0_CFG31 0x40010c5fu
#define CYREG_B0_P6_U0_DCFG0 0x40010c60u
#define CYREG_B0_P6_U0_DCFG1 0x40010c62u
#define CYREG_B0_P6_U0_DCFG2 0x40010c64u
#define CYREG_B0_P6_U0_DCFG3 0x40010c66u
#define CYREG_B0_P6_U0_DCFG4 0x40010c68u
#define CYREG_B0_P6_U0_DCFG5 0x40010c6au
#define CYREG_B0_P6_U0_DCFG6 0x40010c6cu
#define CYREG_B0_P6_U0_DCFG7 0x40010c6eu
#define CYDEV_UCFG_B0_P6_U1_BASE 0x40010c80u
#define CYDEV_UCFG_B0_P6_U1_SIZE 0x00000070u
#define CYREG_B0_P6_U1_PLD_IT0 0x40010c80u
#define CYREG_B0_P6_U1_PLD_IT1 0x40010c84u
#define CYREG_B0_P6_U1_PLD_IT2 0x40010c88u
#define CYREG_B0_P6_U1_PLD_IT3 0x40010c8cu
#define CYREG_B0_P6_U1_PLD_IT4 0x40010c90u
#define CYREG_B0_P6_U1_PLD_IT5 0x40010c94u
#define CYREG_B0_P6_U1_PLD_IT6 0x40010c98u
#define CYREG_B0_P6_U1_PLD_IT7 0x40010c9cu
#define CYREG_B0_P6_U1_PLD_IT8 0x40010ca0u
#define CYREG_B0_P6_U1_PLD_IT9 0x40010ca4u
#define CYREG_B0_P6_U1_PLD_IT10 0x40010ca8u
#define CYREG_B0_P6_U1_PLD_IT11 0x40010cacu
#define CYREG_B0_P6_U1_PLD_ORT0 0x40010cb0u
#define CYREG_B0_P6_U1_PLD_ORT1 0x40010cb2u
#define CYREG_B0_P6_U1_PLD_ORT2 0x40010cb4u
#define CYREG_B0_P6_U1_PLD_ORT3 0x40010cb6u
#define CYREG_B0_P6_U1_MC_CFG_CEN_CONST 0x40010cb8u
#define CYREG_B0_P6_U1_MC_CFG_XORFB 0x40010cbau
#define CYREG_B0_P6_U1_MC_CFG_SET_RESET 0x40010cbcu
#define CYREG_B0_P6_U1_MC_CFG_BYPASS 0x40010cbeu
#define CYREG_B0_P6_U1_CFG0 0x40010cc0u
#define CYREG_B0_P6_U1_CFG1 0x40010cc1u
#define CYREG_B0_P6_U1_CFG2 0x40010cc2u
#define CYREG_B0_P6_U1_CFG3 0x40010cc3u
#define CYREG_B0_P6_U1_CFG4 0x40010cc4u
#define CYREG_B0_P6_U1_CFG5 0x40010cc5u
#define CYREG_B0_P6_U1_CFG6 0x40010cc6u
#define CYREG_B0_P6_U1_CFG7 0x40010cc7u
#define CYREG_B0_P6_U1_CFG8 0x40010cc8u
#define CYREG_B0_P6_U1_CFG9 0x40010cc9u
#define CYREG_B0_P6_U1_CFG10 0x40010ccau
#define CYREG_B0_P6_U1_CFG11 0x40010ccbu
#define CYREG_B0_P6_U1_CFG12 0x40010cccu
#define CYREG_B0_P6_U1_CFG13 0x40010ccdu
#define CYREG_B0_P6_U1_CFG14 0x40010cceu
#define CYREG_B0_P6_U1_CFG15 0x40010ccfu
#define CYREG_B0_P6_U1_CFG16 0x40010cd0u
#define CYREG_B0_P6_U1_CFG20 0x40010cd4u
#define CYREG_B0_P6_U1_CFG21 0x40010cd5u
#define CYREG_B0_P6_U1_CFG22 0x40010cd6u
#define CYREG_B0_P6_U1_CFG23 0x40010cd7u
#define CYREG_B0_P6_U1_CFG24 0x40010cd8u
#define CYREG_B0_P6_U1_CFG25 0x40010cd9u
#define CYREG_B0_P6_U1_CFG26 0x40010cdau
#define CYREG_B0_P6_U1_CFG27 0x40010cdbu
#define CYREG_B0_P6_U1_CFG28 0x40010cdcu
#define CYREG_B0_P6_U1_CFG29 0x40010cddu
#define CYREG_B0_P6_U1_CFG30 0x40010cdeu
#define CYREG_B0_P6_U1_CFG31 0x40010cdfu
#define CYREG_B0_P6_U1_DCFG0 0x40010ce0u
#define CYREG_B0_P6_U1_DCFG1 0x40010ce2u
#define CYREG_B0_P6_U1_DCFG2 0x40010ce4u
#define CYREG_B0_P6_U1_DCFG3 0x40010ce6u
#define CYREG_B0_P6_U1_DCFG4 0x40010ce8u
#define CYREG_B0_P6_U1_DCFG5 0x40010ceau
#define CYREG_B0_P6_U1_DCFG6 0x40010cecu
#define CYREG_B0_P6_U1_DCFG7 0x40010ceeu
#define CYDEV_UCFG_B0_P6_ROUTE_BASE 0x40010d00u
#define CYDEV_UCFG_B0_P6_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B0_P7_BASE 0x40010e00u
#define CYDEV_UCFG_B0_P7_SIZE 0x000001efu
#define CYDEV_UCFG_B0_P7_U0_BASE 0x40010e00u
#define CYDEV_UCFG_B0_P7_U0_SIZE 0x00000070u
#define CYREG_B0_P7_U0_PLD_IT0 0x40010e00u
#define CYREG_B0_P7_U0_PLD_IT1 0x40010e04u
#define CYREG_B0_P7_U0_PLD_IT2 0x40010e08u
#define CYREG_B0_P7_U0_PLD_IT3 0x40010e0cu
#define CYREG_B0_P7_U0_PLD_IT4 0x40010e10u
#define CYREG_B0_P7_U0_PLD_IT5 0x40010e14u
#define CYREG_B0_P7_U0_PLD_IT6 0x40010e18u
#define CYREG_B0_P7_U0_PLD_IT7 0x40010e1cu
#define CYREG_B0_P7_U0_PLD_IT8 0x40010e20u
#define CYREG_B0_P7_U0_PLD_IT9 0x40010e24u
#define CYREG_B0_P7_U0_PLD_IT10 0x40010e28u
#define CYREG_B0_P7_U0_PLD_IT11 0x40010e2cu
#define CYREG_B0_P7_U0_PLD_ORT0 0x40010e30u
#define CYREG_B0_P7_U0_PLD_ORT1 0x40010e32u
#define CYREG_B0_P7_U0_PLD_ORT2 0x40010e34u
#define CYREG_B0_P7_U0_PLD_ORT3 0x40010e36u
#define CYREG_B0_P7_U0_MC_CFG_CEN_CONST 0x40010e38u
#define CYREG_B0_P7_U0_MC_CFG_XORFB 0x40010e3au
#define CYREG_B0_P7_U0_MC_CFG_SET_RESET 0x40010e3cu
#define CYREG_B0_P7_U0_MC_CFG_BYPASS 0x40010e3eu
#define CYREG_B0_P7_U0_CFG0 0x40010e40u
#define CYREG_B0_P7_U0_CFG1 0x40010e41u
#define CYREG_B0_P7_U0_CFG2 0x40010e42u
#define CYREG_B0_P7_U0_CFG3 0x40010e43u
#define CYREG_B0_P7_U0_CFG4 0x40010e44u
#define CYREG_B0_P7_U0_CFG5 0x40010e45u
#define CYREG_B0_P7_U0_CFG6 0x40010e46u
#define CYREG_B0_P7_U0_CFG7 0x40010e47u
#define CYREG_B0_P7_U0_CFG8 0x40010e48u
#define CYREG_B0_P7_U0_CFG9 0x40010e49u
#define CYREG_B0_P7_U0_CFG10 0x40010e4au
#define CYREG_B0_P7_U0_CFG11 0x40010e4bu
#define CYREG_B0_P7_U0_CFG12 0x40010e4cu
#define CYREG_B0_P7_U0_CFG13 0x40010e4du
#define CYREG_B0_P7_U0_CFG14 0x40010e4eu
#define CYREG_B0_P7_U0_CFG15 0x40010e4fu
#define CYREG_B0_P7_U0_CFG16 0x40010e50u
#define CYREG_B0_P7_U0_CFG20 0x40010e54u
#define CYREG_B0_P7_U0_CFG21 0x40010e55u
#define CYREG_B0_P7_U0_CFG22 0x40010e56u
#define CYREG_B0_P7_U0_CFG23 0x40010e57u
#define CYREG_B0_P7_U0_CFG24 0x40010e58u
#define CYREG_B0_P7_U0_CFG25 0x40010e59u
#define CYREG_B0_P7_U0_CFG26 0x40010e5au
#define CYREG_B0_P7_U0_CFG27 0x40010e5bu
#define CYREG_B0_P7_U0_CFG28 0x40010e5cu
#define CYREG_B0_P7_U0_CFG29 0x40010e5du
#define CYREG_B0_P7_U0_CFG30 0x40010e5eu
#define CYREG_B0_P7_U0_CFG31 0x40010e5fu
#define CYREG_B0_P7_U0_DCFG0 0x40010e60u
#define CYREG_B0_P7_U0_DCFG1 0x40010e62u
#define CYREG_B0_P7_U0_DCFG2 0x40010e64u
#define CYREG_B0_P7_U0_DCFG3 0x40010e66u
#define CYREG_B0_P7_U0_DCFG4 0x40010e68u
#define CYREG_B0_P7_U0_DCFG5 0x40010e6au
#define CYREG_B0_P7_U0_DCFG6 0x40010e6cu
#define CYREG_B0_P7_U0_DCFG7 0x40010e6eu
#define CYDEV_UCFG_B0_P7_U1_BASE 0x40010e80u
#define CYDEV_UCFG_B0_P7_U1_SIZE 0x00000070u
#define CYREG_B0_P7_U1_PLD_IT0 0x40010e80u
#define CYREG_B0_P7_U1_PLD_IT1 0x40010e84u
#define CYREG_B0_P7_U1_PLD_IT2 0x40010e88u
#define CYREG_B0_P7_U1_PLD_IT3 0x40010e8cu
#define CYREG_B0_P7_U1_PLD_IT4 0x40010e90u
#define CYREG_B0_P7_U1_PLD_IT5 0x40010e94u
#define CYREG_B0_P7_U1_PLD_IT6 0x40010e98u
#define CYREG_B0_P7_U1_PLD_IT7 0x40010e9cu
#define CYREG_B0_P7_U1_PLD_IT8 0x40010ea0u
#define CYREG_B0_P7_U1_PLD_IT9 0x40010ea4u
#define CYREG_B0_P7_U1_PLD_IT10 0x40010ea8u
#define CYREG_B0_P7_U1_PLD_IT11 0x40010eacu
#define CYREG_B0_P7_U1_PLD_ORT0 0x40010eb0u
#define CYREG_B0_P7_U1_PLD_ORT1 0x40010eb2u
#define CYREG_B0_P7_U1_PLD_ORT2 0x40010eb4u
#define CYREG_B0_P7_U1_PLD_ORT3 0x40010eb6u
#define CYREG_B0_P7_U1_MC_CFG_CEN_CONST 0x40010eb8u
#define CYREG_B0_P7_U1_MC_CFG_XORFB 0x40010ebau
#define CYREG_B0_P7_U1_MC_CFG_SET_RESET 0x40010ebcu
#define CYREG_B0_P7_U1_MC_CFG_BYPASS 0x40010ebeu
#define CYREG_B0_P7_U1_CFG0 0x40010ec0u
#define CYREG_B0_P7_U1_CFG1 0x40010ec1u
#define CYREG_B0_P7_U1_CFG2 0x40010ec2u
#define CYREG_B0_P7_U1_CFG3 0x40010ec3u
#define CYREG_B0_P7_U1_CFG4 0x40010ec4u
#define CYREG_B0_P7_U1_CFG5 0x40010ec5u
#define CYREG_B0_P7_U1_CFG6 0x40010ec6u
#define CYREG_B0_P7_U1_CFG7 0x40010ec7u
#define CYREG_B0_P7_U1_CFG8 0x40010ec8u
#define CYREG_B0_P7_U1_CFG9 0x40010ec9u
#define CYREG_B0_P7_U1_CFG10 0x40010ecau
#define CYREG_B0_P7_U1_CFG11 0x40010ecbu
#define CYREG_B0_P7_U1_CFG12 0x40010eccu
#define CYREG_B0_P7_U1_CFG13 0x40010ecdu
#define CYREG_B0_P7_U1_CFG14 0x40010eceu
#define CYREG_B0_P7_U1_CFG15 0x40010ecfu
#define CYREG_B0_P7_U1_CFG16 0x40010ed0u
#define CYREG_B0_P7_U1_CFG20 0x40010ed4u
#define CYREG_B0_P7_U1_CFG21 0x40010ed5u
#define CYREG_B0_P7_U1_CFG22 0x40010ed6u
#define CYREG_B0_P7_U1_CFG23 0x40010ed7u
#define CYREG_B0_P7_U1_CFG24 0x40010ed8u
#define CYREG_B0_P7_U1_CFG25 0x40010ed9u
#define CYREG_B0_P7_U1_CFG26 0x40010edau
#define CYREG_B0_P7_U1_CFG27 0x40010edbu
#define CYREG_B0_P7_U1_CFG28 0x40010edcu
#define CYREG_B0_P7_U1_CFG29 0x40010eddu
#define CYREG_B0_P7_U1_CFG30 0x40010edeu
#define CYREG_B0_P7_U1_CFG31 0x40010edfu
#define CYREG_B0_P7_U1_DCFG0 0x40010ee0u
#define CYREG_B0_P7_U1_DCFG1 0x40010ee2u
#define CYREG_B0_P7_U1_DCFG2 0x40010ee4u
#define CYREG_B0_P7_U1_DCFG3 0x40010ee6u
#define CYREG_B0_P7_U1_DCFG4 0x40010ee8u
#define CYREG_B0_P7_U1_DCFG5 0x40010eeau
#define CYREG_B0_P7_U1_DCFG6 0x40010eecu
#define CYREG_B0_P7_U1_DCFG7 0x40010eeeu
#define CYDEV_UCFG_B0_P7_ROUTE_BASE 0x40010f00u
#define CYDEV_UCFG_B0_P7_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_BASE 0x40011000u
#define CYDEV_UCFG_B1_SIZE 0x00000fefu
#define CYDEV_UCFG_B1_P2_BASE 0x40011400u
#define CYDEV_UCFG_B1_P2_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P2_U0_BASE 0x40011400u
#define CYDEV_UCFG_B1_P2_U0_SIZE 0x00000070u
#define CYREG_B1_P2_U0_PLD_IT0 0x40011400u
#define CYREG_B1_P2_U0_PLD_IT1 0x40011404u
#define CYREG_B1_P2_U0_PLD_IT2 0x40011408u
#define CYREG_B1_P2_U0_PLD_IT3 0x4001140cu
#define CYREG_B1_P2_U0_PLD_IT4 0x40011410u
#define CYREG_B1_P2_U0_PLD_IT5 0x40011414u
#define CYREG_B1_P2_U0_PLD_IT6 0x40011418u
#define CYREG_B1_P2_U0_PLD_IT7 0x4001141cu
#define CYREG_B1_P2_U0_PLD_IT8 0x40011420u
#define CYREG_B1_P2_U0_PLD_IT9 0x40011424u
#define CYREG_B1_P2_U0_PLD_IT10 0x40011428u
#define CYREG_B1_P2_U0_PLD_IT11 0x4001142cu
#define CYREG_B1_P2_U0_PLD_ORT0 0x40011430u
#define CYREG_B1_P2_U0_PLD_ORT1 0x40011432u
#define CYREG_B1_P2_U0_PLD_ORT2 0x40011434u
#define CYREG_B1_P2_U0_PLD_ORT3 0x40011436u
#define CYREG_B1_P2_U0_MC_CFG_CEN_CONST 0x40011438u
#define CYREG_B1_P2_U0_MC_CFG_XORFB 0x4001143au
#define CYREG_B1_P2_U0_MC_CFG_SET_RESET 0x4001143cu
#define CYREG_B1_P2_U0_MC_CFG_BYPASS 0x4001143eu
#define CYREG_B1_P2_U0_CFG0 0x40011440u
#define CYREG_B1_P2_U0_CFG1 0x40011441u
#define CYREG_B1_P2_U0_CFG2 0x40011442u
#define CYREG_B1_P2_U0_CFG3 0x40011443u
#define CYREG_B1_P2_U0_CFG4 0x40011444u
#define CYREG_B1_P2_U0_CFG5 0x40011445u
#define CYREG_B1_P2_U0_CFG6 0x40011446u
#define CYREG_B1_P2_U0_CFG7 0x40011447u
#define CYREG_B1_P2_U0_CFG8 0x40011448u
#define CYREG_B1_P2_U0_CFG9 0x40011449u
#define CYREG_B1_P2_U0_CFG10 0x4001144au
#define CYREG_B1_P2_U0_CFG11 0x4001144bu
#define CYREG_B1_P2_U0_CFG12 0x4001144cu
#define CYREG_B1_P2_U0_CFG13 0x4001144du
#define CYREG_B1_P2_U0_CFG14 0x4001144eu
#define CYREG_B1_P2_U0_CFG15 0x4001144fu
#define CYREG_B1_P2_U0_CFG16 0x40011450u
#define CYREG_B1_P2_U0_CFG20 0x40011454u
#define CYREG_B1_P2_U0_CFG21 0x40011455u
#define CYREG_B1_P2_U0_CFG22 0x40011456u
#define CYREG_B1_P2_U0_CFG23 0x40011457u
#define CYREG_B1_P2_U0_CFG24 0x40011458u
#define CYREG_B1_P2_U0_CFG25 0x40011459u
#define CYREG_B1_P2_U0_CFG26 0x4001145au
#define CYREG_B1_P2_U0_CFG27 0x4001145bu
#define CYREG_B1_P2_U0_CFG28 0x4001145cu
#define CYREG_B1_P2_U0_CFG29 0x4001145du
#define CYREG_B1_P2_U0_CFG30 0x4001145eu
#define CYREG_B1_P2_U0_CFG31 0x4001145fu
#define CYREG_B1_P2_U0_DCFG0 0x40011460u
#define CYREG_B1_P2_U0_DCFG1 0x40011462u
#define CYREG_B1_P2_U0_DCFG2 0x40011464u
#define CYREG_B1_P2_U0_DCFG3 0x40011466u
#define CYREG_B1_P2_U0_DCFG4 0x40011468u
#define CYREG_B1_P2_U0_DCFG5 0x4001146au
#define CYREG_B1_P2_U0_DCFG6 0x4001146cu
#define CYREG_B1_P2_U0_DCFG7 0x4001146eu
#define CYDEV_UCFG_B1_P2_U1_BASE 0x40011480u
#define CYDEV_UCFG_B1_P2_U1_SIZE 0x00000070u
#define CYREG_B1_P2_U1_PLD_IT0 0x40011480u
#define CYREG_B1_P2_U1_PLD_IT1 0x40011484u
#define CYREG_B1_P2_U1_PLD_IT2 0x40011488u
#define CYREG_B1_P2_U1_PLD_IT3 0x4001148cu
#define CYREG_B1_P2_U1_PLD_IT4 0x40011490u
#define CYREG_B1_P2_U1_PLD_IT5 0x40011494u
#define CYREG_B1_P2_U1_PLD_IT6 0x40011498u
#define CYREG_B1_P2_U1_PLD_IT7 0x4001149cu
#define CYREG_B1_P2_U1_PLD_IT8 0x400114a0u
#define CYREG_B1_P2_U1_PLD_IT9 0x400114a4u
#define CYREG_B1_P2_U1_PLD_IT10 0x400114a8u
#define CYREG_B1_P2_U1_PLD_IT11 0x400114acu
#define CYREG_B1_P2_U1_PLD_ORT0 0x400114b0u
#define CYREG_B1_P2_U1_PLD_ORT1 0x400114b2u
#define CYREG_B1_P2_U1_PLD_ORT2 0x400114b4u
#define CYREG_B1_P2_U1_PLD_ORT3 0x400114b6u
#define CYREG_B1_P2_U1_MC_CFG_CEN_CONST 0x400114b8u
#define CYREG_B1_P2_U1_MC_CFG_XORFB 0x400114bau
#define CYREG_B1_P2_U1_MC_CFG_SET_RESET 0x400114bcu
#define CYREG_B1_P2_U1_MC_CFG_BYPASS 0x400114beu
#define CYREG_B1_P2_U1_CFG0 0x400114c0u
#define CYREG_B1_P2_U1_CFG1 0x400114c1u
#define CYREG_B1_P2_U1_CFG2 0x400114c2u
#define CYREG_B1_P2_U1_CFG3 0x400114c3u
#define CYREG_B1_P2_U1_CFG4 0x400114c4u
#define CYREG_B1_P2_U1_CFG5 0x400114c5u
#define CYREG_B1_P2_U1_CFG6 0x400114c6u
#define CYREG_B1_P2_U1_CFG7 0x400114c7u
#define CYREG_B1_P2_U1_CFG8 0x400114c8u
#define CYREG_B1_P2_U1_CFG9 0x400114c9u
#define CYREG_B1_P2_U1_CFG10 0x400114cau
#define CYREG_B1_P2_U1_CFG11 0x400114cbu
#define CYREG_B1_P2_U1_CFG12 0x400114ccu
#define CYREG_B1_P2_U1_CFG13 0x400114cdu
#define CYREG_B1_P2_U1_CFG14 0x400114ceu
#define CYREG_B1_P2_U1_CFG15 0x400114cfu
#define CYREG_B1_P2_U1_CFG16 0x400114d0u
#define CYREG_B1_P2_U1_CFG20 0x400114d4u
#define CYREG_B1_P2_U1_CFG21 0x400114d5u
#define CYREG_B1_P2_U1_CFG22 0x400114d6u
#define CYREG_B1_P2_U1_CFG23 0x400114d7u
#define CYREG_B1_P2_U1_CFG24 0x400114d8u
#define CYREG_B1_P2_U1_CFG25 0x400114d9u
#define CYREG_B1_P2_U1_CFG26 0x400114dau
#define CYREG_B1_P2_U1_CFG27 0x400114dbu
#define CYREG_B1_P2_U1_CFG28 0x400114dcu
#define CYREG_B1_P2_U1_CFG29 0x400114ddu
#define CYREG_B1_P2_U1_CFG30 0x400114deu
#define CYREG_B1_P2_U1_CFG31 0x400114dfu
#define CYREG_B1_P2_U1_DCFG0 0x400114e0u
#define CYREG_B1_P2_U1_DCFG1 0x400114e2u
#define CYREG_B1_P2_U1_DCFG2 0x400114e4u
#define CYREG_B1_P2_U1_DCFG3 0x400114e6u
#define CYREG_B1_P2_U1_DCFG4 0x400114e8u
#define CYREG_B1_P2_U1_DCFG5 0x400114eau
#define CYREG_B1_P2_U1_DCFG6 0x400114ecu
#define CYREG_B1_P2_U1_DCFG7 0x400114eeu
#define CYDEV_UCFG_B1_P2_ROUTE_BASE 0x40011500u
#define CYDEV_UCFG_B1_P2_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_P3_BASE 0x40011600u
#define CYDEV_UCFG_B1_P3_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P3_U0_BASE 0x40011600u
#define CYDEV_UCFG_B1_P3_U0_SIZE 0x00000070u
#define CYREG_B1_P3_U0_PLD_IT0 0x40011600u
#define CYREG_B1_P3_U0_PLD_IT1 0x40011604u
#define CYREG_B1_P3_U0_PLD_IT2 0x40011608u
#define CYREG_B1_P3_U0_PLD_IT3 0x4001160cu
#define CYREG_B1_P3_U0_PLD_IT4 0x40011610u
#define CYREG_B1_P3_U0_PLD_IT5 0x40011614u
#define CYREG_B1_P3_U0_PLD_IT6 0x40011618u
#define CYREG_B1_P3_U0_PLD_IT7 0x4001161cu
#define CYREG_B1_P3_U0_PLD_IT8 0x40011620u
#define CYREG_B1_P3_U0_PLD_IT9 0x40011624u
#define CYREG_B1_P3_U0_PLD_IT10 0x40011628u
#define CYREG_B1_P3_U0_PLD_IT11 0x4001162cu
#define CYREG_B1_P3_U0_PLD_ORT0 0x40011630u
#define CYREG_B1_P3_U0_PLD_ORT1 0x40011632u
#define CYREG_B1_P3_U0_PLD_ORT2 0x40011634u
#define CYREG_B1_P3_U0_PLD_ORT3 0x40011636u
#define CYREG_B1_P3_U0_MC_CFG_CEN_CONST 0x40011638u
#define CYREG_B1_P3_U0_MC_CFG_XORFB 0x4001163au
#define CYREG_B1_P3_U0_MC_CFG_SET_RESET 0x4001163cu
#define CYREG_B1_P3_U0_MC_CFG_BYPASS 0x4001163eu
#define CYREG_B1_P3_U0_CFG0 0x40011640u
#define CYREG_B1_P3_U0_CFG1 0x40011641u
#define CYREG_B1_P3_U0_CFG2 0x40011642u
#define CYREG_B1_P3_U0_CFG3 0x40011643u
#define CYREG_B1_P3_U0_CFG4 0x40011644u
#define CYREG_B1_P3_U0_CFG5 0x40011645u
#define CYREG_B1_P3_U0_CFG6 0x40011646u
#define CYREG_B1_P3_U0_CFG7 0x40011647u
#define CYREG_B1_P3_U0_CFG8 0x40011648u
#define CYREG_B1_P3_U0_CFG9 0x40011649u
#define CYREG_B1_P3_U0_CFG10 0x4001164au
#define CYREG_B1_P3_U0_CFG11 0x4001164bu
#define CYREG_B1_P3_U0_CFG12 0x4001164cu
#define CYREG_B1_P3_U0_CFG13 0x4001164du
#define CYREG_B1_P3_U0_CFG14 0x4001164eu
#define CYREG_B1_P3_U0_CFG15 0x4001164fu
#define CYREG_B1_P3_U0_CFG16 0x40011650u
#define CYREG_B1_P3_U0_CFG20 0x40011654u
#define CYREG_B1_P3_U0_CFG21 0x40011655u
#define CYREG_B1_P3_U0_CFG22 0x40011656u
#define CYREG_B1_P3_U0_CFG23 0x40011657u
#define CYREG_B1_P3_U0_CFG24 0x40011658u
#define CYREG_B1_P3_U0_CFG25 0x40011659u
#define CYREG_B1_P3_U0_CFG26 0x4001165au
#define CYREG_B1_P3_U0_CFG27 0x4001165bu
#define CYREG_B1_P3_U0_CFG28 0x4001165cu
#define CYREG_B1_P3_U0_CFG29 0x4001165du
#define CYREG_B1_P3_U0_CFG30 0x4001165eu
#define CYREG_B1_P3_U0_CFG31 0x4001165fu
#define CYREG_B1_P3_U0_DCFG0 0x40011660u
#define CYREG_B1_P3_U0_DCFG1 0x40011662u
#define CYREG_B1_P3_U0_DCFG2 0x40011664u
#define CYREG_B1_P3_U0_DCFG3 0x40011666u
#define CYREG_B1_P3_U0_DCFG4 0x40011668u
#define CYREG_B1_P3_U0_DCFG5 0x4001166au
#define CYREG_B1_P3_U0_DCFG6 0x4001166cu
#define CYREG_B1_P3_U0_DCFG7 0x4001166eu
#define CYDEV_UCFG_B1_P3_U1_BASE 0x40011680u
#define CYDEV_UCFG_B1_P3_U1_SIZE 0x00000070u
#define CYREG_B1_P3_U1_PLD_IT0 0x40011680u
#define CYREG_B1_P3_U1_PLD_IT1 0x40011684u
#define CYREG_B1_P3_U1_PLD_IT2 0x40011688u
#define CYREG_B1_P3_U1_PLD_IT3 0x4001168cu
#define CYREG_B1_P3_U1_PLD_IT4 0x40011690u
#define CYREG_B1_P3_U1_PLD_IT5 0x40011694u
#define CYREG_B1_P3_U1_PLD_IT6 0x40011698u
#define CYREG_B1_P3_U1_PLD_IT7 0x4001169cu
#define CYREG_B1_P3_U1_PLD_IT8 0x400116a0u
#define CYREG_B1_P3_U1_PLD_IT9 0x400116a4u
#define CYREG_B1_P3_U1_PLD_IT10 0x400116a8u
#define CYREG_B1_P3_U1_PLD_IT11 0x400116acu
#define CYREG_B1_P3_U1_PLD_ORT0 0x400116b0u
#define CYREG_B1_P3_U1_PLD_ORT1 0x400116b2u
#define CYREG_B1_P3_U1_PLD_ORT2 0x400116b4u
#define CYREG_B1_P3_U1_PLD_ORT3 0x400116b6u
#define CYREG_B1_P3_U1_MC_CFG_CEN_CONST 0x400116b8u
#define CYREG_B1_P3_U1_MC_CFG_XORFB 0x400116bau
#define CYREG_B1_P3_U1_MC_CFG_SET_RESET 0x400116bcu
#define CYREG_B1_P3_U1_MC_CFG_BYPASS 0x400116beu
#define CYREG_B1_P3_U1_CFG0 0x400116c0u
#define CYREG_B1_P3_U1_CFG1 0x400116c1u
#define CYREG_B1_P3_U1_CFG2 0x400116c2u
#define CYREG_B1_P3_U1_CFG3 0x400116c3u
#define CYREG_B1_P3_U1_CFG4 0x400116c4u
#define CYREG_B1_P3_U1_CFG5 0x400116c5u
#define CYREG_B1_P3_U1_CFG6 0x400116c6u
#define CYREG_B1_P3_U1_CFG7 0x400116c7u
#define CYREG_B1_P3_U1_CFG8 0x400116c8u
#define CYREG_B1_P3_U1_CFG9 0x400116c9u
#define CYREG_B1_P3_U1_CFG10 0x400116cau
#define CYREG_B1_P3_U1_CFG11 0x400116cbu
#define CYREG_B1_P3_U1_CFG12 0x400116ccu
#define CYREG_B1_P3_U1_CFG13 0x400116cdu
#define CYREG_B1_P3_U1_CFG14 0x400116ceu
#define CYREG_B1_P3_U1_CFG15 0x400116cfu
#define CYREG_B1_P3_U1_CFG16 0x400116d0u
#define CYREG_B1_P3_U1_CFG20 0x400116d4u
#define CYREG_B1_P3_U1_CFG21 0x400116d5u
#define CYREG_B1_P3_U1_CFG22 0x400116d6u
#define CYREG_B1_P3_U1_CFG23 0x400116d7u
#define CYREG_B1_P3_U1_CFG24 0x400116d8u
#define CYREG_B1_P3_U1_CFG25 0x400116d9u
#define CYREG_B1_P3_U1_CFG26 0x400116dau
#define CYREG_B1_P3_U1_CFG27 0x400116dbu
#define CYREG_B1_P3_U1_CFG28 0x400116dcu
#define CYREG_B1_P3_U1_CFG29 0x400116ddu
#define CYREG_B1_P3_U1_CFG30 0x400116deu
#define CYREG_B1_P3_U1_CFG31 0x400116dfu
#define CYREG_B1_P3_U1_DCFG0 0x400116e0u
#define CYREG_B1_P3_U1_DCFG1 0x400116e2u
#define CYREG_B1_P3_U1_DCFG2 0x400116e4u
#define CYREG_B1_P3_U1_DCFG3 0x400116e6u
#define CYREG_B1_P3_U1_DCFG4 0x400116e8u
#define CYREG_B1_P3_U1_DCFG5 0x400116eau
#define CYREG_B1_P3_U1_DCFG6 0x400116ecu
#define CYREG_B1_P3_U1_DCFG7 0x400116eeu
#define CYDEV_UCFG_B1_P3_ROUTE_BASE 0x40011700u
#define CYDEV_UCFG_B1_P3_ROUTE_SIZE 0x000000efu
#define CYDEV_UCFG_B1_P4_BASE 0x40011800u
#define CYDEV_UCFG_B1_P4_SIZE 0x000001efu
#define CYDEV_UCFG_B1_P4_U0_BASE 0x40011800u
#define CYDEV_UCFG_B1_P4_U0_SIZE 0x00000070u
#define CYREG_B1_P4_U0_PLD_IT0 0x40011800u
#define CYREG_B1_P4_U0_PLD_IT1 0x40011804u
#define CYREG_B1_P4_U0_PLD_IT2 0x40011808u
#define CYREG_B1_P4_U0_PLD_IT3 0x4001180cu
#define CYREG_B1_P4_U0_PLD_IT4 0x40011810u
#define CYREG_B1_P4_U0_PLD_IT5 0x40011814u
#define CYREG_B1_P4_U0_PLD_IT6 0x40011818u
#define CYREG_B1_P4_U0_PLD_IT7 0x4001181cu
#define CYREG_B1_P4_U0_PLD_IT8 0x40011820u
#define CYREG_B1_P4_U0_PLD_IT9 0x40011824u
#define CYREG_B1_P4_U0_PLD_IT10 0x40011828u
#define CYREG_B1_P4_U0_PLD_IT11 0x4001182cu
#define CYREG_B1_P4_U0_PLD_ORT0 0x40011830u
#define CYREG_B1_P4_U0_PLD_ORT1 0x40011832u
